
// BSLLS:UnusedLocalVariable-off Переменные формы
&НаКлиенте
Перем ТранспортИнтеграции, BlocklyExecutor;
// BSLLS:UnusedLocalVariable-on

#Область include_kedo_base_ПодборПерсонала_УстановитьЛокализацию
#КонецОбласти

#Область include_core_base_Авторизация_ОткрытьФормуАвторизацииПриОтсутствииСессии
#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ТипПоиска = "Отсутствует";
	Элементы.ГруппаФильтр.Видимость = (ЭтаФорма.ТипПоиска <> "Отсутствует");
	ДобавитьИнформациюОВерсии(Элементы.ВерсияПродукта);
	ЭтаФорма.ЭтоВнешняяОбработка = ЭтоВнешняяОбработка();
	УстановитьЛокализацию();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	context_params = ПроверитьНаличиеПараметровПодключенияНаСервере(); 
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
	BlocklyExecutor = ПолучитьФормуBlockly();

	ОбработчикПослеАвторизации = Новый ОписаниеОповещения("ПриОткрытииПослеАвторизации", ЭтаФорма);
	ОткрытьФормуАвторизацииПриОтсутствииСессии(context_params, ТранспортИнтеграции, ОбработчикПослеАвторизации);	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииПослеАвторизации(Результат, ДопПараметры = Неопределено) Экспорт
	Если Результат = Неопределено Тогда
		ЭтаФорма.Закрыть();
		Возврат;	
	КонецЕсли;
	
	СтатусВерсии = ПолучитьИнформациюОВерсииПоУмолчанию();
	СтатусВерсии = ПолучитьСтатусВерсииНаФорме(Ложь);
	ОбновитьИнформациюОВерсии(СтатусВерсии);

	ОбновитьСписок();	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "SabySignOut" 
		Или ИмяСобытия = "Saby_ЗавершениеДлительнойОперации" 
		Или ИмяСобытия = "Saby_ЗавершениеВыполнитьДействие" Тогда
		ОбновитьСписок();
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

#Область ФильтрыСпискаЗадач

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	ВидимостьФильтра = (ЭтаФорма.ТипПоиска <> "Отсутствует");
	Элементы.ГруппаФильтр.Видимость = ВидимостьФильтра;
	Если  НЕ ВидимостьФильтра Тогда
		ЭтаФорма.СтрокаПоиска = "";
	КонецЕсли;
	
	эПоиск = Элементы.СтрокаПоиска;
	Если ЭтаФорма.ТипПоиска = "Name" Тогда
		эПоиск.ПодсказкаВвода = "Введите ФИО...";
	ИначеЕсли ЭтаФорма.ТипПоиска = "Phone" Тогда
		эПоиск.ПодсказкаВвода = "Введите телефон...";
	ИначеЕсли ЭтаФорма.ТипПоиска = "Email" Тогда
		эПоиск.ПодсказкаВвода = "Введите эл. почту...";
	Иначе
		эПоиск.ПодсказкаВвода = "";
		// Перечитать полный списой, сброс фильтра
		ОбновитьСписок();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоискОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЭтаФорма.СтрокаПоиска = "";
	ОбновитьСписок();	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьФильтр(Команда)
	ОбновитьСписок();
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
		ОбновитьСписок();
КонецПроцедуры

&НаКлиенте
Процедура СообщениеПользователю(ТекстСообщения) Экспорт 

	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.Текст = ТекстСообщения;
	СообщениеПользователю.Сообщить();	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьСписок(Команда)
	ОбновитьСписок();
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеСпискаЗадач

&НаКлиенте
Процедура _ПослеАутентификации(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Если ЭтаФорма.Открыта() Тогда
			Закрыть();
		КонецЕсли;
		Возврат;
	КонецЕсли;		
	ОбновитьСписок();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(ОчиститьСписок = Истина)
	
	ИндексСтраницыНачала = 0;
	Если ОчиститьСписок Тогда 
		СписокКандидатов.Очистить();
	Иначе
		ИндексСтраницыНачала = ТекущаяСтраница;
	КонецЕсли;
	
	Попытка
		context_params = ПроверитьНаличиеПараметровПодключенияНаСервере(); 
		
		ЕстьЕще 		= Ложь;
		ЭлементовНаСтраницу = 30;
		Для ИндексСтраницы = ИндексСтраницыНачала По ТекущаяСтраница Цикл
			СтруктураТипПоиска =  Неопределено;
			Если ЭтаФорма.ТипПоиска <> "Отсутствует" И НЕ ПустаяСтрока(ЭтаФорма.СтрокаПоиска) Тогда
				СтруктураТипПоиска =  Новый Структура("Param, Value", ЭтаФорма.ТипПоиска, ЭтаФорма.СтрокаПоиска);
				СтруктураПоиск	=  Новый Структура("Search", СтруктураТипПоиска);
			КонецЕсли;
			СтруктураФильтр = Неопределено;
			СтруктураНавигации = Новый Структура("Page, Limit", ИндексСтраницы, ЭлементовНаСтраницу);
			ДополнительныеПоля = Новый Массив();
			ДополнительныеПоля.Добавить("SabyLink");
			ДополнительныеПоля.Добавить("FaceKey");
			ДополнительныеПоля.Добавить("Contacts");
			ДополнительныеПоля.Добавить("Events");

			Ответ = ТранспортИнтеграции.local_helper_candidate_list(
				context_params,
				СтруктураПоиск,
				ДополнительныеПоля,
				СтруктураФильтр,
				СтруктураНавигации);	
			ДополнитьСписокКандидатовДанными(get_prop(Ответ, "Data", Новый Массив) );
			ЕстьЕще = get_prop(Ответ, "HasMore");
		КонецЦикла;
		
		Если ЕстьЕще Тогда 
			СтрокаСпискаЗадач 			= СписокКандидатов.Добавить();
			СтрокаСпискаЗадач.Телефон = "Загрузить ещё";
		КонецЕсли;		
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфоОбОшибке);

		ОписаниеОшибки = СтруктураОшибки.detail;
		ПоказатьОповещениеПользователя(
			"Ошибка",,ОписаниеОшибки,
			БиблиотекаКартинок["Ошибка32"],
			СтатусОповещенияПользователя.Важное, Новый УникальныйИдентификатор);

		Возврат;
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуИдентификаторовДокументовСбис(СписокДокументовСбис)
	tUID = Новый ТаблицаЗначений;
	tUID.Колонки.Добавить("UID", Новый ОписаниеТипов("Строка") );
	Для Каждого ДокументСбис Из СписокДокументовСбис Цикл
		НовСтрока = tUID.Добавить();
		UID = get_prop(ДокументСбис,"FaceKey");
		НовСтрока.UID = Формат(UID, "ЧГ=0");
	КонецЦикла;
	Возврат tUID; 
КонецФункции

// Дополняет список персонала
//
// Параметры:
//  СписокДокументовСбис - Массив - список документов.
//
// BSLLS:TransferringParametersBetweenClientAndServer-off
&НаСервере
Процедура ДополнитьСписокКандидатовДанными(СписокДокументовСбис)
	ТаблицаИдентификаторов = ПолучитьТаблицуИдентификаторовДокументовСбис(СписокДокументовСбис);
	МодульОбъекта = МодульОбъекта();
	ТаблицаСсылок = МодульОбъекта.СтатусыДокументовПолучитьСостоянияОбъектов(ТаблицаИдентификаторов);
	
	Для Сч = 0 По СписокДокументовСбис.Количество() - 1 Цикл 
		ДанныеКандидата = СписокДокументовСбис[Сч];
		СтрокаСпискаЗадач = СписокКандидатов.Добавить(); 
		ЗаполнитьСтрокуКандидатаСбис(СтрокаСпискаЗадач, ДанныеКандидата);
		ЗаполнитьСтрокуКандидатаИзСтатуса1С(СтрокаСпискаЗадач, ТаблицаСсылок);
	КонецЦикла;
КонецПроцедуры
// BSLLS:TransferringParametersBetweenClientAndServer-on

&НаСервере
Процедура ЗаполнитьСтрокуКандидатаИзСтатуса1С(СтрокаЗадачи, Статусы1С)
	ОтборСтрок = Новый Структура("Uuid", СтрокаЗадачи.UID);
	СтрокиДокументов = Статусы1С.НайтиСтроки(ОтборСтрок);
	Для Каждого Статус1С Из СтрокиДокументов Цикл
		СтрокаЗадачи.Объект1С = Статус1С["Link"];
		// Для корректного вывода удаляем обработанную строку
		Статусы1С.Удалить(Статус1С);
		Прервать;
	КонецЦикла;
КонецПроцедуры	

&НаСервере
Функция ИмяСтатуса1С(ИмяСтатусаСБИС)
	Результат = ИмяСтатусаСБИС;
	Если Врег(ИмяСтатусаСБИС) = Врег("New") Тогда
		Результат = "Новый";
	ИначеЕсли Врег(ИмяСтатусаСБИС) = Врег("InWork") Тогда
		Результат = "На рассмотрении";
	ИначеЕсли Врег(ИмяСтатусаСБИС) = Врег("Rejected") Тогда
		Результат = "Отклонен";
	Иначе
		Если Врег(ИмяСтатусаСБИС) = Врег("Accepted") Тогда
			Результат = "Принят";
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ЗаполнитьСтрокуКандидатаСбис(СтрокаЗадачи, КандидатСбис)
	СтрокаЗадачи.Фамилия		= get_prop(КандидатСбис, "Surname");
	СтрокаЗадачи.Имя			= get_prop(КандидатСбис, "Name");
	СтрокаЗадачи.Отчество		= get_prop(КандидатСбис, "Patronymic");
	СтрокаЗадачи.ФИО			= СтрокаЗадачи.Фамилия + " " + СтрокаЗадачи.Имя + " " + СтрокаЗадачи.Отчество;
	ДеньРождения = get_prop(КандидатСбис, "Birthdate");
	МДеньРождения = СтрРазделить82(ДеньРождения, "-");
	ТриЭлемента = 3;
	Если МДеньРождения.Количество() = ТриЭлемента Тогда
		ОписаниеТипа = Новый ОписаниеТипов("Число");
		ДРГод = ОписаниеТипа.ПривестиЗначение(МДеньРождения[0]);
		ДРМесяц = ОписаниеТипа.ПривестиЗначение(МДеньРождения[1]);
		ДРДень = ОписаниеТипа.ПривестиЗначение(МДеньРождения[2]);
		ДеньРождения = Дата(ДРГод, ДРМесяц, ДРДень);
	КонецЕсли;
	СтрокаЗадачи.ДеньРождения	= ДеньРождения;
	
	СтрокаЗадачи.Должность			= get_prop(КандидатСбис, "Position", "");
	СтрокаЗадачи.Адрес				= get_prop(КандидатСбис, "Address", "");
	
	СобытияКандидата = get_prop(КандидатСбис, "Events", Новый Массив);
	Если СобытияКандидата.Количество() > 0 Тогда
		СтатусКандидата = get_prop(СобытияКандидата[0], "Comment", "");
	КонецЕсли;	
	Если Не ЗначениеЗаполнено(СтатусКандидата) Тогда 
		СтатусКандидата = get_prop(КандидатСбис, "Status", "");
	КонецЕсли;
	СтрокаЗадачи.СтатусКандидата	= ИмяСтатуса1С(СтатусКандидата);
	
	Если СобытияКандидата.Количество() > 0 Тогда
		ДатаПоследнегоСобытия = Формат(Дата(СтрЗаменить(get_prop(СобытияКандидата[0], "Date", "00010101"), "-","")), "ДЛФ=Д");
	Иначе
		ДатаПоследнегоСобытия = "";
	КонецЕсли;
	СтрокаЗадачи.ДатаПоследнегоСобытия	= ДатаПоследнегоСобытия;
	
	мТелефоны		= get_prop(get_prop(КандидатСбис, "Contacts"), "MobilePhone", "");
	Если ТипЗнч(мТелефоны) = Тип("Массив") Тогда
		СтрокаЗадачи.Телефон		= СтрСоединить82(мТелефоны, ", ");
	КонецЕсли;
	мЭлПочта		= get_prop(get_prop(КандидатСбис, "Contacts"), "Email", "");
	Если ТипЗнч(мЭлПочта) = Тип("Массив") Тогда
		СтрокаЗадачи.ЭлПочта		= СтрСоединить82(мЭлПочта, ", ");
	КонецЕсли;
	ЗначениеСБИС = get_prop(КандидатСбис, "Gender");
	СтрокаЗадачи.Пол			= ПолЗначение1С(ЗначениеСБИС);
	СтрокаЗадачи.Идентификатор	= get_prop(КандидатСбис, "FaceKey", 0);
	СтрокаЗадачи.UID			= Формат(get_prop(КандидатСбис, "FaceKey", 0), "ЧГ=0");
	СтрокаЗадачи.СсылкаСБИС		= get_prop(КандидатСбис, "SabyLink");
КонецПроцедуры

#КонецОбласти

#Область include_kedo_base_ПодборПерсонала_КонвертацияПола
#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СписокОбработкаВыбораСтроки();
КонецПроцедуры

&НаКлиенте
Процедура СписокКандидатовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокКандидатовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокКомандаОткрыть(Команда)
	ТекущиеДанные = Элементы.СписокКандидатов.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Документ1С) Тогда 
		ПоказатьЗначение(, ТекущиеДанные.Документ1С);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаВыбораСтроки()
	
	ТекущиеДанные = Элементы.СписокКандидатов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Телефон = "Загрузить ещё" Тогда
		ТекущаяСтраница = ТекущаяСтраница + 1;
		СписокКандидатов.Удалить(ТекущиеДанные);
		ОбновитьСписок(Ложь);
		Возврат;
	Иначе
		Если Не ТекущиеДанные.Объект1С = Неопределено Тогда
			ПоказатьЗначение(, ТекущиеДанные.Объект1С);
			Возврат;
		Иначе
			ПоказатьОповещениеПользователя(
				"",,"Физическое лицо отсутствует в 1С"
				,КартинкаОшибка());
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьМассивОбрабатываемыхКандидатов()  
	ВыгружаемыеДокументы = Новый Массив();
	Для Каждого ВыгружаемыйДокумент Из Элементы.СписокКандидатов.ВыделенныеСтроки Цикл
		СтрокаСпискаКандидатов = СписокКандидатов.НайтиПоИдентификатору(ВыгружаемыйДокумент);
		Если СтрокаСпискаКандидатов.Телефон = "Загрузить ещё" Тогда
			Продолжить;
		КонецЕсли;
				
		API3_ref = Новый Структура; 
		API3_ref.Вставить("SbisId",		СтрокаСпискаКандидатов.Идентификатор);
		API3_ref.Вставить("SbisType",	"Кандидат");
		API3_ref.Вставить("Type",		"Кандидат");
		API3_ref.Вставить("Title",		СтрокаСпискаКандидатов.ФИО);
		ВыгружаемыеДокументы.Добавить(API3_ref);
	КонецЦикла;
	Возврат ВыгружаемыеДокументы; 	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьВ1С(Команда)
	context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();
	ВыгружаемыеДокументы = СформироватьМассивОбрабатываемыхКандидатов();
	
	Контекст = Новый Структура;
	Контекст.Вставить("algorithm", "Документы_update");
	EndpointArgs = Новый Структура;
	EndpointArgs.Вставить("list_doc_ref", ВыгружаемыеДокументы);
	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("EndpointArgs", EndpointArgs);	
	Контекст.Вставить("ПараметрыВызова", ПараметрыВызова);
	Контекст.Вставить("context_params", context_params);
	Контекст.Вставить("НазваниеОперации", "Выгрузка в 1С");
	BlocklyExecutor.ЗапуститьINI(Контекст);
КонецПроцедуры

&НаКлиенте
Функция ТекущийОбъектИС() 
	ТД = Элементы.СписокКандидатов.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат ТД.Объект1С;
КонецФункции

&НаСервере
Функция СтруктураВыгрузкиДокумента(Знач Документ1С)
	Возврат Новый Структура("Ссылка,UID,ТипМетаданных,ТипОбъекта,ИмяИни", 
							Документ1С.Ссылка,
							Неопределено,
							Документ1С.Ссылка.Метаданные().Имя,
							Неопределено,
							Неопределено); 	
КонецФункции	

&НаКлиенте
Процедура ОбновитьВСБИС(Команда)
	Документ1С = ТекущийОбъектИС();
	Если Не ЗначениеЗаполнено(Документ1С) Тогда 
		ПоказатьОповещениеПользователя(
			"Ошибка",,
			"Невозможно обновить объект " + Врег(ИмяПродукта()) + ", так как он не был выгружен в 1С",
			БиблиотекаКартинок["Ошибка32"]);
		Возврат; 
	КонецЕсли;
	
	ДокументПереотправить = Новый Массив();
	ДокументПереотправить.Добавить(СтруктураВыгрузкиДокумента(Документ1С));
	ПараметрыВФорму = Новый Структура("Источник", ДокументПереотправить);
	ОткрытьФормуОбработки("ЗагрузкаДокументов", ПараметрыВФорму, ЭтаФорма, Новый УникальныйИдентификатор());
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВСБИС(Команда)
	ТД = Элементы.СписокКандидатов.ТекущиеДанные;
	Если ТД <> Неопределено И ЗначениеЗаполнено(ТД.СсылкаСБИС) Тогда
		ЗадачаСсылка = ПолучитьПрямуюССылку(ТД.СсылкаСБИС);
		#Если ТолстыйКлиентОбычноеПриложение Тогда
		// BSLLS:UsingSynchronousCalls-off
		ЗапуститьПриложение(ЗадачаСсылка);
		// BSLLS:UsingSynchronousCalls-on
		#Иначе	
		ПерейтиПоНавигационнойСсылке(ЗадачаСсылка);	
		#КонецЕсли
	КонецЕсли;	
КонецПроцедуры

#Область include_core_base_Helpers_ПолучитьПрямуюСсылку
#КонецОбласти

#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_ОберткаСерверныхКоманд
#КонецОбласти

#Область include_core_base_Helpers_FormGetters
#КонецОбласти

#Область include_core_base_Helpers_ExtException
#КонецОбласти

#Область include_base_НазваниеПродукта
#КонецОбласти

#Область include_core_base_ЗапускМодуля_ПроверкаВерсии_ПолучитьИмяФайлаИНомерТекущейВерсии
#КонецОбласти

#Область include_core_base_ЗапускМодуля_ПроверкаВерсии_НаФорме
#КонецОбласти

#Область include_core_base_ОсобенностиПлатформы_МодульФормы
#КонецОбласти

#Область include_core_base_Helpers_Картинки
#КонецОбласти

#Область includr_core_base_Helpers_ПрефиксПродукта
#КонецОбласти

#Область include_core_base_ДлительныеОперации_ПодготовкаФормыОсобенностиПродукта
#КонецОбласти

#Область include_core_base_Helpers_ЛокализацияНазваниеПродукта //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти
