#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры
#КонецОбласти

Процедура ОткрытьФормуДлительнойОперации(ФоновоеЗаданиеИмяМетода, ФоновоеЗаданиеПараметры, ФоновоеЗаданиеНаименование, Владелец, ОповещениеОЗакрытииФормы = Неопределено) Экспорт	
	Сообщение = Новый Структура("Показать, Пояснение, Текст, НавигационнаяСсылка", Истина, ФоновоеЗаданиеНаименование, "Выполняется...");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресДополнительногоРезультата");
	ПараметрыФормы.Вставить("АдресРезультата");
	ПараметрыФормы.Вставить("ВыводитьОкноОжидания", Истина);
	ПараметрыФормы.Вставить("ВыводитьПрогрессВыполнения", Истина);
	ПараметрыФормы.Вставить("ВыводитьСообщения", Истина);
	ПараметрыФормы.Вставить("ИдентификаторЗадания", Новый УникальныйИдентификатор);
	ПараметрыФормы.Вставить("Интервал", 1);
	ПараметрыФормы.Вставить("ОжидатьЗавершение", Ложь);
	ПараметрыФормы.Вставить("ОповещениеПользователя", Сообщение);
	ПараметрыФормы.Вставить("ПолучатьРезультат", Ложь);
	ПараметрыФормы.Вставить("ТекстСообщения", ФоновоеЗаданиеНаименование);
	ПараметрыФормы.Вставить("ФоновоеЗаданиеИмяМетода", ФоновоеЗаданиеИмяМетода);
	ПараметрыФормы.Вставить("ФоновоеЗаданиеПараметры", ФоновоеЗаданиеПараметры);
	ПараметрыФормы.Вставить("ФоновоеЗаданиеНаименование", ФоновоеЗаданиеНаименование);
	
	ОткрытьФорму("Обработка.SABY.Форма.ДлительнаяОперация", 
		ПараметрыФормы,
		Владелец,
		Новый УникальныйИдентификатор(),
		,
		,
		ОповещениеОЗакрытииФормы, 
		РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

Процедура ЗапуститьINIФоновымЗаданием(ini_name, ПараметрыВызоваИни, context_params = Неопределено, ФормаВладелец = Неопределено, ЗаголовокФормы="") Экспорт
	ОповещениеОЗакрытииФормыФоновогоЗадания = get_prop(context_params, "ОповещениеОЗакрытииФормыФоновогоЗадания");
	Если ТипЗнч(ОповещениеОЗакрытииФормыФоновогоЗадания) = Тип("ОписаниеОповещения") Тогда
		context_params.Удалить("ОповещениеОЗакрытииФормыФоновогоЗадания");
	Иначе
		ОповещениеОЗакрытииФормыФоновогоЗадания = Неопределено;
	КонецЕсли;	
	
	ПараметрыВызова = Saby_ФоновыеЗаданияСервер.ПодготовитьПараметрыЗапускINIФоновымЗаданием(ini_name, ПараметрыВызоваИни, context_params);
	
	context_params = ПараметрыВызова["params"];	 

	ВыполняемыйМетод = "ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОбработки";
	
	ПараметрыДлительныеОперации = Новый Структура;
	ПараметрыДлительныеОперации.Вставить("ИмяОбработки",		"SABY");
	ПараметрыДлительныеОперации.Вставить("ИмяМетода",			"API_BLOCKLY_RUN_BACKGROUND");
	ПараметрыДлительныеОперации.Вставить("ПараметрыВыполнения",	ПараметрыВызова);
	ПараметрыДлительныеОперации.Вставить("ЭтоВнешняяОбработка",	ЛОЖЬ);

	ПараметрыЗадания = Новый Массив();
	ПараметрыЗадания.Добавить(ПараметрыДлительныеОперации);
	ПараметрыЗадания.Добавить("");   
	
	ОткрытьФормуДлительнойОперации(ВыполняемыйМетод, ПараметрыЗадания, ЗаголовокФормы, ФормаВладелец,ОповещениеОЗакрытииФормыФоновогоЗадания); 
 
КонецПроцедуры 

Процедура ЗагрузитьСопоставленияПоУмолчаниюФоновымЗаданием(connection_info) Экспорт
	ПараметрыВызова = Новый Соответствие;
	
	ПараметрыВызова.Вставить("connection_info", connection_info);
	
	ПараметрыЗадания = Новый Массив();
	ПараметрыЗадания.Добавить(ПараметрыВызова);
	Saby_ФоновыеЗаданияКлиент.ОткрытьФормуДлительнойОперации("Saby_ФоновыеЗаданияСервер.API_BLOCKLY_PREDEFINE_BACKGROUND",ПараметрыЗадания, "", Неопределено, Неопределено);	
КонецПроцедуры	