
&После("ПриОпределенииКомандПодключенныхКОбъекту")
Процедура Saby_ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды)
	Если	
		//Форма исключения
		Saby_ВстраиваниеВСтандартныеФормы.ЭтоФормаИсключения(НастройкиФормы) ИЛИ
		//Проверка прав
		НЕ Saby_Core.ТекущемуПользователюМожноРаботатьСоСБИС() ИЛИ
		//Проверка функциональной опции
		НЕ Saby_Core.ВключеноИспользованиеПодсистемыКЕДО() ИЛИ
		//Обънект с которым мы НЕ поддерживаем обмен
		НЕ Saby_ВстраиваниеВСтандартныеФормы.ЭтотОбъектМетаданныхЗахвачен(НастройкиФормы)
		Тогда 
		Возврат;
	КонецЕсли;
	Saby_ВстраиваниеВСтандартныеФормы.ДобавитьКомандыСБИС(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды);

КонецПроцедуры
