
#Область include_base_CommonModule_ИмяМодуляCore
#КонецОбласти

#Область include_base_CommonModule_ИмяМодуляВстраиваниеВСтандартныеФормы
#КонецОбласти

&После("ПриОпределенииКомандПодключенныхКОбъекту")
Процедура Integration_ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды)
	МодульВстраиваниеВСтандартныеФормы = МодульВстраиваниеВСтандартныеФормы(); 
	МодульCore = МодульCore();
	
	УсловиеДЛяОтказаВывода = 
		// Форма исключения
		МодульВстраиваниеВСтандартныеФормы.ЭтоФормаИсключения(НастройкиФормы)
		// Проверка прав
		Или НЕ МодульCore.ТекущемуПользователюМожноРаботатьСРасширением()
		// Проверка функциональной опции
		Или НЕ МодульCore.ВключеноИспользованиеПодсистемыКЕДО()
		// Обънект с которым мы НЕ поддерживаем обмен
		Или НЕ МодульВстраиваниеВСтандартныеФормы.ЭтотОбъектМетаданныхЗахвачен(НастройкиФормы);
	Если УсловиеДЛяОтказаВывода Тогда 
		Возврат;
	КонецЕсли;
	МодульВстраиваниеВСтандартныеФормы.ДобавитьКоманды(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды);
КонецПроцедуры
