
#Область include_base_CommonModule_ИмяМодуляCore
#КонецОбласти

#Область include_base_CommonModule_ИмяМодуляВстраиваниеВСтандартныеФормы
#КонецОбласти

&После("ПриОпределенииКомандПодключенныхКОбъекту")
Процедура Integration_ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды)
	
	МодульВстраиваниеВСтандартныеФормы = МодульВстраиваниеВСтандартныеФормы(); 
	МодульCore = МодульCore();

	Если	
		//Форма исключения
		МодульВстраиваниеВСтандартныеФормы.ЭтоФормаИсключения(НастройкиФормы) ИЛИ
		//Проверка прав
		НЕ МодульCore.ТекущемуПользователюМожноРаботатьСРасширением() ИЛИ
		//Проверка функциональной опции
		НЕ МодульCore.ВключеноИспользованиеПодсистемыКЕДО() ИЛИ
		//Обънект с которым мы НЕ поддерживаем обмен
		НЕ МодульВстраиваниеВСтандартныеФормы.ЭтотОбъектМетаданныхЗахвачен(НастройкиФормы)
		Тогда 
		Возврат;
	КонецЕсли;
	МодульВстраиваниеВСтандартныеФормы.ДобавитьКоманды(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды);

КонецПроцедуры
