
Функция НайтиЭлементФормыПоИмени(ДочерниеЭлементы, ИмяЭлемента)
	СтрокаПоиска		= Неопределено;
	Для Каждого ЭлементДочерний Из  ДочерниеЭлементы Цикл
		Если Найти(ЭлементДочерний.Имя, ИмяЭлемента) > 0 Тогда
			СтрокаПоиска	= ЭлементДочерний;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат СтрокаПоиска;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Уход от версионирования, Метод ВывестиКоманды Выхывается всего 1 раз из ПриСозданииНаСервере, у которого
// меняются параметры и мы зависм от версии БСП

&НаСервере
&Вместо("ВывестиКоманды")
Процедура Integration_ВывестиКоманды(Форма, Команды, ПараметрыРазмещения)
	ПродолжитьВызов(Форма, Команды, ПараметрыРазмещения);
	
	// Вставить содержимое метода.
	МодульВстраиваниеВСтандартныеФормы = МодульВстраиваниеВСтандартныеФормы(); 
	КомандыТаблица = ТаблицаКоманд(); // Получаем пустую таблицу команд средствами 1с
	МодульВстраиваниеВСтандартныеФормы.ВстроитьЭлементыИнтеграцииНаФорму(Форма, ПараметрыРазмещения, КомандыТаблица);

	// В бухгалтерии нужно немного подвинуть группу команд в лево.
	// иначе ее не видно на панели задач
	Если Найти(Метаданные.Имя, "Бухгалтерия") = 0 Тогда
		Возврат;
	КонецЕсли;
	Если ПараметрыРазмещения.КоманднаяПанель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РодительЭлемента	= Форма.Элементы.Найти(ПараметрыРазмещения.КоманднаяПанель.Имя);
	ДочерниеЭлементы	= РодительЭлемента.ПодчиненныеЭлементы;
	НазваниеПродукта 	= ЛокализацияНазваниеПродукта();
	Подгруппа			= ДочерниеЭлементы.Найти("ИнтеграцияГруппаКоманд");
	
	СтрокаПоиска = НайтиЭлементФормыПоИмени(ДочерниеЭлементы, "СтрокаПоиска");
	Если
		РодительЭлемента <> Неопределено
		И СтрокаПоиска <> Неопределено
		И Подгруппа <> Неопределено
									Тогда
		Форма.Элементы.Переместить(Подгруппа, РодительЭлемента, СтрокаПоиска);
	КонецЕсли;
КонецПроцедуры

