
#Область include_base_InformationRegister_ИмяРегистраСостояние
#КонецОбласти

#Область include_kedo_base_Form_ДокументыКЭДО_УстановитьТекустЗапросаСписка
#КонецОбласти

&НаСервере
Процедура СоздатьКолонкиДинамическогоСписка()
	ТипПолеФормы = Тип("ПолеФормы");
	
	// Колонка признак наличия вложения	
	Элемент = ЭтаФорма.Элементы.Добавить("Список_ЕстьФайлы" , Тип("ПолеФормы"), ЭтаФорма.Элементы.Список );
	Элемент.ПутьКДанным			= "Список.ЕстьФайлы";
	Элемент.Заголовок			= "";
	Элемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Нет;
	Элемент.Вид					= ВидПоляФормы.ПолеКартинки;
	Элемент.Ширина				= 1;
	Элемент.КартинкаШапки		= БиблиотекаКартинок[ЛокализацияНазваниеПродукта() + "_Скрепка"];
	Элемент.КартинкаЗначений	= БиблиотекаКартинок["КоллекцияСкрепка"];
	ЭтаФорма.Список.УстановитьОбязательноеИспользование("Список_ЕстьФайлы", Истина);
	ЭтаФорма.Элементы.Переместить(Элемент, ЭтаФорма.Элементы.Список, ЭтаФорма.Элементы.СписокОбъект);
	
	// Колонка Организация	
	Элемент = ЭтаФорма.Элементы.Добавить("Список_Организация", ТипПолеФормы, ЭтаФорма.Элементы.Список );
	Элемент.ПутьКДанным			= "Список.Организация";
	Элемент.Заголовок			= "Организация";
	Элемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Авто;
	ЭтаФорма.Список.УстановитьОбязательноеИспользование("Список_Организация", Истина);
	ЭтаФорма.Элементы.Переместить(Элемент, ЭтаФорма.Элементы.Список, ЭтаФорма.Элементы.СписокСостояниеИндексКартинки);
	
	// Колонка Сотрудник	
	Элемент = ЭтаФорма.Элементы.Добавить("Список_Сотрудник", ТипПолеФормы, ЭтаФорма.Элементы.Список );
	Элемент.ПутьКДанным			= "Список.Сотрудник";
	Элемент.Заголовок			= "Сотрудник";
	Элемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Авто;
	ЭтаФорма.Список.УстановитьОбязательноеИспользование("Список_Сотрудник", Истина);
	ЭтаФорма.Элементы.Переместить(Элемент, ЭтаФорма.Элементы.Список, ЭтаФорма.Элементы.СписокСостояниеИндексКартинки);
	
	// Колонка Подразделение	
	Элемент = ЭтаФорма.Элементы.Добавить("Список_Подразделение", ТипПолеФормы, ЭтаФорма.Элементы.Список );
	Элемент.ПутьКДанным			= "Список.Подразделение";
	Элемент.Заголовок			= "Подразделение";
	Элемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Авто;
	ЭтаФорма.Список.УстановитьОбязательноеИспользование("Список_Подразделение", Истина);
	ЭтаФорма.Элементы.Переместить(Элемент, ЭтаФорма.Элементы.Список, ЭтаФорма.Элементы.СписокСостояниеИндексКартинки);
	
	// Колонка ПризнакКЭДО
	Элемент = ЭтаФорма.Элементы.Добавить("Список_ПризнакКЭДО", ТипПолеФормы, ЭтаФорма.Элементы.Список );
	Элемент.ПутьКДанным			= "Список.ПризнакКЭДО";
	Элемент.Заголовок			= "КЭДО";
	Элемент.Вид					= ВидПоляФормы.ПолеКартинки;
	Элемент.Ширина				= 1;
	Элемент.КартинкаЗначений	= БиблиотекаКартинок[ЛокализацияНазваниеПродукта() + "_Bird"];
	ЭтаФорма.Список.УстановитьОбязательноеИспользование("Список_ПризнакКЭДО", Истина);
	ЭтаФорма.Элементы.Переместить(Элемент, ЭтаФорма.Элементы.Список, ЭтаФорма.Элементы.СписокСостояниеИндексКартинки);
	
	Элемент = ЭтаФорма.Элементы.Найти("СписокСостояниеИндексКартинки");
	Если Элемент <> Неопределено Тогда
		Элемент.Заголовок	= ЛокализацияНазваниеПродукта();
		Элемент.Ширина	= 1;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьКнопкиКоманднойПанели()
	ПанельКомандФормы = ЭтаФорма.Элементы.Найти("КоманднаяПанельФормы");
	Если ПанельКомандФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// ГруппаКоманд SABY
	НоваяГруппаРодитель = ЭтаФорма.Элементы.Добавить("ГруппаДействияSABY", Тип("ГруппаФормы"), ПанельКомандФормы);
	НоваяГруппаРодитель.Вид = ВидГруппыФормы.ГруппаКнопок;
	НоваяГруппаРодитель.Заголовок = ЛокализацияНазваниеПродукта();

	ТипКнопкаФормы = Тип("КнопкаФормы");
	ЭтаФорма.Команды.ЗагрузитьВSABY.Заголовок = "Загрузить в " + ЛокализацияНазваниеПродукта();
	ЭтаФорма.Команды.ЗагрузитьВSABY.Подсказка = "Загрузить в " + ЛокализацияНазваниеПродукта();
	МояКнопка = ЭтаФорма.Элементы.Добавить("ЗагрузитьВSABY", ТипКнопкаФормы, НоваяГруппаРодитель );
	МояКнопка.ИмяКоманды = "ЗагрузитьВSABY";
	МояКнопка.Картинка	= БиблиотекаКартинок["ОтправитьСообщение"];
	МояКнопка.Отображение	= ОтображениеКнопки.КартинкаИТекст;
	
	ЭтаФорма.Команды.ВыгрузитьВложенияВSABY.Заголовок = "Выгрузить вложения в 1С";
	ЭтаФорма.Команды.ВыгрузитьВложенияВSABY.Подсказка = "Выгрузить вложения в 1С";
	МояКнопка = ЭтаФорма.Элементы.Добавить("ВыгрузитьВложенияВSABY", ТипКнопкаФормы, НоваяГруппаРодитель );
	МояКнопка.ИмяКоманды = "ВыгрузитьВложенияВSABY";
	МояКнопка.Картинка	= БиблиотекаКартинок["Записать"];
	МояКнопка.Отображение	= ОтображениеКнопки.КартинкаИТекст;

	ЭтаФорма.Команды.ОткрытьВSABY.Заголовок = "Открыть в " + ЛокализацияНазваниеПродукта();
	ЭтаФорма.Команды.ОткрытьВSABY.Подсказка = "Открыть в " + ЛокализацияНазваниеПродукта();
	МояКнопка = ЭтаФорма.Элементы.Добавить("ОткрытьВSABY", ТипКнопкаФормы, НоваяГруппаРодитель );
	МояКнопка.ИмяКоманды = "ОткрытьВSABY";
	МояКнопка.Картинка	= БиблиотекаКартинок["ПерейтиПоВнешнейНавигационнойСсылке"];
	МояКнопка.Отображение	= ОтображениеКнопки.КартинкаИТекст;

	ЭтаФорма.Команды.ОбновитьСтатусы.Заголовок = "Обновить статусы";
	ЭтаФорма.Команды.ОбновитьСтатусы.Подсказка = "Обновить статусы";
	МояКнопка = ЭтаФорма.Элементы.Добавить("ОбновитьСтатусы", ТипКнопкаФормы, НоваяГруппаРодитель );
	МояКнопка.ИмяКоманды = "ОбновитьСтатусы";
	МояКнопка.Отображение	= ОтображениеКнопки.КартинкаИТекст;
КонецПроцедуры

#Область include_core_base_Helpers_СписокДоменовСервис
#КонецОбласти 

Процедура  ЗаполнитьСписокСервисов()
	Модуль = МодульОбъекта();
	ТранспортSabyHttpsClient = (Модуль.ВидТранспорта(context_params) = "SabyHttpsClient");
	
	СписокДоменов = Модуль.СписокСерверовSaby(ТранспортSabyHttpsClient);
	СтруктураСУРЛ = Новый Структура;
	Для Каждого ЗаписьСервиса Из СписокДоменов Цикл
		СтруктураСУРЛ.Вставить("api_url", ЗаписьСервиса.Представление);
		ЗначениеСервиса = СтатусыДокументовСервис(СтруктураСУРЛ);

		Если Элементы.Сервис.СписокВыбора.НайтиПоЗначению(ЗначениеСервиса) = Неопределено Тогда
			ПредставлениеСервиса = ЗначениеСервиса;
			Если ПустаяСтрока(ПредставлениеСервиса) Тогда 
				ПредставлениеСервиса = "online";
			КонецЕсли;
			Элементы.Сервис.СписокВыбора.Добавить(ЗначениеСервиса, ПредставлениеСервиса);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура УстановитьФильтрЖурналаДокументов(ДанныеФильтра)
	
	Если ТипЗнч(ДанныеФильтра) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	Для Каждого ЗаписьФильтра Из ДанныеФильтра Цикл 
		// Структура "Поле, ПравоеЗначение , ВидСравнения"
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ЗаписьФильтра.Поле);    
	    ЭлементОтбора.ВидСравнения   = ЗаписьФильтра.ВидСравнения;
	    ЭлементОтбора.Использование  = Истина;
	    ЭлементОтбора.ПравоеЗначение = ЗаписьФильтра.ПравоеЗначение;
	    ЭлементОтбора.Представление  = ЗаписьФильтра.Поле;
		Если Врег(ЗаписьФильтра.Поле) = "СОТРУДНИК" Тогда
			ЭтаФорма.Сотрудник = ЗаписьФильтра.ПравоеЗначение[0];
			ЭтаФорма.СотрудникИспользовать = Не Сотрудник.Пустая();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры	

&НаСервере
Функция СБИСПараметры()
	МодульОбъекта = МодульОбъекта();
	saby_param = МодульОбъекта.НастройкиПодключенияПрочитать();
	Возврат saby_param;
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокДоступныхАккаунтов(ТекущийАккаунт)
	Запрос = Новый Запрос;
// BSLLS:QueryParseError-off
// Не реально при разных именах метаданных
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СостояниеО.Аккаунт КАК Аккаунт
		|ИЗ
		|	РегистрСведений." + ИмяРегистраСостояние() + " КАК СостояниеО
		|ГДЕ
		|	СостояниеО.Аккаунт <> &ТекущийАккаунт";
// BSLLS:QueryParseError-on
	Запрос.Параметры.Вставить("ТекущийАккаунт", ТекущийАккаунт);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	РезультатЗапроса.Свернуть("Аккаунт");
	мАккаунтовБазы = РезультатЗапроса.ВыгрузитьКолонку("Аккаунт");
	
	Элементы.Аккаунт.СписокВыбора.ЗагрузитьЗначения(мАккаунтовБазы);
	// BSLLS:StyleElementConstructors-off
	// Трубует установить стиль шрифта из стлей 1с конфигуратора
	Элементы.Аккаунт.СписокВыбора.Вставить(0, ТекущийАккаунт, 
		Новый ФорматированнаяСтрока(ТекущийАккаунт, Новый Шрифт(, , Истина))); 
	// BSLLS:StyleElementConstructors-on
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьТекстЗапросаСписка();
	СоздатьКолонкиДинамическогоСписка();
	СоздатьКнопкиКоманднойПанели();
	ЗаполнитьСписокСервисов();
	
	УстановитьФильтрЖурналаДокументов(get_prop(Параметры, "Фильтр"));
	
	КонтПарам = Неопределено;
	Параметры.Свойство("context_param", КонтПарам);
	Если КонтПарам = Неопределено Тогда
		КонтПарам = СБИСПараметры();
	КонецЕсли;
	Сервис	= get_prop(КонтПарам, "service", "");
	Аккаунт	= get_prop(КонтПарам, "account", "");
	СервисИспользовать	= Истина;
	АккаунтИспользовать	= НЕ ПустаяСтрока(Аккаунт);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтотОбъект.Список,
		"Сервис",
		Сервис,
		ВидСравненияКомпоновкиДанных.Равно, ,
		СервисИспользовать);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтотОбъект.Список,
		"Аккаунт",
		Аккаунт,
		ВидСравненияКомпоновкиДанных.Равно, ,
		АккаунтИспользовать);

	ЗаполнитьСписокДоступныхАккаунтов(Аккаунт);
	
	ОбъектыМетаданных = Новый Массив;
	МассивДоступныхТипов = Метаданные.РегистрыСведений[ИмяРегистраСостояние()].Измерения.Объект.Тип.Типы();
	Для Каждого ТипИсточника Из МассивДоступныхТипов Цикл
		ОбъектыМетаданных.Добавить( Метаданные.НайтиПоТипу(ТипИсточника) );
	КонецЦикла;
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.Источники	= 	ОбъектыМетаданных;
	ПараметрыРазмещения.КоманднаяПанель = Элементы.КоманднаяПанельФормы;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Скрыть ненужные элементы интерфейса
	ЭлПорядокЭлементов = ЭтаФорма.Элементы.Найти("НастройкаПорядкаЭлементов");
	Если ЭлПорядокЭлементов <> Неопределено Тогда 
		ЭлПорядокЭлементов.Видимость = Ложь;
	КонецЕсли;
	ПоказатьТекстСообщения();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Три функции системы команд подсистемы БСП 
//
// Параметры:
//  Команда - Команда - Команда текущей формы.
//
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область МетодыКоманднойПанели

&НаКлиенте
Функция ДанныеИсточника()
	Источник = Новый Массив;
	Для Каждого ИдентификаторСтроки Из Элементы.Список.ВыделенныеСтроки Цикл
		Источник.Добавить( Элементы.Список.ДанныеСтроки(ИдентификаторСтроки).Ссылка );
	КонецЦикла;
	Возврат Источник;
КонецФункции

&НаКлиенте
Функция ПараметрыВызоваКоманды()
	ПараметрКоманды = Новый Структура();
	ПараметрКоманды.Вставить("Источник", ДанныеИсточника());
	ПараметрКоманды.Вставить("ОписаниеКоманды", Новый Структура());
	ПараметрКоманды.ОписаниеКоманды.Вставить("ПараметрыФормы", Новый Структура());
	ПараметрКоманды.ОписаниеКоманды.ПараметрыФормы.Вставить("ИмяИни", Неопределено);
	ПараметрКоманды.Вставить("Форма", ЭтаФорма);
	ПараметрКоманды.Вставить("ЭтоФормаОбъекта", Ложь);
	Возврат ПараметрКоманды;
КонецФункции

&НаКлиенте
Процедура ВыгрузитьВложенияВSABY(Команда)
	МодульКомандыОбменаДляФормыКлиент().ПриНажатииВыгрузитьВложенияИзСБИС(Команда, ПараметрыВызоваКоманды());
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВSABY(Команда)
	МодульКомандыОбменаДляФормыКлиент().ЗагрузитьВСБИС(Команда, ПараметрыВызоваКоманды());
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусы(Команда)
	МодульКомандыОбменаДляФормыКлиент().ПриНажатииОбновитьСтатусы(Команда, ПараметрыВызоваКоманды());
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВSABY(Команда)
	МодульКомандыОбменаДляФормыКлиент().ПриНажатииОткрытьВСБИСПолучитьUID(Команда, ПараметрыВызоваКоманды());
КонецПроцедуры

#КонецОбласти

#Область МетодыФормы

&НаКлиенте
Процедура ОрганизацияИспользоватьПриИзменении(Элемент)
	УстановитьФильтр("Организация", Организация, ОрганизацияИспользовать);
КонецПроцедуры

&НаКлиенте
Процедура СотрудникИспользоватьПриИзменении(Элемент)
	УстановитьФильтр("Сотрудник", Сотрудник, СотрудникИспользовать);
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаИспользоватьПриИзменении(Элемент)
	УстановитьФильтр("Состояние", СтатусДокумента, СтатусДокументаИспользовать);
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеИспользоватьПриИзменении(Элемент)
	УстановитьФильтр("Подразделение", Подразделение, ПодразделениеИспользовать);
КонецПроцедуры

&НаКлиенте
Процедура АккаунтИспользоватьПриИзменении(Элемент)
	УстановитьФильтр("Аккаунт", Аккаунт, АккаунтИспользовать И НЕ ПустаяСтрока(Аккаунт));
КонецПроцедуры

&НаКлиенте
Процедура СервисИспользоватьПриИзменении(Элемент)
	УстановитьФильтр("Сервис", Сервис, СервисИспользовать);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияИспользовать = Истина И НЕ Организация.Пустая();
	УстановитьФильтр("Организация", Организация, ОрганизацияИспользовать);
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	СотрудникИспользовать = Истина И НЕ Сотрудник.Пустая();
	УстановитьФильтр("Сотрудник", Сотрудник, СотрудникИспользовать);
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаПриИзменении(Элемент)
	СтатусДокументаИспользовать = Истина И НЕ СтатусДокумента.Пустая(); 
	УстановитьФильтр("Состояние", СтатусДокумента, СтатусДокументаИспользовать);
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ПодразделениеИспользовать = Истина И НЕ Подразделение.Пустая(); 
	УстановитьФильтр("Подразделение", Подразделение, ПодразделениеИспользовать);
КонецПроцедуры

&НаКлиенте
Процедура АккаунтПриИзменении(Элемент)
	АккаунтИспользовать = Истина И НЕ ПустаяСтрока(Аккаунт); 
	УстановитьФильтр("Аккаунт", Аккаунт, АккаунтИспользовать);
КонецПроцедуры

&НаКлиенте
Процедура СервисПриИзменении(Элемент)
	УстановитьФильтр("Сервис", Сервис, СервисИспользовать);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФильтр(Реквизит, ПравоеЗначение, Использование, ВидСравнения = Неопределено)
	Если ВидСравнения = Неопределено Тогда
		ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		ЭтотОбъект.Список, 
		Реквизит, 
		ПравоеЗначение,
		ВидСравнения, ,
		Использование);
КонецПроцедуры

#КонецОбласти

#Область МетодыСписка

#Область include_kedo_base_Form_ДокументыКЭДО_СписокПриАктивизацииСтроки
#КонецОбласти

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(, ТекущиеДанные.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область include_core_base_locale_ЛокализацияНазваниеПродукта
#КонецОбласти

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры
#КонецОбласти

#Область include_core_base_Helpers_FormGetters
#КонецОбласти

#Область include_base_CommonModule_ИменаМодулейКлиент
#КонецОбласти

#Область include_core_base_СтатусыДокументов_ПоказатьТекстСообщения
#КонецОбласти

#Область include_core_base_ФоновыеЗадания_МодульФоновогоЗаданияКлиент
#КонецОбласти

