
// BSLLS:UnusedLocalVariable-off
	ЧастьЗапроса = "
	|
	|	ВТОбъектыФ КАК ВТОбъектыФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыеСведения.СрезПоследних(&НаДату, Сотрудник В (ВЫБРАТЬ ВТСотрудникИ.Сотрудник ИЗ ВТСотрудникИ)) КАК КадроваяИстория
	|		ПО (ВТОбъектыФ.Организация = КадроваяИстория.Организация)
	|			И (ВТОбъектыФ.СотрудникСтыковка = КадроваяИстория.Сотрудник)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СвойстваКЭДО КАК СвойстваКЭДО
	|		ПО ВТОбъектыФ.СотрудникСтыковка = СвойстваКЭДО.Сотрудник";	
// BSLLS:UnusedLocalVariable-on
