
// BSLLS:UnusedLocalVariable-off
	ЧастьЗапроса = "
	|
	|	ВТОбъектыФ КАК ВТОбъектыФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&НаДату, Сотрудник В (ВЫБРАТЬ ВТСотрудникИ.Сотрудник ИЗ ВТСотрудникИ) ) КАК КадроваяИстория
	|		ПО ВТОбъектыФ.Организация = КадроваяИстория.ГоловнаяОрганизация
	|			И ВТОбъектыФ.СотрудникСтыковка = КадроваяИстория.Сотрудник
	|			И ВТОбъектыФ.СотрудникСтыковка.ФизическоеЛицо = КадроваяИстория.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ СвойстваКЭДО КАК СвойстваКЭДО
	|		ПО ВТОбъектыФ.СотрудникСтыковка = СвойстваКЭДО.Сотрудник";
// BSLLS:UnusedLocalVariable-on
