
&НаСервере
Процедура УстановитьТекстЗапросаСписка()
	НовыйЗапрос	=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|ДС.Объект КАК Сотрудник,
	|ВЫБОР КОГДА ДС.Значение = ИСТИНА
	|	ТОГДА 1
	|	ИНАЧЕ 0
	|КОНЕЦ КАК ИндексКартинки,
	|ДС.Значение КАК КЭДО
	|ПОМЕСТИТЬ СвойстваКЭДО
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДС
	|ГДЕ
	|	ДС.Свойство.Имя = ""КЭДО""
	|;
    |
	|////////////////////////////////////////////////////////////////////////////////
    |	ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Saby_Состояние.Объект КАК Ссылка,
	|	Saby_Состояние.Сервис КАК Сервис,
	|	Saby_Состояние.Аккаунт КАК Аккаунт,
	|	Saby_Состояние.АктивныйЭтап КАК АктивныйЭтап,
	|	Saby_Состояние.Состояние КАК Состояние,
	|	Saby_Состояние.UID КАК UID,
	|	Saby_Состояние.SbisId КАК SbisId,
	|	ВЫБОР
	|		КОГДА НаличиеФайлов.ЕстьФайлы ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА НаличиеФайлов.ЕстьФайлы
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЕстьФайлы,
	|	ВЫБОР
	|		КОГДА Saby_Состояние.Объект.Организация ЕСТЬ NULL
	|			ТОГДА Saby_Состояние.Объект.ГоловнаяОрганизация
	|		ИНАЧЕ Saby_Состояние.Объект.Организация
	|	КОНЕЦ КАК Организация,
	|	ВЫБОР
	|		КОГДА НЕ Saby_Состояние.Объект.Сотрудник ЕСТЬ NULL
	|			ТОГДА	Saby_Состояние.Объект.Сотрудник
	|		КОГДА НЕ Saby_Состояние.Объект.КраткийСоставДокумента ЕСТЬ NULL
	|			ТОГДА
	|			Saby_Состояние.Объект.КраткийСоставДокумента
	|		ИНАЧЕ 
	|			Saby_Состояние.Объект
	|	КОНЕЦ КАК Сотрудник
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрСведений.Saby_Состояние КАК Saby_Состояние
// BSLLS:FieldsFromJoinsWithoutIsNull-off
// Проверка на ЕСТь NULL в наличии, сонар отрабатывает не корректно
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
// BSLLS:FieldsFromJoinsWithoutIsNull-on
	|		ПО (Saby_Состояние.Объект = НаличиеФайлов.ОбъектСФайлами)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ссылка КАК Ссылка,
	|	ВТ.Сервис КАК Сервис,
	|	ВТ.Аккаунт КАК Аккаунт,
	|	ВТ.АктивныйЭтап КАК АктивныйЭтап,
	|	ВТ.Состояние КАК Состояние,
	|	ВТ.UID КАК UID,
	|	ВТ.SbisId КАК SbisId,
	|	ВТ.ЕстьФайлы КАК ЕстьФайлы,
	|	ВТ.Организация КАК Организация,
	|	ВТ.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(КадроваяИсторияСотрудниковСрезПоследних.Подразделение, ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)) КАК Подразделение,
	|	ЕСТЬNULL(КадроваяИсторияСотрудниковСрезПоследних.Должность, ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)) КАК Должность,
	|	ЕСТЬNULL(СвойстваКЭДО.ИндексКартинки, 0) КАК ПризнакКЭДО
	|ИЗ
	// BSLLS:JoinWithVirtualTable-off
	// Мы не теряем в производительности, незачем усложнять запрос
	// BSLLS:VirtualTableCallWithoutParameters-off
	// Сонар не видит парамтры витруальной табицы
	|	ВТ КАК ВТ
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&НаДату, ) КАК КадроваяИсторияСотрудниковСрезПоследних
	|	ПО (ВТ.Организация = КадроваяИсторияСотрудниковСрезПоследних.ГоловнаяОрганизация
	|			И ВТ.Сотрудник = КадроваяИсторияСотрудниковСрезПоследних.Сотрудник
	|			И ВТ.Сотрудник.ФизическоеЛицо = КадроваяИсторияСотрудниковСрезПоследних.ФизическоеЛицо)
	|	ЛЕВОЕ СОЕДИНЕНИЕ СвойстваКЭДО КАК СвойстваКЭДО
	|	ПО (ВТ.Сотрудник = СвойстваКЭДО.Сотрудник)
	|		";
	// BSLLS:VirtualTableCallWithoutParameters-on	
	// BSLLS:JoinWithVirtualTable-on
	
	// Данная магия программного добавления нужна, для того, что бы не захватывать все дополнительные 
	// справочники используемые в запросе
	Список.ТекстЗапроса	 = НовыйЗапрос;
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаДату", ТекущаяДатаСеанса(), Истина);
КонецПроцедуры
