
&НаСервере
Функция ЧастьЗапросаПоОбъекту(ТипИсточника, СтрокаЗаголовок, СтрокаРазделитель, ПоместитьВ)
	
	ОбъектМетаданных	= Метаданные.НайтиПоТипу(ТипИсточника);
	ЭтоДокумент		= Метаданные.Документы.Содержит(ОбъектМетаданных);
	ЭтоСправочник	= Метаданные.Справочники.Содержит(ОбъектМетаданных);
	
	// Определение типа объекта
	Если ЭтоДокумент Тогда
		ПриведениеКТипу = "Документ." + ОбъектМетаданных.Имя;
	КонецЕсли;
	Если ЭтоСправочник Тогда
		ПриведениеКТипу = "Справочник." + ОбъектМетаданных.Имя;
	КонецЕсли;
	
	// Определение данных полей
	ИмяПоляОрганизация = "NULL";
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", ОбъектМетаданных) Тогда 
		ИмяПоляОрганизация = "СостояниеО.Объект.Организация";
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ГоловнаяОрганизация", ОбъектМетаданных) Тогда 
		ИмяПоляОрганизация = "СостояниеО.Объект.ГоловнаяОрганизация";
	КонецЕсли;

	ИмяПоляСотрудник = "NULL";
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Сотрудник", ОбъектМетаданных) Тогда 
		ИмяПоляСотрудник = "СостояниеО.Объект.Сотрудник";
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("КраткийСоставДокумента", ОбъектМетаданных) Тогда 
		ИмяПоляСотрудник = "ВЫРАЗИТЬ (СостояниеО.Объект.КраткийСоставДокумента КАК СТРОКА(255))";
	КонецЕсли;
	
	ИмяПоляСтыковка = "СостояниеО.Объект";
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Сотрудник", ОбъектМетаданных) Тогда 
		ИмяПоляСотрудник = "СостояниеО.Объект.Сотрудник";
	КонецЕсли;
	
	СтрокаРезультат = "
	|	ВЫРАЗИТЬ(СостояниеО.Объект КАК " + ПриведениеКТипу + ") КАК Ссылка,
	|	СостояниеО.Сервис КАК Сервис,
	|	СостояниеО.Аккаунт КАК Аккаунт,
	|	СостояниеО.АктивныйЭтап КАК АктивныйЭтап,
	|	СостояниеО.Состояние КАК Состояние,
	|	СостояниеО.UID КАК UID,
	|	СостояниеО.SbisId КАК SbisId,";
	Если ЭтоДокумент Тогда
		СтрокаРезультат = СтрокаРезультат + "
		|	" + ИмяПоляОрганизация + " КАК Организация,
		|	" + ИмяПоляСотрудник + " КАК Сотрудник,
		|	" + ИмяПоляСтыковка + " КАК СотрудникСтыковка
		|";
	КонецЕсли;
	Если ЭтоСправочник Тогда
		СтрокаРезультат = СтрокаРезультат + "
		|	" + ИмяПоляОрганизация + " КАК Организация,
		|	СостояниеО.Объект КАК Сотрудник,
		|	" + ИмяПоляСтыковка + " КАК СотрудникСтыковка
		|";
	КонецЕсли;
	
	СтрокаРезультат = СтрокаРезультат + ПоместитьВ + "
	|ИЗ
	|	РегистрСведений." + ИмяРегистраСостояние() + " КАК СостояниеО
	|ГДЕ 
	|	НЕ ВЫРАЗИТЬ(СостояниеО.Объект КАК " + ПриведениеКТипу + ") ЕСТЬ NULL
	|";
	
	Возврат СтрокаРезультат;
КонецФункции

&НаСервере
Процедура УстановитьТекстЗапросаСписка()
// BSLLS:UsingFindElementByString-off
// Поиск по коду сделать не реально, у разных клиентов разный код
	ДополнительноеСвойствоКЭДО = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("КЭДО");
// BSLLS:UsingFindElementByString-on	
	СтрокиЗапроса = Новый Массив;
	ЧастьЗапроса =	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(ДС.Объект КАК Справочник.Сотрудники) КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА ДС.Значение = ИСТИНА
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИндексКартинки,
	|	ВЫРАЗИТЬ(ДС.Значение КАК БУЛЕВО) КАК КЭДО
	|ПОМЕСТИТЬ СвойстваКЭДО
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДС
	|ГДЕ
	|	ДС.Свойство = &ДополнительноеСвойствоКЭДО
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	СтрокиЗапроса.Добавить(ЧастьЗапроса);
	
	СтрокаРазделитель = "
		|ОБЪЕДИНИТЬ ВСЕ
		|";
	СтрокаЗаголовок = "ВЫБРАТЬ РАЗРЕШЕННЫЕ";
	ПоместитьВ = "ПОМЕСТИТЬ ВТОбъекты";
	
	МассивДоступныхТипов = Метаданные.РегистрыСведений[ИмяРегистраСостояние()].Измерения.Объект.Тип.Типы();
	СЧтЭлементов = 0;
	Для Каждого ТипИсточника Из МассивДоступныхТипов Цикл
		СЧтЭлементов = 	СЧтЭлементов + 1;

		ЧастьЗапроса = ЧастьЗапросаПоОбъекту(ТипИсточника, СтрокаЗаголовок, СтрокаРазделитель, ПоместитьВ);
		Если СЧтЭлементов = МассивДоступныхТипов.Количество() Тогда
			СтрокаРазделитель = "";
		КонецЕсли;
		СтрокиЗапроса.Добавить( СтрокаЗаголовок );
		СтрокиЗапроса.Добавить( ЧастьЗапроса );
		СтрокиЗапроса.Добавить( СтрокаРазделитель );

		СтрокаЗаголовок = "
			|ВЫБРАТЬ";
		ПоместитьВ = "";
	КонецЦикла;
	
// BSLLS:QueryParseError-off
// Запрос разбит на части по типу захваченных метаданных и сделать его не динамически формируемым нереально
	ЧастьЗапроса = "
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	СотрудникСтыковка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТОбъекты.Ссылка КАК Ссылка,
	|	ВТОбъекты.Сервис КАК Сервис,
	|	ВТОбъекты.Аккаунт КАК Аккаунт,
	|	ВТОбъекты.АктивныйЭтап КАК АктивныйЭтап,
	|	ВТОбъекты.Состояние КАК Состояние,
	|	ВТОбъекты.Состояние.ИндексКартинки КАК ИндексКартинки,
	|	ВТОбъекты.UID КАК UID,
	|	ВТОбъекты.SbisId КАК SbisId,
	|	ВТОбъекты.Организация КАК Организация,
	|	ВТОбъекты.Сотрудник КАК Сотрудник,
	|	ВТОбъекты.СотрудникСтыковка КАК СотрудникСтыковка,
	|	ВЫБОР
	|		КОГДА НаличиеФайлов.ЕстьФайлы ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА НаличиеФайлов.ЕстьФайлы
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЕстьФайлы
	|ПОМЕСТИТЬ ВТОбъектыФ
	|
	|ИЗ
	|	ВТОбъекты КАК ВТОбъекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
	|		ПО (ВТОбъекты.Ссылка = НаличиеФайлов.ОбъектСФайлами)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РАЗЛИЧНЫЕ ВТ.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТСотрудникИ
	|ИЗ
	|	ВТОбъектыФ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОбъектыФ.Ссылка КАК Ссылка,
	|	ВТОбъектыФ.Сервис КАК Сервис,
	|	ВТОбъектыФ.Аккаунт КАК Аккаунт,
	|	ВТОбъектыФ.АктивныйЭтап КАК АктивныйЭтап,
	|	ВТОбъектыФ.Состояние КАК Состояние,
	|	ВТОбъектыФ.UID КАК UID,
	|	ВТОбъектыФ.SbisId КАК SbisId,
	|	ВТОбъектыФ.Организация КАК Организация,
	|	ВТОбъектыФ.Сотрудник КАК Сотрудник,
	|	ВТОбъектыФ.ЕстьФайлы КАК ЕстьФайлы,";
#Область include_kedo_base_Form_ДокументыКЭДО_ДанныеЗапросаРазницаВПолях
#КонецОбласти
	ЧастьЗапроса = ЧастьЗапроса + "
	|	ЕСТЬNULL(КадроваяИстория.Должность, ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)) КАК Должность,
	|	ЕСТЬNULL(СвойстваКЭДО.ИндексКартинки, 0) КАК ПризнакКЭДО
	|ИЗ
	|";
// BSLLS:QueryParseError-on	
	СтрокиЗапроса.Добавить( ЧастьЗапроса );
	
#Область include_kedo_base_Form_ДокументыКЭДО_СтыковкаДанныхЗапроса
#КонецОбласти
// BSLLS:DuplicatedInsertionIntoCollection-off
// Корректное добавлени епеременной СОНАР ВРЁТ
	СтрокиЗапроса.Добавить( ЧастьЗапроса );
// BSLLS:DuplicatedInsertionIntoCollection-on
	
	Список.ТекстЗапроса	 = СтрСоединить(СтрокиЗапроса);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, 
		"ДополнительноеСвойствоКЭДО",
		ДополнительноеСвойствоКЭДО,
		Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаДату", ТекущаяДатаСеанса(), Истина);
КонецПроцедуры
