
// BSLLS:UnusedLocalVariable-off Переменные формы
&НаКлиенте
Перем ТранспортИнтеграции, BlocklyExecutor;
// BSLLS:UnusedLocalVariable-on

#Область include_kedo_base_ЭДО_Form_ПодборПерсонала_УстановитьЛокализацию
#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ТипПоиска = "Отсутствует";
	ДобавитьИнформациюОВерсии(Элементы.ВерсияПродукта);
	ЭтаФорма.ЭтоВнешняяОбработка = ЭтоВнешняяОбработка();
	УстановитьЛокализацию();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	context_params = ПроверитьНаличиеПараметровПодключенияНаСервере(); 
	Если context_params = Неопределено Тогда 
		ПоказатьОповещениеПользователя("Ошибка", ,
			"Необходима авторизация", ,
			СтатусОповещенияПользователя.Информация,
			Новый УникальныйИдентификатор);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
	BlocklyExecutor = ПолучитьФормуBlockly();

	СтатусВерсии = ПолучитьИнформациюОВерсииПоУмолчанию();
	СтатусВерсии = ПолучитьСтатусВерсииНаФорме(Ложь);
	ОбновитьИнформациюОВерсии(СтатусВерсии);

	ОбновитьСписок();	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "SabySignOut" Тогда
		Закрыть();
	ИначеЕсли ИмяСобытия = "Saby_ЗавершениеДлительнойОперации" Или ИмяСобытия = "Saby_ЗавершениеВыполнитьДействие" Тогда
		ОбновитьСписок();
	Иначе
		Возврат;
	КонецЕсли;
	
	// TODO Переписать на обновление только выделенных строк.
КонецПроцедуры

#Область include_core_base_locale_ЛокализацияНазваниеПродукта
#КонецОбласти

#Область ФильтрыСпискаЗадач

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	ОбновитьСписок();
КонецПроцедуры

&НаКлиенте
Процедура ПоискОчистка(Элемент, СтандартнаяОбработка)	
	ЭтаФорма.СтрокаПоиска = "";
	ОбновитьСписок();	
КонецПроцедуры

&НаКлиенте
Процедура СообщениеПользователю(ТекстСообщения) Экспорт 

	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.Текст = ТекстСообщения;
	СообщениеПользователю.Сообщить();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)	
	ЭтаФорма.СтрокаПоиска = Текст;
	ОбновитьСписок();	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьСписок(Команда)
	ОбновитьСписок();
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеСпискаЗадач

&НаКлиенте
Процедура _ПослеАутентификации(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Если ЭтаФорма.Открыта() Тогда
			Закрыть();
		КонецЕсли;
		Возврат;
	КонецЕсли;		
	ОбновитьСписок();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(ОчиститьСписок = Истина)
	
	ИндексСтраницыНачала = 0;
	Если ОчиститьСписок Тогда 
		СписокКандидатов.Очистить();
	Иначе
		ИндексСтраницыНачала = ТекущаяСтраница;
	КонецЕсли;
	
	Попытка
		context_params = ПроверитьНаличиеПараметровПодключенияНаСервере(); 
		
		ЕстьЕще 		= Ложь;
		ЭлементовНаСтраницу = 30;
		Для ИндексСтраницы = ИндексСтраницыНачала По ТекущаяСтраница Цикл
			СтруктураТипПоиска =  Неопределено;
			Если ТипПоиска <> "Отсутствует" Тогда
				СтруктураТипПоиска =  Новый Структура("Param, Value", СтруктураТипПоиска, СтрокаПоиска);
			КонецЕсли;
			СтруктураФильтр = Неопределено;
			СтруктураНавигации = Новый Структура("Page, Limit", ИндексСтраницы, ЭлементовНаСтраницу);
			ДополнительныеПоля = Новый Массив();
			ДополнительныеПоля.Добавить("SabyLink");

			Ответ = ТранспортИнтеграции.local_helper_candidate_list(
				context_params,
				СтруктураТипПоиска,
				ДополнительныеПоля,
				СтруктураФильтр,
				СтруктураНавигации);	
			ДополнитьСписокКандидатовДанными(get_prop(Ответ, "Data", Новый Массив) );
			Навигация = get_prop(Ответ, "NavResult");
			
			ЕстьЕще 		= get_prop(Навигация, "more");
		КонецЦикла;
		
		Если ЕстьЕще Тогда 
			СтрокаСпискаЗадач 			= СписокКандидатов.Добавить();
			СтрокаСпискаЗадач.Отчество = "Загрузить ещё";
		КонецЕсли;		
	Исключение
		ИнфоОбОшибке = ИнформацияОбОшибке();
		СтруктураОшибки = ExtExceptionAnalyse(ИнфоОбОшибке);
		Если СтруктураОшибки.type = "Unauthorized" Тогда
			ВходящиеПараметры	= Новый Структура("Метод", "ОбновитьСтраницу");
			ПроверкаВведенныхДанныхАутентификации = Новый ОписаниеОповещения("_ПослеАутентификации", ЭтаФорма, ВходящиеПараметры);
			ОткрытьФорму("Обработка." + ПрефиксПродукта() + "SABY.Форма.Вход"
				, , , , , , ПроверкаВведенныхДанныхАутентификации);
		Иначе
			ОписаниеОшибки = СтруктураОшибки.detail;
			ПоказатьОповещениеПользователя(
				"Ошибка",,ОписаниеОшибки,
				БиблиотекаКартинок["Ошибка32"],
				СтатусОповещенияПользователя.Важное, Новый УникальныйИдентификатор);
		КонецЕсли;
		Возврат;
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуИдентификаторовДокументовСбис(СписокДокументовСбис)
	tUID = Новый ТаблицаЗначений;
	tUID.Колонки.Добавить("UID", Новый ОписаниеТипов("Строка") );
	Для Каждого ДокументСбис Из СписокДокументовСбис Цикл
		НовСтрока = tUID.Добавить();
		UID = get_prop(ДокументСбис,"Key");    //TODO удаить ИдИС когда UID до онлайна доедет
		НовСтрока.UID = Формат(UID, "ЧГ=0");
	КонецЦикла;
	Возврат tUID; 
КонецФункции

// Дополняет список персонала
//
// Параметры:
//  СписокДокументовСбис - Массив - список документов.
//
&НаСервере
// BSLLS:TransferringParametersBetweenClientAndServer-off
&НаСервере
Процедура ДополнитьСписокКандидатовДанными(СписокДокументовСбис)
	ТаблицаИдентификаторов = ПолучитьТаблицуИдентификаторовДокументовСбис(СписокДокументовСбис);
	МодульОбъекта = МодульОбъекта();
	ТаблицаСсылок = МодульОбъекта.СтатусыДокументовПолучитьСостоянияОбъектов(ТаблицаИдентификаторов);
	
	Для Сч = 0 По СписокДокументовСбис.Количество() - 1 Цикл 
		ДанныеКандидата = СписокДокументовСбис[Сч];
		СтрокаСпискаЗадач = СписокКандидатов.Добавить(); 
		ЗаполнитьСтрокуКандидатаСбис(СтрокаСпискаЗадач, ДанныеКандидата);
		ЗаполнитьСтрокуКандидатаИзСтатуса1С(СтрокаСпискаЗадач, ТаблицаСсылок);
	КонецЦикла;
КонецПроцедуры
// BSLLS:TransferringParametersBetweenClientAndServer-on

&НаСервере
Процедура ЗаполнитьСтрокуКандидатаИзСтатуса1С(СтрокаЗадачи, Статусы1С)
	ОтборСтрок = Новый Структура("UID", СтрокаЗадачи.Идентификатор);
	СтрокиДокументов = Статусы1С.НайтиСтроки(ОтборСтрок);
	Для Каждого Статус1С Из СтрокиДокументов Цикл
		СтрокаЗадачи.Объект1С = Статус1С["LINK"];
		// Для корректного вывода удаляем обработанную строку
		Статусы1С.Удалить(Статус1С);
		Прервать;
	КонецЦикла;
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСтрокуКандидатаСбис(СтрокаЗадачи, КандидатСбис)
	СтрокаЗадачи.Фамилия		= get_prop(КандидатСбис, "Surname");
	СтрокаЗадачи.Имя			= get_prop(КандидатСбис, "Name");
	СтрокаЗадачи.Отчество		= get_prop(КандидатСбис, "Patronymic");
	СтрокаЗадачи.ДеньРождения	= get_prop(КандидатСбис, "Birthdate");
	СтрокаЗадачи.Телефон		= get_prop(get_prop(КандидатСбис, "Contacts"), "MobilePhone", "");
	СтрокаЗадачи.Пол			= get_prop(КандидатСбис, "Gender");
	СтрокаЗадачи.Идентификатор	= get_prop(КандидатСбис, "Key");
	СтрокаЗадачи.СсылкаСБИС		= get_prop(КандидатСбис, "SabyLink");
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СписокОбработкаВыбораСтроки();
КонецПроцедуры

&НаКлиенте
Процедура СписокКомандаОткрыть(Команда)
	ТекущиеДанные = Элементы.СписокКандидатов.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Документ1С) Тогда 
		ПоказатьЗначение(, ТекущиеДанные.Документ1С);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаВыбораСтроки()
	
	ТекущиеДанные = Элементы.СписокКандидатов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Отчество = "Загрузить ещё" Тогда
		ТекущаяСтраница = ТекущаяСтраница + 1;
		СписокКандидатов.Удалить(ТекущиеДанные);
		ОбновитьСписок(Ложь);
		Возврат;
	КонецЕсли;
	
	ТекущийЭлементСпискаЗадач = Элементы.СписокЗадач.ТекущийЭлемент;
	Если ТекущийЭлементСпискаЗадач.Имя = "СписокКандидатовОбъект1С" и Не ТекущиеДанные.Объект1С = Неопределено Тогда
		ПоказатьЗначение(, ТекущиеДанные.Объект1С);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьМассивОбрабатываемыхКандидатов()  
	ВыгружаемыеДокументы = Новый Массив();
	Для Каждого ВыгружаемыйДокумент Из Элементы.СписокКандидатов.ВыделенныеСтроки Цикл
		СтрокаСпискаКандидатов = СписокКандидатов.НайтиПоИдентификатору(ВыгружаемыйДокумент);
		Если СтрокаСпискаКандидатов.Отчество = "Загрузить ещё" Тогда
			Продолжить;
		КонецЕсли;
		ИмяСБИС = СтрокаСпискаКандидатов.ИмяСБИС;
		ИдентификаторДокумента = СтрокаСпискаКандидатов.Идентификатор;
		ПримечаниеСБИС = "";
		ИмяИзСБИСвАПИ3(ИмяСБИС, ПримечаниеСБИС, ИдентификаторДокумента);
		
		API3_ref = Новый Структура; 
		API3_ref.Вставить("SbisId",		СтрокаСпискаКандидатов.Идентификатор);
		API3_ref.Вставить("SbisType",	"Кандидат");
		API3_ref.Вставить("Type",		"Кандидат");
		API3_ref.Вставить("Title",		СтрокаСпискаКандидатов.Фамилия + " " + СтрокаСпискаКандидатов.Имя + " " +СтрокаСпискаКандидатов.Отчество);
		ВыгружаемыеДокументы.Добавить(API3_ref);
	КонецЦикла;
	Возврат ВыгружаемыеДокументы; 	
КонецФункции

#Область include_core_base_Helpers_ИмяИзСБИСвАПИ3
#КонецОбласти

&НаКлиенте
Процедура ВыгрузитьВ1С(Команда)
	context_params	= ПроверитьНаличиеПараметровПодключенияНаСервере();
	ВыгружаемыеДокументы = СформироватьМассивОбрабатываемыхКандидатов();
	
	Контекст = Новый Структура;
	Контекст.Вставить("algorithm", "Документы_update");
	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("list_doc_ref", ВыгружаемыеДокументы);
	Контекст.Вставить("ПараметрыВызова", ПараметрыВызова);
	Контекст.Вставить("context_params", context_params);
	Контекст.Вставить("НазваниеОперации", "Загрузка в 1С");
	BlocklyExecutor.ЗапуститьINI(Контекст);
КонецПроцедуры

&НаКлиенте
Функция ТекущийОбъектИС() 
	ТД = Элементы.СписокКандидатов.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат ТД.Объект1С;
КонецФункции

&НаСервере
Функция СтруктураВыгрузкиДокумента(Знач Документ1С)
	Возврат Новый Структура("Ссылка,UID,ТипМетаданных,ТипОбъекта,ИмяИни", 
							Документ1С.Ссылка,
							Неопределено,
							Документ1С.Ссылка.Метаданные().Имя,
							Неопределено,
							Неопределено); 	
КонецФункции	

&НаКлиенте
Процедура ОбновитьВСБИС(Команда)
	Документ1С = ТекущийОбъектИС();
	Если Не ЗначениеЗаполнено(Документ1С) Тогда 
		ПоказатьОповещениеПользователя(
			"Ошибка",,
			"Невозможно обновить документ SABY, так как он не был выгружен в 1С",
			БиблиотекаКартинок["Ошибка32"]);
		Возврат; 
	КонецЕсли;
	
	ДокументПереотправить = Новый Массив();
	ДокументПереотправить.Добавить(СтруктураВыгрузкиДокумента(Документ1С));
	ПараметрыВФорму = Новый Структура("Источник", ДокументПереотправить);
	ОткрытьФормуОбработки("ЗагрузкаДокументов", ПараметрыВФорму, ЭтаФорма, Новый УникальныйИдентификатор());
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВСБИС(Команда)
	ТД = Элементы.СписокКандидатов.ТекущиеДанные;
	Если ТД <> Неопределено И ЗначениеЗаполнено(ТД.СсылкаСБИС) Тогда
		ЗадачаСсылка = ПолучитьПрямуюССылку(ТД.СсылкаСБИС);
		#Если ТолстыйКлиентОбычноеПриложение Тогда
		// BSLLS:UsingSynchronousCalls-off
		ЗапуститьПриложение(ЗадачаСсылка);
		// BSLLS:UsingSynchronousCalls-on
		#Иначе	
		ПерейтиПоНавигационнойСсылке(ЗадачаСсылка);	
		#КонецЕсли
	КонецЕсли;	
КонецПроцедуры

#Область include_core_base_Helpers_ПолучитьПрямуюСсылку
#КонецОбласти

#КонецОбласти

#Область include_core_base_ВстраиваниеВФормы_ОберткаСерверныхКоманд
#КонецОбласти

#Область include_core_base_Helpers_FormGetters
#КонецОбласти

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры
#КонецОбласти

#Область include_core_base_ExtException
#КонецОбласти

#Область include_base_НазваниеПродукта
#КонецОбласти

#Область include_core_base_ПроверкаВерсии_ПолучитьИмяФайлаИНомерТекущейВерсии
#КонецОбласти

#Область include_core_base_ПроверкаВерсии_НаФорме
#КонецОбласти

#Область include_core_base_ОсобенностиПлатформы_МодульФормы
#КонецОбласти

#Область include_core_base_Helpers_Картинки
#КонецОбласти

#Область includr_core_base_Helpers_ПрефиксПродукта
#КонецОбласти

#Область include_core_base_ДлительныеОперации_ПодготовкаФормыОсобенностиПродукта
#КонецОбласти
