
&НаСервере
&ИзменениеИКонтроль("УточнитьТекстЗапросаПоДопРеквизитам")
Функция Saby_УточнитьТекстЗапросаПоДопРеквизитам(ТекстЗапроса)

	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	ПакетЗапросов    = СхемаЗапроса.ПакетЗапросов;
	Колонки          = ПакетЗапросов[0].Колонки;
	Оператор         = ПакетЗапросов[0].Операторы[0];
	#Удаление
	ИсточникЗапроса  = Оператор.Источники[0];
	#КонецУдаления
	#Вставка
	ИсточникЗапроса  = Оператор.Источники[Оператор.Источники.Количество()-1];
	#КонецВставки	
	ИмяТаблицы       = ИсточникЗапроса.Источник.ИмяТаблицы;
	Псевдоним        = ИсточникЗапроса.Источник.Псевдоним;
	Попытка
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИмяТаблицы);
		ДополнительныеРеквизиты = МенеджерОбъекта.ПолучитьДополнительныеРеквизитыДляРеестра();
	Исключение
		ДополнительныеРеквизиты = Новый Структура;
	КонецПопытки;

	// Учтем особенности журналов документов.
	Если СтрНайти(ИмяТаблицы, "ЖурналДокументов.") > 0 Тогда
		КолонкаСсылка1 = Колонки.Найти("Ссылка1");
		Если КолонкаСсылка1 <> Неопределено Тогда
			Колонки.Удалить(Колонки.Индекс(КолонкаСсылка1));
		КонецЕсли;

		ПолеВалюта = "ВалютаДокумента";
		КолонкаВалюта = Колонки.Найти("Валюта");
		Если КолонкаВалюта <> Неопределено И КолонкаВалюта.Псевдоним = "Валюта" Тогда
			ПолеВалюта = "Валюта";
			КолонкаВалюта.Псевдоним = "ВалютаДокумента";
		КонецЕсли;

		КолонкаВалютаДокумента = Колонки.Найти("ВалютаДокумента");
		Если Не ДополнительныеРеквизиты.Свойство("ВалютаДокумента") И КолонкаВалютаДокумента <> Неопределено Тогда
			ИсточникДанных = Псевдоним + "." + ПолеВалюта;
			ТекстЗапросаВалютаДокумента =
			"ВЫБОР КОГДА "
			+ ИсточникДанных + " ЕСТЬ NULL ИЛИ "
			+ ИсточникДанных + "=ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) ТОГДА &ВалютаРеглУчета ИНАЧЕ "
			+ ИсточникДанных
			+ " КОНЕЦ";
			СхемаВалютаДокумента = Новый ВыражениеСхемыЗапроса(ТекстЗапросаВалютаДокумента);
			Индекс = Оператор.ВыбираемыеПоля.Индекс(КолонкаВалютаДокумента.Поля[0]);
			Оператор.ВыбираемыеПоля.Установить(Индекс, СхемаВалютаДокумента);
			КолонкаВалютаДокумента.Псевдоним = "ВалютаДокумента"; // Иногда псевдоним сбрасывается.
		КонецЕсли;

		КолонкаСуммаДокумента = Колонки.Найти("СуммаДокумента");
		Если НЕ ДополнительныеРеквизиты.Свойство("СуммаДокумента") И КолонкаСуммаДокумента <> Неопределено Тогда
			ТекстЗапросаСуммаДокумента = "ЕСТЬNULL(" + Псевдоним + ".СуммаДокумента, 0)";
			СхемаСуммаДокумента = Новый ВыражениеСхемыЗапроса(ТекстЗапросаСуммаДокумента);
			Индекс = Оператор.ВыбираемыеПоля.Индекс(КолонкаСуммаДокумента.Поля[0]);
			Оператор.ВыбираемыеПоля.Установить(Индекс, СхемаСуммаДокумента);
			КолонкаСуммаДокумента.Псевдоним = "СуммаДокумента"; // Иногда псевдоним сбрасывается.
		КонецЕсли;
	КонецЕсли;

	ДобавленИсточникДанныеПервичныхДокументов = Ложь;
	Для Каждого КлючИЗначение Из ДополнительныеРеквизиты Цикл
		КолонкаДопРеквизита = Колонки.Найти(КлючИЗначение.Ключ);
		Если СтрНайти(КлючИЗначение.Значение, "Таб.") > 0 Тогда
			ТекстЗапросаДопРеквизита = СтрЗаменить(КлючИЗначение.Значение, "Таб.", Псевдоним + ".");
		Иначе
			ТекстЗапросаДопРеквизита = Псевдоним + "." + КлючИЗначение.Значение;
		КонецЕсли;

		Если КолонкаДопРеквизита = Неопределено Тогда
			// В некоторых журналах нет граф с реквизитами входящих документов.
			// Получим эти реквизиты из регистра ДанныеПервичныхДокументов.
			Если КлючИЗначение.Ключ = "ДатаВходящегоДокумента" ИЛИ КлючИЗначение.Ключ = "НомерВходящегоДокумента" Тогда
				Если НЕ ДобавленИсточникДанныеПервичныхДокументов Тогда
					ДанныеПервичныхДокументов = Оператор.Источники.Добавить("РегистрСведений.ДанныеПервичныхДокументов");
					ДанныеПервичныхДокументов.Соединения.Очистить();
					ИсточникЗапроса.Соединения.Добавить(ДанныеПервичныхДокументов,
					Псевдоним + ".Организация = ДанныеПервичныхДокументов.Организация И "
					+ Псевдоним + ".Ссылка = ДанныеПервичныхДокументов.Документ");
					ДобавленИсточникДанныеПервичныхДокументов = Истина;
				КонецЕсли;

				Если КлючИЗначение.Ключ = "ДатаВходящегоДокумента" Тогда
					ТекстЗапросаРеквизитыВходящегоДокумента = "ЕСТЬNULL(ДанныеПервичныхДокументов.Дата, """")";
				Иначе
					ТекстЗапросаРеквизитыВходящегоДокумента = "ЕСТЬNULL(ДанныеПервичныхДокументов.Номер, """")";
				КонецЕсли;

				КолонкаРеквизитыВходящегоДокумента = Колонки.Найти(КлючИЗначение.Ключ);
				Если КолонкаРеквизитыВходящегоДокумента = Неопределено Тогда
					Оператор.ВыбираемыеПоля.Добавить(ТекстЗапросаРеквизитыВходящегоДокумента);
					Колонки[Колонки.Количество() - 1].Псевдоним = КлючИЗначение.Ключ;
				Иначе
					СхемаРеквизитыВходящегоДокумента = Новый ВыражениеСхемыЗапроса(ТекстЗапросаРеквизитыВходящегоДокумента);
					Индекс = Оператор.ВыбираемыеПоля.Индекс(КолонкаРеквизитыВходящегоДокумента.Поля[0]);
					Оператор.ВыбираемыеПоля.Установить(Индекс, СхемаРеквизитыВходящегоДокумента);
				КонецЕсли;
			ИначеЕсли КлючИЗначение.Ключ = "ЕстьТовары" ИЛИ КлючИЗначение.Ключ = "ЕстьОборудование"
				ИЛИ КлючИЗначение.Ключ = "ЕстьУслуги" ИЛИ КлючИЗначение.Ключ = "ЕстьАгентскиеУслуги" Тогда
				СоставныеЧастиВыражения = СтрРазделить(ТекстЗапросаДопРеквизита, ".");
				ИсточникПервичныеДокументы = "Документ."+ СтрЗаменить(СоставныеЧастиВыражения[0], "Документ", "") + "." + СоставныеЧастиВыражения[1];
				ПервичныеДокументы = Оператор.Источники.Добавить(ИсточникПервичныеДокументы, СоставныеЧастиВыражения[0] + СоставныеЧастиВыражения[1]);
				ПервичныеДокументы.Соединения.Очистить();
				ИсточникЗапроса.Соединения.Добавить(ПервичныеДокументы,
				Псевдоним + ".Ссылка = " + ПервичныеДокументы.Источник.Псевдоним + ".Ссылка
				|И (" + ПервичныеДокументы.Источник.Псевдоним + ".НомерСтроки = 1)");
				ПолеЗапроса = "ВЫБОР КОГДА " + ПервичныеДокументы.Источник.Псевдоним +"."
				+ СоставныеЧастиВыражения[2] + " ЕСТЬ NULL ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ";
				Оператор.ВыбираемыеПоля.Добавить(ПолеЗапроса);
				Колонки[Колонки.Количество() - 1].Псевдоним = КлючИЗначение.Ключ;
				ЕстьОтборПоПервичнымДокументам = Истина;
			Иначе
				Оператор.ВыбираемыеПоля.Добавить(ТекстЗапросаДопРеквизита);
				Колонки[Колонки.Количество() - 1].Псевдоним = КлючИЗначение.Ключ;
			КонецЕсли;
		Иначе
			СхемаДопРеквизита = Новый ВыражениеСхемыЗапроса(ТекстЗапросаДопРеквизита);
			Индекс = Оператор.ВыбираемыеПоля.Индекс(КолонкаДопРеквизита.Поля[0]);
			Оператор.ВыбираемыеПоля.Установить(Индекс, СхемаДопРеквизита);
		КонецЕсли;
	КонецЦикла;

	ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();

	// СхемаЗапроса не работает с расширением языка запросов в {},
	// поэтому остальные изменения производятся прямой заменой текста запроса.

	// Учтем особенности журналов документов, где изменено поле Ссылка.
	// Т.к. платформа в этом случае автоматически добавляет поле Ссылка1.
	ПсевдонимСсылка1 = Псевдоним + ".Ссылка.* КАК Ссылка1";
	Если СтрНайти(ТекстЗапроса, ПсевдонимСсылка1) > 0 Тогда
		Если СтрНайти(ТекстЗапроса, ПсевдонимСсылка1 + ",") > 0 Тогда
			ПсевдонимСсылка1 = ПсевдонимСсылка1 + ",";
		КонецЕсли;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ПсевдонимСсылка1, "");
	КонецЕсли;

	// Обход особенности работы СхемыЗапроса.
	// В запросах динамического списка могут встречаться сложные "технические" условия, описанные в расширении языка запросов.
	// Если какое-то условие нужно только для функционирования дин.списка
	// и не должно попадать в пользовательский отбор, то у него не задают псевдоним.
	// Но после использования СхемыЗапроса у этих условий псевдоним добавляется автоматически (вида: "ПолеN").
	// Если использовать полученный текст запроса в СКД, такие условия начинают попадать в поля отбора отчета,
	// чего не происходит, если псеводним отсутствует.
	// Удалим их.
	Для сч = 0 По 9 Цикл
		ПсеводнимТехУсловияОтбора = ") КАК Поле" + (10 - сч);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ПсеводнимТехУсловияОтбора, ")");
	КонецЦикла;

	Возврат ТекстЗапроса;

КонецФункции
