
#Область include_core_base_locale_ЛокализацияНазваниеПродукта
#КонецОбласти

&Вместо("ВидыКоманд")
Функция Saby_ВидыКоманд()
	
	Результат = ПродолжитьВызов();
	Если Saby_Core.ТекущемуПользователюМожноРаботатьСоСБИС() ИЛИ
		Saby_Core.ВключеноИспользованиеПодсистемыКЕДО() Тогда
		// СБИС
		Вид				= Результат.Добавить();
		Вид.Заголовок	= ЛокализацияНазваниеПродукта();
		Вид.Имя			= "SABY_КОМАНДЫ";
		Вид.ИмяПодменю	= "Saby_СБИС";
		Вид.Порядок		= 20;
		Вид.Картинка    = Новый Картинка;
		Вид.Отображение = ОтображениеКнопки.КартинкаИТекст;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции
