#Область include_base_CommonModule_ИмяМодуляCore
#КонецОбласти

#Область include_core_base_locale_ЛокализацияНазваниеПродукта
#КонецОбласти

&Вместо("ВидыКоманд")
Функция Integration_ВидыКоманд()
	МодульCore = МодульCore();
	НазваниеПродукта = ЛокализацияНазваниеПродукта();
	Результат = ПродолжитьВызов();
	Если МодульCore.ТекущемуПользователюМожноРаботатьСРасширением() ИЛИ
		МодульCore.ВключеноИспользованиеПодсистемыКЕДО() Тогда
		Вид				= Результат.Добавить();
		Вид.Заголовок	= НазваниеПродукта;
		Вид.Имя			= НазваниеПродукта+"_КОМАНДЫ";
		Вид.ИмяПодменю	= НазваниеПродукта+"_Integration";
		Вид.Порядок		= 20;
		Вид.Картинка    = Новый Картинка;
		Вид.Отображение = ОтображениеКнопки.КартинкаИТекст;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции
