
#Область include_base_CommonModule_ИменаМодулейСервер
#КонецОбласти

&После("ПриСозданииНаСервереФормыСДинамическимСписком")
Процедура Saby_ПриСозданииНаСервереФормыСДинамическимСписком(Форма, НаименованиеРеквизитаСписок, ГруппаНастроек, ПараметрыКритерияОтбора, ГруппаПараметровКритерияОтбора, ИсключаемыеИменаОтборов, ЗаполнятьПользовательскийОтборПоОрганизации)
	МодульCore = МодульCore();
	Если
		МодульВстраиваниеВСтандартныеФормы().ЭтоФормаИсключения(Форма) 
		ИЛИ Не МодульCore.ТекущемуПользователюМожноРаботатьСРасширением() 
		ИЛИ Не МодульCore.ВключеноИспользованиеПодсистемыКЕДО()
		Тогда 
		Возврат; 
	КонецЕсли;
	//А затем наш код	
	МодульВстраиваниеВСтандартныеФормы().ДобавитьКолонкиВДинамическийСписокПриИзмененииЗапроса(Форма, НаименованиеРеквизитаСписок);
КонецПроцедуры
