#Область include_base_CommonModule_ИмяМодуляВстраиваниеВСтандартныеФормы
#КонецОбласти

&Вместо("УстановитьЗапросДинамическогоСписка")
Функция Saby_УстановитьЗапросДинамическогоСписка(Форма, ОтборыСписка, ДляВыбораСотрудников, ИмяРеквизитаСписок)
	// Вначале вызов от 1с
	Результат = ПродолжитьВызов(Форма, ОтборыСписка, ДляВыбораСотрудников, ИмяРеквизитаСписок);
	
	МодульВстраиваниеВСтандартныеФормы().ИзменитьЗапросДинамическогоСписка(Форма, ОтборыСписка, ДляВыбораСотрудников, ИмяРеквизитаСписок);
	Возврат Результат;
КонецФункции
