
#Область include_base_CommonModule_ИменаМодулейСервер
#КонецОбласти

&Вместо("УстановитьЗапросДинамическогоСписка")
Функция Интеграция_УстановитьЗапросДинамическогоСписка(Форма, ОтборыСписка, ДляВыбораСотрудников, ИмяРеквизитаСписок)
	// Вначале вызов от 1с
	Результат = ПродолжитьВызов(Форма, ОтборыСписка, ДляВыбораСотрудников, ИмяРеквизитаСписок);
	
    МодульВстраиваниеВСтандартныеФормы().УстановитьЗапросДинамическогоСписка(
		Форма,
		ОтборыСписка,
		ДляВыбораСотрудников,
		ИмяРеквизитаСписок);
	Возврат Результат;
КонецФункции
