
Процедура УстановитьЭлементОтбора(ЭлементОтбораРеквизита, ЗначениеОтбора, ИспользованиеОтбора, РеквизитВСписке)
	Если РеквизитВСписке Тогда
		ЭлементОтбораРеквизита.ВидСравнения	= ВидСравненияКомпоновкиДанных.ВСписке;
	Иначе
		ЭлементОтбораРеквизита.ВидСравнения	= ВидСравненияКомпоновкиДанных.НеВСписке;
	КонецЕсли;
	ЭлементОтбораРеквизита.ПравоеЗначение	= ЗначениеОтбора;
	ЭлементОтбораРеквизита.Использование	= ИспользованиеОтбора;	
КонецПроцедуры

Функция ПечатнаяФормаРасчетногоЛистка(Выборка, ПараметрыЗапроса, ОтчетРасчетныйЛисток)
	Попытка
		Результат = Отчеты.АнализНачисленийИУдержаний.ДанныеРасчетныхЛистков(   
			Выборка.ФизическоеЛицо,
			Выборка.ГоловнаяОрганизация,
			ПараметрыЗапроса.НачалоПериода,
			ПараметрыЗапроса.КонецПериода,
			ОтчетРасчетныйЛисток);
	Исключение
		// Начиная с Версии ЗУП 3.1.24.408			
		Результат = ЗарплатаКадрыОтчеты.ДанныеРасчетныхЛистков(
			Выборка.ФизическоеЛицо, 
			Выборка.ГоловнаяОрганизация,
			ПараметрыЗапроса.НачалоПериода,
			ПараметрыЗапроса.КонецПериода,
			ОтчетРасчетныйЛисток);
	КонецПопытки;
	Возврат Результат;
КонецФункции

Функция ПечатнаяФормаРасчетногоЛисткаСПользовательскимиПараметрами(Выборка, ПараметрыЗапроса, ОтчетРасчетныйЛисток,
	СтруктураПользНастр, ДопПараметры)
	ОтчетОбъектРЛ = СтруктураПользНастр.ОтчетОбъектРЛ;
	СхемаКомпоновкиДанных = СтруктураПользНастр.СхемаКомпоновкиДанных; 
	КомпоновщикНастроекКомпоновкиДанных = СтруктураПользНастр.КомпоновщикНастроекКомпоновкиДанных;
	
	ЭлементОтбораФЛ = ОтчетОбъектРЛ.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
		ПараметрыЗапроса.ИдентификаторФизическоеЛицо);
	ЭлементОтбораФЛ.ПравоеЗначение	= Выборка.ФизическоеЛицо;
	ЭлементОтбораФЛ.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораФЛ.Использование	= Истина;	
	
	ЭлементОтбораПериод = ОтчетОбъектРЛ.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
		ПараметрыЗапроса.ИдентификаторПериод);
	Если ТипЗнч(ЭлементОтбораПериод.Значение) = Тип("СтандартныйПериод") Тогда
		ЭлементОтбораПериод.Значение.ДатаНачала 	= ПараметрыЗапроса.НачалоПериода;
		ЭлементОтбораПериод.Значение.ДатаОкончания 	= ПараметрыЗапроса.КонецПериода;
	КонецЕсли;
	Если ТипЗнч(ЭлементОтбораПериод.Значение) = Тип("СтандартнаяДатаНачала") Тогда
		ЭлементОтбораПериод.Значение.Дата = ПараметрыЗапроса.НачалоПериода;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПараметрыЗапроса.ИдентификаторОрганизация) Тогда
		ЭлементОтбораРеквизита = ОтчетОбъектРЛ.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
			ПараметрыЗапроса.ИдентификаторОрганизация);
		УстановитьЭлементОтбора(
			ЭлементОтбораРеквизита,
			ДопПараметры.Организации,
			ДопПараметры.ОрганизацииЗаполнены,
			ДопПараметры.ОрганизацииВСписке);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПараметрыЗапроса.ИдентификаторПодразделение) Тогда
		ЭлементОтбораРеквизита = ОтчетОбъектРЛ.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
			ПараметрыЗапроса.ИдентификаторПодразделение);
		УстановитьЭлементОтбора(
			ЭлементОтбораРеквизита, 
			ДопПараметры.Подразделения, 
			ДопПараметры.ПодразделенияЗаполнены, 
			ДопПараметры.ПодразделенияВСписке);
	КонецЕсли;
	
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(
		СхемаКомпоновкиДанных,
		КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки());
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ВнешниеНаборыДанных = ЗарплатаКадрыОтчеты.НаборыВнешнихДанныхАнализНачисленийИУдержаний();
	Если НЕ ВнешниеНаборыДанных.Свойство("ОтветственныеЛицаОрганизации") Тогда
		ТипСтрока = Новый ОписаниеТипов("Строка");
        ОтветственныеЛицаОрганизации = Новый ТаблицаЗначений;
        ОтветственныеЛицаОрганизации.Колонки.Добавить("Организация",									Новый ОписаниеТипов("СправочникСсылка.Организации"));
        ОтветственныеЛицаОрганизации.Колонки.Добавить("Руководитель",									ТипСтрока);
        ОтветственныеЛицаОрганизации.Колонки.Добавить("ГлавныйБухгалтер",							    ТипСтрока);
        ОтветственныеЛицаОрганизации.Колонки.Добавить("Ответственный",							        ТипСтрока);
        ОтветственныеЛицаОрганизации.Колонки.Добавить("ДолжностьРуководителя",					        ТипСтрока);
        ОтветственныеЛицаОрганизации.Колонки.Добавить("ДолжностьГлавногоБухгалтера",					ТипСтрока);
        ОтветственныеЛицаОрганизации.Колонки.Добавить("ДолжностьОтветственного",					    ТипСтрока);
        ВнешниеНаборыДанных.Вставить("ОтветственныеЛицаОрганизации", ОтветственныеЛицаОрганизации);
	КонецЕсли;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, ВнешниеНаборыДанных);
	
	Результат = Новый ТабличныйДокумент;
	
	ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.УстановитьДокумент(Результат);
	ОтчетОбъектРЛ.СкомпоноватьРезультат(Результат); 
	Результат.АвтоМасштаб = Истина;
	
	Возврат Результат;
КонецФункции

Процедура КадровыйРасчетныйЛистокОбработкаРезультатаЗапроса(Выборка, ПараметрыЗапроса, 
	ПараметрыВызова, ВариантОтчета, СтруктураПользНастр, ДопПараметры)
	Если ПараметрыЗапроса.Отчет = "АнализНачисленийИУдержанийАвансом" Тогда
		ОтчетРасчетныйЛисток = ЗарплатаКадрыОтчеты.ОтчетРасчетныйЛистокЗаПервуюПоловинуМесяца(ВариантОтчета);
	ИначеЕсли ПараметрыЗапроса.Отчет = "АнализНачисленийИУдержаний" Тогда	
		ОтчетРасчетныйЛисток = ЗарплатаКадрыОтчеты.ОтчетРасчетныйЛисток(ВариантОтчета);
	Иначе
		ВызватьИсключение "В параметрах отсутствует наименование отчета";
	КонецЕсли;
	
	Если ДопПараметры.КлючВарианта = "РасчетныйЛисток"
		ИЛИ ДопПараметры.КлючВарианта = "РасчетныйЛистокПерваяПоловинаМесяца" Тогда
		Результат = ПечатнаяФормаРасчетногоЛистка(
		Выборка,
		ПараметрыЗапроса,
		ОтчетРасчетныйЛисток);
		ДокументРезультат = Результат.ДокументРезультат;
	Иначе
		ДокументРезультат = ПечатнаяФормаРасчетногоЛисткаСПользовательскимиПараметрами(
		Выборка,
		ПараметрыЗапроса,
		ОтчетРасчетныйЛисток,
		СтруктураПользНастр,
		ДопПараметры);
	КонецЕсли;	
	
	Если ДокументРезультат.ВысотаТаблицы > 0 Тогда
		НазваниеПФ = "Расчетный листок от " + Формат(ПараметрыЗапроса.НачалоПериода, "ДЛФ=Д") 
			+ " по " + Формат(ПараметрыЗапроса.КонецПериода, "ДЛФ=Д") 
			+ " для " + Строка(Выборка.ФизическоеЛицо);
		Вложение = Новый Соответствие;  
		Вложение["Название"] = НазваниеПФ; 
		
		ФайлПРМ = "Файл";
		ПотокВПамяти = Новый ПотокВПамяти;
		Попытка
			ДокументРезультат.Записать(ПотокВПамяти, ТипФайлаТабличногоДокумента.PDF);
			ФайлBase64 = Base64Строка(ПотокВПамяти.ЗакрытьИПолучитьДвоичныеДанные());
			
			// отправка на СБИС Диск
			ИмяФайла = НазваниеПФ + ".pdf";
			context_params = Saby_Core.ПроверитьНаличиеПараметровПодключения(); 
			ОбъектОбработки = Обработки.SABY.Создать();
			СсылкаНаPDF = Неопределено;
			СсылкаНаPDF = ОбъектОбработки.local_helper_convert_to_pdfa_to_disk_x(context_params, ФайлBase64, ИмяФайла);
			СсылкаНаСБИСДиск = Saby_Core.get_prop(СсылкаНаPDF, "FileId");
			// отправка на СБИС Диск
			
			// Прикреплённый файл
			ВыборкаДетальныеЗаписи = Выборка.Выбрать();
			ВыборкаДетальныеЗаписи.Следующий();
			Вложение[ФайлПРМ] = Новый Соответствие;
			Вложение[ФайлПРМ].Вставить("Имя", НазваниеПФ + ".pdf");
			Вложение[ФайлПРМ].Вставить("Ссылка", СсылкаНаСБИСДиск);
			Вложение[ФайлПРМ].Вставить("ContentType", "application/pdf");
			МассивВложений = Новый Массив;
			МассивВложений.Добавить(Вложение);		
		Исключение
			ДокументРезультат.Записать(ПотокВПамяти, ТипФайлаТабличногоДокумента.XLSX);
			ФайлBase64 = Base64Строка(ПотокВПамяти.ЗакрытьИПолучитьДвоичныеДанные());
			
			// отправка на СБИС Диск
			ИмяФайла = НазваниеПФ + ".xlsx";
			context_params = Saby_Core.ПроверитьНаличиеПараметровПодключения(); 
			ОбъектОбработки = Обработки.SABY.Создать();
			СсылкаНаPDF = Неопределено;
			СсылкаНаPDF = ОбъектОбработки.local_helper_convert_to_pdfa_to_disk_x(context_params, ФайлBase64, ИмяФайла);
			СсылкаНаСБИСДиск = Saby_Core.get_prop(СсылкаНаPDF, "FileId");
			// отправка на СБИС Диск
			
			// Прикреплённый файл
			ВыборкаДетальныеЗаписи = Выборка.Выбрать();
			ВыборкаДетальныеЗаписи.Следующий();
			Вложение[ФайлПРМ] = Новый Соответствие;
			Вложение[ФайлПРМ].Вставить("Имя", НазваниеПФ + ".xlsx");
			Вложение[ФайлПРМ].Вставить("Ссылка", СсылкаНаСБИСДиск);
			Вложение[ФайлПРМ].Вставить("ContentType", "application/vnd.openxmlformats-officedocument.spreadsheetml.sheet");
			МассивВложений = Новый Массив;
			МассивВложений.Добавить(Вложение);	
		КонецПопытки;
		
		ПараметрыПКД = Новый Структура();
		ПараметрыПКД.Вставить("Регламент", saby_core.get_prop(ПараметрыЗапроса, "Регламент"));
		ПараметрыПКД.Вставить("ЕстьФильтрПоОрганизации", ПараметрыЗапроса.ЕстьФильтрПоОрганизации);
		ПараметрыПКД.Вставить("ЕстьФильтрПоСотрудникам", ПараметрыЗапроса.ЕстьФильтрПоСотрудникам);
		ПараметрыПКД.Вставить("НачалоПериода", ПараметрыЗапроса.НачалоПериода);
		ПараметрыПКД.Вставить("КонецПериода", ПараметрыЗапроса.КонецПериода);
		ПараметрыПКД.Вставить("Организация", ВыборкаДетальныеЗаписи.Организация);
		ПараметрыПКД.Вставить("ФизическоеЛицо", ВыборкаДетальныеЗаписи.ФизическоеЛицо);
		ПараметрыПКД.Вставить("Подразделение", ВыборкаДетальныеЗаписи.Подразделение);
		ПараметрыПКД.Вставить("Сотрудник", ВыборкаДетальныеЗаписи.Сотрудник);
		ПараметрыПКД.Вставить("_print_forms", МассивВложений);
		
		ПараметрыВызова.Добавить(ПараметрыПКД);
	КонецЕсли; 
КонецПроцедуры

Функция ДанныеНачисленийПоСотрудникам(ПараметрыЗапроса)
	ЗапросНачисления = Новый Запрос;
	ЗапросНачисления.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ) КАК МесяцНачисления,
	|	НачисленияИУдержания.Период КАК Период,
	|	НачисленияИУдержания.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НачисленияИУдержания.Подразделение КАК Подразделение,
	|	НачисленияИУдержания.ГруппаНачисленияУдержанияВыплаты КАК Группа,
	|	НачисленияИУдержания.НачислениеУдержание КАК ВидРасчета,
	|	СУММА(НачисленияИУдержания.Сумма) КАК Сумма,
	|	НачисленияИУдержания.Организация.ГоловнаяОрганизация КАК Организация,
	|	НачисленияИУдержания.Сотрудник КАК Сотрудник,
	|	НачисленияИУдержания.ДатаНачала КАК ДатаНачала,
	|	НачисленияИУдержания.ДатаОкончания КАК ДатаОкончания,
	|	НачисленияИУдержания.ПериодДействия КАК ПериодДействия,
	|	НачисленияИУдержания.ДокументОснование КАК ДокументОснование,
	|	НачисленияИУдержания.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ИСТИНА КАК НачислениеТекущегоПериода
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияИУдержания
	|ГДЕ
	|	НачисленияИУдержания.Период МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ) И КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|	И ВЫБОР
	|			КОГДА &ОрганизацииЗаполнены
	|				ТОГДА ВЫБОР
	|					КОГДА &ОрганизацииВСписке = ИСТИНА
	|						ТОГДА НачисленияИУдержания.Организация В (&Организации)
	|					ИНАЧЕ НЕ НачисленияИУдержания.Организация В (&Организации)
	|				КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ФизическиеЛицаЗаполнены
	|				ТОГДА ВЫБОР
	|					КОГДА &ФизическиеЛицаВСписке = ИСТИНА
	|						ТОГДА НачисленияИУдержания.ФизическоеЛицо В (&ФизическиеЛица)
	|					ИНАЧЕ НЕ НачисленияИУдержания.ФизическоеЛицо В (&ФизическиеЛица)
	|				КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ПодразделенияЗаполнены
	|				ТОГДА ВЫБОР
	|					КОГДА &ПодразделенияВСписке = ИСТИНА
	|						ТОГДА НачисленияИУдержания.Подразделение В (&Подразделения)
	|					ИНАЧЕ НЕ НачисленияИУдержания.Подразделение В (&Подразделения)
	|				КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленияИУдержания.Период,
	|	НачисленияИУдержания.ФизическоеЛицо,
	|	НачисленияИУдержания.Подразделение,
	|	НачисленияИУдержания.ГруппаНачисленияУдержанияВыплаты,
	|	НачисленияИУдержания.НачислениеУдержание,
	|	НачисленияИУдержания.Организация.ГоловнаяОрганизация,
	|	НачисленияИУдержания.Сотрудник,
	|	НачисленияИУдержания.ДатаНачала,
	|	НачисленияИУдержания.ДатаОкончания,
	|	НачисленияИУдержания.ПериодДействия,
	|	НАЧАЛОПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ),
	|	НачисленияИУдержания.ДокументОснование,
	|	НачисленияИУдержания.ИдентификаторСтроки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(НачисленияИУдержания.ПериодДействия, МЕСЯЦ),
	|	НачисленияИУдержания.Период,
	|	НачисленияИУдержания.ФизическоеЛицо,
	|	НачисленияИУдержания.Подразделение,
	|	НачисленияИУдержания.ГруппаНачисленияУдержанияВыплаты,
	|	НачисленияИУдержания.НачислениеУдержание,
	|	0,
	|	НачисленияИУдержания.Организация.ГоловнаяОрганизация,
	|	НачисленияИУдержания.Сотрудник,
	|	НачисленияИУдержания.ДатаНачала,
	|	НачисленияИУдержания.ДатаОкончания,
	|	НачисленияИУдержания.ПериодДействия,
	|	НачисленияИУдержания.ДокументОснование,
	|	НачисленияИУдержания.ИдентификаторСтроки,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияИУдержания
	|ГДЕ
	|	НачисленияИУдержания.ПериодДействия МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ) И КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|	И НачисленияИУдержания.ПериодДействия <> НАЧАЛОПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ)
	|	И ВЫБОР
	|			КОГДА &ОрганизацииЗаполнены
	|				ТОГДА ВЫБОР
	|					КОГДА &ОрганизацииВСписке = ИСТИНА
	|						ТОГДА НачисленияИУдержания.Организация В (&Организации)
	|					ИНАЧЕ НЕ НачисленияИУдержания.Организация В (&Организации)
	|				КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ФизическиеЛицаЗаполнены
	|				ТОГДА ВЫБОР
	|					КОГДА &ФизическиеЛицаВСписке = ИСТИНА
	|						ТОГДА НачисленияИУдержания.ФизическоеЛицо В (&ФизическиеЛица)
	|					ИНАЧЕ НЕ НачисленияИУдержания.ФизическоеЛицо В (&ФизическиеЛица)
	|				КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ПодразделенияЗаполнены
	|				ТОГДА ВЫБОР
	|					КОГДА &ПодразделенияВСписке = ИСТИНА
	|						ТОГДА НачисленияИУдержания.Подразделение В (&Подразделения)
	|					ИНАЧЕ НЕ НачисленияИУдержания.Подразделение В (&Подразделения)
	|				КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамАвансом.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоСотрудникамАвансом.Период,
	|	НачисленияУдержанияПоСотрудникамАвансом.ФизическоеЛицо,
	|	НачисленияУдержанияПоСотрудникамАвансом.Подразделение,
	|	НачисленияУдержанияПоСотрудникамАвансом.ГруппаНачисленияУдержанияВыплаты,
	|	НачисленияУдержанияПоСотрудникамАвансом.НачислениеУдержание,
	|	СУММА(НачисленияУдержанияПоСотрудникамАвансом.Сумма),
	|	НачисленияУдержанияПоСотрудникамАвансом.Организация.ГоловнаяОрганизация,
	|	НачисленияУдержанияПоСотрудникамАвансом.Сотрудник,
	|	НачисленияУдержанияПоСотрудникамАвансом.ДатаНачала,
	|	НачисленияУдержанияПоСотрудникамАвансом.ДатаОкончания,
	|	НачисленияУдержанияПоСотрудникамАвансом.ПериодДействия,
	|	NULL,
	|	НачисленияУдержанияПоСотрудникамАвансом.ИдентификаторСтроки,
	|	ИСТИНА
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникамАвансом КАК НачисленияУдержанияПоСотрудникамАвансом
	|ГДЕ
	|	НачисленияУдержанияПоСотрудникамАвансом.Период МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ) И КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|	И ВЫБОР
	|			КОГДА &ОрганизацииЗаполнены
	|				ТОГДА ВЫБОР
	|					КОГДА &ОрганизацииВСписке = ИСТИНА
	|						ТОГДА НачисленияУдержанияПоСотрудникамАвансом.Организация В (&Организации)
	|					ИНАЧЕ НЕ НачисленияУдержанияПоСотрудникамАвансом.Организация В (&Организации)
	|				КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ФизическиеЛицаЗаполнены
	|				ТОГДА ВЫБОР
	|					КОГДА &ФизическиеЛицаВСписке = ИСТИНА
	|						ТОГДА НачисленияУдержанияПоСотрудникамАвансом.ФизическоеЛицо В (&ФизическиеЛица)
	|					ИНАЧЕ НЕ НачисленияУдержанияПоСотрудникамАвансом.ФизическоеЛицо В (&ФизическиеЛица)
	|				КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ПодразделенияЗаполнены
	|				ТОГДА ВЫБОР
	|					КОГДА &ПодразделенияВСписке = ИСТИНА
	|						ТОГДА НачисленияУдержанияПоСотрудникамАвансом.Подразделение В (&Подразделения)
	|					ИНАЧЕ НЕ НачисленияУдержанияПоСотрудникамАвансом.Подразделение В (&Подразделения)
	|				КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленияУдержанияПоСотрудникамАвансом.Период,
	|	НачисленияУдержанияПоСотрудникамАвансом.ФизическоеЛицо,
	|	НачисленияУдержанияПоСотрудникамАвансом.Подразделение,
	|	НачисленияУдержанияПоСотрудникамАвансом.ГруппаНачисленияУдержанияВыплаты,
	|	НачисленияУдержанияПоСотрудникамАвансом.НачислениеУдержание,
	|	НачисленияУдержанияПоСотрудникамАвансом.Организация.ГоловнаяОрганизация,
	|	НачисленияУдержанияПоСотрудникамАвансом.Сотрудник,
	|	НачисленияУдержанияПоСотрудникамАвансом.ДатаНачала,
	|	НачисленияУдержанияПоСотрудникамАвансом.ДатаОкончания,
	|	НачисленияУдержанияПоСотрудникамАвансом.ПериодДействия,
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамАвансом.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоСотрудникамАвансом.ИдентификаторСтроки";   
	
	Для Каждого КлючЗнч Из ПараметрыЗапроса Цикл
		ЗапросНачисления.УстановитьПараметр(КлючЗнч.Ключ, КлючЗнч.Значение);
	КонецЦикла;
	РезультатЗапросаНачисления = ЗапросНачисления.Выполнить();
	Возврат РезультатЗапросаНачисления;
КонецФункции

Функция ПустаяСсылка(ТипСсылки)
	Типы = Новый Массив;
	Типы.Добавить(ТипСсылки);
	ОписаниеТипов = Новый ОписаниеТипов(Типы);
	Возврат ОписаниеТипов.ПривестиЗначение(Неопределено);
КонецФункции

Функция ПараметрыФильтраПоПолю(ПараметрыЗапроса, ИмяПоля, ТипПоля, ЕстьФильтрПоПолю, ВидСравненияПоля)
	ЗначениеРеквизита	= Новый СписокЗначений;
	РеквизитЗаполнен	= Ложь;
	РеквизитВСписке		= Истина;
	
	Если ЕстьФильтрПоПолю Тогда
		
		Если ТипЗнч(ПараметрыЗапроса[ИмяПоля]) = ТипПоля Тогда
			Если НЕ ПараметрыЗапроса[ИмяПоля] = ПустаяСсылка(ТипПоля) Тогда
				ЗначениеРеквизита.Добавить(ПараметрыЗапроса[ИмяПоля]);
				РеквизитЗаполнен = Истина;	
			КонецЕсли;
		Иначе
			Если ТипЗнч(ПараметрыЗапроса[ИмяПоля]) = Тип("СписокЗначений") Тогда 
				ЗначениеРеквизита = ПараметрыЗапроса[ИмяПоля];
				РеквизитЗаполнен = ПараметрыЗапроса[ИмяПоля].Количество() > 0;
			КонецЕсли;
		КонецЕсли;
		
		РеквизитВСписке = НЕ (ВидСравненияПоля = ВидСравненияКомпоновкиДанных.НеРавно
			ИЛИ ВидСравненияПоля = ВидСравненияКомпоновкиДанных.НеВИерархии
			ИЛИ ВидСравненияПоля = ВидСравненияКомпоновкиДанных.НеВСписке
			ИЛИ ВидСравненияПоля = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии
			ИЛИ ВидСравненияПоля = ВидСравненияКомпоновкиДанных.НеЗаполнено);
	КонецЕсли;
	
	Результат = Новый Структура("ЗначениеРеквизита, РеквизитЗаполнен, РеквизитВСписке",
		ЗначениеРеквизита,
		РеквизитЗаполнен,
		РеквизитВСписке); 
		
	Возврат Результат;	
КонецФункции

Функция ВсеСотрудникиКЭДО(ТолькоСотрудникиКЭДО)
	Если НЕ ТолькоСотрудникиКЭДО Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДопСвойствоКЭДО = Saby_Core.НайтиСвойствоПоИмени("КЭДО");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеСведения.Объект КАК Объект
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Свойство = &Свойство
		|	И ДополнительныеСведения.Значение = ИСТИНА";
	
	Запрос.УстановитьПараметр("Свойство", ДопСвойствоКЭДО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

Функция ПодготовитьДанныеПрочийКадровыйРасчетныйЛисток(ПараметрыЗапроса) Экспорт
	ПараметрыВызова = Новый Массив;	
	
	ФизическиеЛица 			= Новый СписокЗначений;
	ФизическиеЛицаЗаполнены = Ложь; 
	ФизическиеЛицаВСписке	= Истина;
	Организации 			= Новый СписокЗначений;
	ОрганизацииЗаполнены 	= Ложь;
	ОрганизацииВСписке		= Истина;
	Подразделения 			= Новый СписокЗначений;
	ПодразделенияЗаполнены 	= Ложь;
	ПодразделенияВСписке 	= Истина;
	
	РезультатЗнчФильтра = ПараметрыФильтраПоПолю(
		ПараметрыЗапроса,
		"ФизическиеЛица", 
		Тип("СправочникСсылка.ФизическиеЛица"),
		ПараметрыЗапроса.ЕстьФильтрПоФизическимЛицам,
		ПараметрыЗапроса.ВидСравненияФизическиеЛица);
	ФизическиеЛица = РезультатЗнчФильтра.ЗначениеРеквизита;
	ФизическиеЛицаЗаполнены = РезультатЗнчФильтра.РеквизитЗаполнен;
	ФизическиеЛицаВСписке = РезультатЗнчФильтра.РеквизитВСписке;

	РезультатЗнчФильтра = ПараметрыФильтраПоПолю(
		ПараметрыЗапроса,
		"Организация", 
		Тип("СправочникСсылка.Организации"),
		ПараметрыЗапроса.ЕстьФильтрПоОрганизации,
		ПараметрыЗапроса.ВидСравненияОрганизация);
	Организации = РезультатЗнчФильтра.ЗначениеРеквизита;
	ОрганизацииЗаполнены = РезультатЗнчФильтра.РеквизитЗаполнен;
	ОрганизацииВСписке = РезультатЗнчФильтра.РеквизитВСписке;
	
	РезультатЗнчФильтра = ПараметрыФильтраПоПолю(
		ПараметрыЗапроса,
		"Подразделения", 
		Тип("СправочникСсылка.ПодразделенияОрганизаций"),
		ПараметрыЗапроса.ЕстьФильтрПоПодразделениям,
		ПараметрыЗапроса.ВидСравненияПодразделения);
	Подразделения = РезультатЗнчФильтра.ЗначениеРеквизита;
	ПодразделенияЗаполнены = РезультатЗнчФильтра.РеквизитЗаполнен;
	ПодразделенияВСписке = РезультатЗнчФильтра.РеквизитВСписке;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КадроваяИсторияСотрудниковИнтервальный.ФизическоеЛицо КАК ФизическоеЛицо,
	|	КадроваяИсторияСотрудниковИнтервальный.Организация КАК Организация,
	|	КадроваяИсторияСотрудниковИнтервальный.Подразделение КАК Подразделение,
	|	КадроваяИсторияСотрудниковИнтервальный.Сотрудник КАК Сотрудник,
	|	КадроваяИсторияСотрудниковИнтервальный.ГоловнаяОрганизация КАК ГоловнаяОрганизация
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудниковИнтервальный КАК КадроваяИсторияСотрудниковИнтервальный
	|ГДЕ
	|	КадроваяИсторияСотрудниковИнтервальный.ДатаОкончания >= &НачалоПериода
	|	И КадроваяИсторияСотрудниковИнтервальный.ДатаНачала <= &КонецПериода
	|	И ВЫБОР
	|			КОГДА &ФизическиеЛицаЗаполнены = ЛОЖЬ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВЫБОР
	|					КОГДА &ФизическиеЛицаВСписке = ИСТИНА
	|						ТОГДА КадроваяИсторияСотрудниковИнтервальный.ФизическоеЛицо В (&ФизическиеЛица)
	|					ИНАЧЕ НЕ КадроваяИсторияСотрудниковИнтервальный.ФизическоеЛицо В (&ФизическиеЛица)
	|				КОНЕЦ
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОрганизацииЗаполнены = ЛОЖЬ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВЫБОР
	|					КОГДА &ОрганизацииВСписке = ИСТИНА
	|						ТОГДА КадроваяИсторияСотрудниковИнтервальный.Организация В (&Организации)
	|					ИНАЧЕ НЕ КадроваяИсторияСотрудниковИнтервальный.Организация В (&Организации)
	|				КОНЕЦ
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ПодразделенияЗаполнены = ЛОЖЬ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВЫБОР
	|					КОГДА &ПодразделенияВСписке = ИСТИНА
	|						ТОГДА КадроваяИсторияСотрудниковИнтервальный.Подразделение В (&Подразделения)
	|					ИНАЧЕ НЕ КадроваяИсторияСотрудниковИнтервальный.Подразделение В (&Подразделения)
	|				КОНЕЦ
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ТолькоСотрудникиКЭДО = ИСТИНА
	|				ТОГДА КадроваяИсторияСотрудниковИнтервальный.Сотрудник В (&СотрудникиКЭДО)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НЕ КадроваяИсторияСотрудниковИнтервальный.Сотрудник.ПометкаУдаления
	|    И КадроваяИсторияСотрудниковИнтервальный.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
	|
	|УПОРЯДОЧИТЬ ПО
	|	КадроваяИсторияСотрудниковИнтервальный.ДатаОкончания УБЫВ
	|ИТОГИ
	|	МАКСИМУМ(ГоловнаяОрганизация)
	|ПО
	|	ФизическоеЛицо";
	
	СотрудникиКЭДО = ВсеСотрудникиКЭДО(ПараметрыЗапроса.ТолькоСотрудникиКЭДО);

	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("ФизическиеЛица", ФизическиеЛица);
	ДопПараметры.Вставить("ФизическиеЛицаЗаполнены", ФизическиеЛицаЗаполнены);
	ДопПараметры.Вставить("ФизическиеЛицаВСписке", ФизическиеЛицаВСписке);
	ДопПараметры.Вставить("Организации", Организации);
	ДопПараметры.Вставить("ОрганизацииЗаполнены", ОрганизацииЗаполнены);
	ДопПараметры.Вставить("ОрганизацииВСписке", ОрганизацииВСписке);
	ДопПараметры.Вставить("Подразделения", Подразделения);
	ДопПараметры.Вставить("ПодразделенияЗаполнены", ПодразделенияЗаполнены);
	ДопПараметры.Вставить("ПодразделенияВСписке", ПодразделенияВСписке);
	ДопПараметры.Вставить("ТолькоСотрудникиКЭДО", ПараметрыЗапроса.ТолькоСотрудникиКЭДО);
	ДопПараметры.Вставить("СотрудникиКЭДО", СотрудникиКЭДО);
	
	Для Каждого ЗнчКлюч Из ДопПараметры Цикл
		Запрос.УстановитьПараметр(ЗнчКлюч.Ключ, ЗнчКлюч.Значение);
	КонецЦикла;
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыЗапроса.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ПараметрыЗапроса.КонецПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаСотрудники = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Попытка
		ПараметрыВызова = Новый Массив;	
		// BSLLS:SetPrivilegedMode-off
		// Использование привилегированного режима
		УстановитьПривилегированныйРежим(Истина);
		// BSLLS:SetPrivilegedMode-on
		КлючВарианта = ПараметрыЗапроса.КлючВарианта;
		ВариантОтчета = ВариантыОтчетов.ВариантОтчета(
			ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Отчет." + ПараметрыЗапроса.Отчет),
			КлючВарианта);
		// BSLLS:SpaceAtStartComment-off
		// BSLLS:Typo-off
		// обижается на сокращения
		СтруктураПользНастр = Новый Структура;	
		// BSLLS:Typo-on
		// BSLLS:SpaceAtStartComment-on
		// Вариант
		Если КлючВарианта <> "РасчетныйЛисток" И КлючВарианта <> "РасчетныйЛистокПерваяПоловинаМесяца" Тогда		
			Если ПараметрыЗапроса.Отчет = "АнализНачисленийИУдержанийАвансом" Тогда
				ОтчетОбъектРЛ = Отчеты.АнализНачисленийИУдержанийАвансом.Создать();
				ОтчетОбъектРЛ.ИнициализироватьОтчет(КлючВарианта);           
				СхемаКомпоновкиДанных = Отчеты.АнализНачисленийИУдержанийАвансом.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
			ИначеЕсли ПараметрыЗапроса.Отчет = "АнализНачисленийИУдержаний" Тогда	
				ОтчетОбъектРЛ = Отчеты.АнализНачисленийИУдержаний.Создать();
				ОтчетОбъектРЛ.ИнициализироватьОтчет(КлючВарианта);           
				СхемаКомпоновкиДанных = Отчеты.АнализНачисленийИУдержаний.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
			Иначе
				ВызватьИсключение "В параметрах отсутствует наименование отчета";
			КонецЕсли;
			КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
			КомпоновщикНастроекКомпоновкиДанных.Инициализировать(
				Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
			КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
			КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьПользовательскиеНастройки(
				ОтчетОбъектРЛ.КомпоновщикНастроек.ПользовательскиеНастройки);
			КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(ВариантОтчета.Настройки.Получить());
			ОтчетОбъектРЛ.КомпоновщикНастроек.ЗагрузитьНастройки(ВариантОтчета.Настройки.Получить());
			СтруктураПользНастр.Вставить("ОтчетОбъектРЛ", ОтчетОбъектРЛ);
			СтруктураПользНастр.Вставить("СхемаКомпоновкиДанных", СхемаКомпоновкиДанных);
			СтруктураПользНастр.Вставить("КомпоновщикНастроекКомпоновкиДанных", КомпоновщикНастроекКомпоновкиДанных);
		КонецЕсли;
		
		// Вариант
		
		РезультатЗапросаНачисления = ДанныеНачисленийПоСотрудникам(Запрос.Параметры);
		ТЗ_Начисления = РезультатЗапросаНачисления.Выгрузить();
		Пока ВыборкаСотрудники.Следующий() Цикл
			
			ОтборСтрок = Новый Структура();
			ОтборСтрок.Вставить("ФизическоеЛицо", ВыборкаСотрудники.ФизическоеЛицо);
			ОтборСтрок.Вставить("Организация", ВыборкаСотрудники.ГоловнаяОрганизация);
			ДанныеПоНачислениям = ТЗ_Начисления.НайтиСтроки(ОтборСтрок);
			Если ДанныеПоНачислениям.Количество() > 0 Тогда
				ДопПараметры.Вставить("КлючВарианта", КлючВарианта);
				КадровыйРасчетныйЛистокОбработкаРезультатаЗапроса(
					ВыборкаСотрудники,
					ПараметрыЗапроса,
					ПараметрыВызова,
					ВариантОтчета,
					СтруктураПользНастр,
					ДопПараметры);
			КонецЕсли;
			
		КонецЦикла;
	Исключение
		ИнфоОбОшибке	= ИнформацияОбОшибке();
		СтруктураОшибки	= Saby_Core.ExtExceptionAnalyse(ИнфоОбОшибке);
		Saby_Core.ExtExceptionToJournal(СтруктураОшибки);
	КонецПопытки;	
	
	ПараметрыВызоваИни = Новый Соответствие;
	ПараметрыВызоваИни.Вставить("list_doc_ref", ПараметрыВызова);
	Возврат ПараметрыВызоваИни;
КонецФункции
