
Процедура УстановитьЭлементОтбора(ЭлементОтбораРеквизита, ЗначениеОтбора, ИспользованиеОтбора, РеквизитВСписке, РеквизитВИерархии)
	Если РеквизитВСписке И НЕ РеквизитВИерархии Тогда
		ЭлементОтбораРеквизита.ВидСравнения	= ВидСравненияКомпоновкиДанных.ВСписке;
	ИначеЕсли РеквизитВСписке И РеквизитВИерархии Тогда
		ЭлементОтбораРеквизита.ВидСравнения	= ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
	ИначеЕсли НЕ РеквизитВСписке И НЕ РеквизитВИерархии Тогда
		ЭлементОтбораРеквизита.ВидСравнения	= ВидСравненияКомпоновкиДанных.НеВСписке; 
	Иначе
		ЭлементОтбораРеквизита.ВидСравнения	= ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии;
	КонецЕсли;
	ЭлементОтбораРеквизита.ПравоеЗначение	= ЗначениеОтбора;
	ЭлементОтбораРеквизита.Использование	= ИспользованиеОтбора;	
КонецПроцедуры

Функция ПечатнаяФормаРасчетногоЛистка(Выборка, ПараметрыЗапроса, ОтчетРасчетныйЛисток)
	Попытка
		Результат = Отчеты.АнализНачисленийИУдержаний.ДанныеРасчетныхЛистков(   
			Выборка.ФизическоеЛицо,
			Выборка.ГоловнаяОрганизация,
			ПараметрыЗапроса.НачалоПериода,
			ПараметрыЗапроса.КонецПериода,
			ОтчетРасчетныйЛисток);
	Исключение
		// Начиная с Версии ЗУП 3.1.24.408			
		Результат = ЗарплатаКадрыОтчеты.ДанныеРасчетныхЛистков(
			Выборка.ФизическоеЛицо, 
			Выборка.ГоловнаяОрганизация,
			ПараметрыЗапроса.НачалоПериода,
			ПараметрыЗапроса.КонецПериода,
			ОтчетРасчетныйЛисток);
	КонецПопытки;
	Возврат Результат;
КонецФункции

Функция ПечатнаяФормаРасчетногоЛисткаСПользовательскимиПараметрами(Выборка, ПараметрыЗапроса, ОтчетРасчетныйЛисток,
	СтруктураПользовательскихНастроек, ДопПараметры)
	ОтчетОбъектРЛ = СтруктураПользовательскихНастроек.ОтчетОбъектРЛ;
	СхемаКомпоновкиДанных = СтруктураПользовательскихНастроек.СхемаКомпоновкиДанных; 
	КомпоновщикНастроекКомпоновкиДанных = СтруктураПользовательскихНастроек.КомпоновщикНастроекКомпоновкиДанных;
	
	ЭлементОтбораФЛ = ОтчетОбъектРЛ.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
		ПараметрыЗапроса.ИдентификаторФизическоеЛицо);
	ЭлементОтбораФЛ.ПравоеЗначение	= Выборка.ФизическоеЛицо;
	ЭлементОтбораФЛ.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораФЛ.Использование	= Истина;	
	
	ЭлементОтбораПериод = ОтчетОбъектРЛ.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
		ПараметрыЗапроса.ИдентификаторПериод);
	Если ТипЗнч(ЭлементОтбораПериод.Значение) = Тип("СтандартныйПериод") Тогда
		ЭлементОтбораПериод.Значение.ДатаНачала 	= ПараметрыЗапроса.НачалоПериода;
		ЭлементОтбораПериод.Значение.ДатаОкончания 	= ПараметрыЗапроса.КонецПериода;
	КонецЕсли;
	Если ТипЗнч(ЭлементОтбораПериод.Значение) = Тип("СтандартнаяДатаНачала") Тогда
		ЭлементОтбораПериод.Значение.Дата = ПараметрыЗапроса.НачалоПериода;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПараметрыЗапроса.ИдентификаторОрганизация) Тогда
		ЭлементОтбораРеквизита = ОтчетОбъектРЛ.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
			ПараметрыЗапроса.ИдентификаторОрганизация);
		УстановитьЭлементОтбора(
			ЭлементОтбораРеквизита,
			ДопПараметры.Организации,
			ДопПараметры.ОрганизацииЗаполнены,
			ДопПараметры.ОрганизацииВСписке,
			Ложь);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПараметрыЗапроса.ИдентификаторПодразделение) Тогда
		ЭлементОтбораРеквизита = ОтчетОбъектРЛ.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
			ПараметрыЗапроса.ИдентификаторПодразделение);
		УстановитьЭлементОтбора(
			ЭлементОтбораРеквизита, 
			ДопПараметры.Подразделения, 
			ДопПараметры.ПодразделенияЗаполнены, 
			ДопПараметры.ПодразделенияВСписке,
			ДопПараметры.ПодразделенияВИерархии);
	КонецЕсли;
	
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(
		СхемаКомпоновкиДанных,
		КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки());
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ВнешниеНаборыДанных = ЗарплатаКадрыОтчеты.НаборыВнешнихДанныхАнализНачисленийИУдержаний();
	Если НЕ ВнешниеНаборыДанных.Свойство("ОтветственныеЛицаОрганизации") Тогда
		ТипСтрока = Новый ОписаниеТипов("Строка");
        ОтветственныеЛицаОрганизации = Новый ТаблицаЗначений;
        ОтветственныеЛицаОрганизации.Колонки.Добавить("Организация",									Новый ОписаниеТипов("СправочникСсылка.Организации"));
        ОтветственныеЛицаОрганизации.Колонки.Добавить("Руководитель",									ТипСтрока);
        ОтветственныеЛицаОрганизации.Колонки.Добавить("ГлавныйБухгалтер",							    ТипСтрока);
        ОтветственныеЛицаОрганизации.Колонки.Добавить("Ответственный",							        ТипСтрока);
        ОтветственныеЛицаОрганизации.Колонки.Добавить("ДолжностьРуководителя",					        ТипСтрока);
        ОтветственныеЛицаОрганизации.Колонки.Добавить("ДолжностьГлавногоБухгалтера",					ТипСтрока);
        ОтветственныеЛицаОрганизации.Колонки.Добавить("ДолжностьОтветственного",					    ТипСтрока);
        ВнешниеНаборыДанных.Вставить("ОтветственныеЛицаОрганизации", ОтветственныеЛицаОрганизации);
	КонецЕсли;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, ВнешниеНаборыДанных);
	
	Результат = Новый ТабличныйДокумент;
	
	ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент.УстановитьДокумент(Результат);
	ОтчетОбъектРЛ.СкомпоноватьРезультат(Результат); 
	Результат.АвтоМасштаб = Истина;
	
	Возврат Результат;
КонецФункции

Функция ОтчетРасчетныйЛистокПоНаименованию(НаименованиеОтчета, ВариантОтчета)
	Если НаименованиеОтчета = "АнализНачисленийИУдержанийАвансом" Тогда 
		Попытка
			ОтчетРасчетныйЛисток = ЗарплатаКадрыОтчеты.ОтчетРасчетныйЛистокЗаПервуюПоловинуМесяца(ВариантОтчета);
		Исключение
			ОтчетРасчетныйЛисток = ЗарплатаКадрыОтчеты.ОтчетРасчетныйЛистокЗаПервуюПоловинуМесяца();
		КонецПопытки;
	ИначеЕсли НаименованиеОтчета = "АнализНачисленийИУдержаний" Тогда
		Попытка
			ОтчетРасчетныйЛисток = ЗарплатаКадрыОтчеты.ОтчетРасчетныйЛисток(ВариантОтчета); 
		Исключение	
			ОтчетРасчетныйЛисток = ЗарплатаКадрыОтчеты.ОтчетРасчетныйЛисток(); 
		КонецПопытки;
	Иначе
		ВызватьИсключение "В параметрах отсутствует наименование отчета";
	КонецЕсли;
		
	Возврат ОтчетРасчетныйЛисток;
КонецФункции

Процедура КадровыйРасчетныйЛистокОбработкаРезультатаЗапроса(Выборка, ПараметрыЗапроса, 
	ПараметрыВызова, ВариантОтчета, СтруктураПользовательскихНастроек, ДопПараметры, ОтчетОВыполнении)
	ОтчетРасчетныйЛисток = ОтчетРасчетныйЛистокПоНаименованию(ПараметрыЗапроса.Отчет, ВариантОтчета);
	
	Если ДопПараметры.КлючВарианта = "РасчетныйЛисток"
		ИЛИ ДопПараметры.КлючВарианта = "РасчетныйЛистокПерваяПоловинаМесяца" Тогда
		Результат = ПечатнаяФормаРасчетногоЛистка(
		Выборка,
		ПараметрыЗапроса,
		ОтчетРасчетныйЛисток);
		ДокументРезультат = Результат.ДокументРезультат;
	Иначе
		ДокументРезультат = ПечатнаяФормаРасчетногоЛисткаСПользовательскимиПараметрами(
		Выборка,
		ПараметрыЗапроса,
		ОтчетРасчетныйЛисток,
		СтруктураПользовательскихНастроек,
		ДопПараметры);
	КонецЕсли;	
	
	Если ДокументРезультат.ВысотаТаблицы > 0 Тогда
		НазваниеПФ = "Расчетный листок от " + Формат(ПараметрыЗапроса.НачалоПериода, "ДЛФ=Д") 
			+ " по " + Формат(ПараметрыЗапроса.КонецПериода, "ДЛФ=Д") 
			+ " для " + Строка(Выборка.ФизическоеЛицо);
		Вложение = Новый Соответствие;  
		Вложение["Название"] = НазваниеПФ; 
		
		ФайлПРМ = "Файл";
		ПотокВПамяти = Новый ПотокВПамяти;
		Попытка
			ДокументРезультат.Записать(ПотокВПамяти, ТипФайлаТабличногоДокумента.PDF);
			ФайлBase64 = Base64Строка(ПотокВПамяти.ЗакрытьИПолучитьДвоичныеДанные());
			РасширениеФайла = ".pdf";
			ContentType = "application/pdf";
		Исключение
			ДокументРезультат.Записать(ПотокВПамяти, ТипФайлаТабличногоДокумента.XLSX);
			ФайлBase64 = Base64Строка(ПотокВПамяти.ЗакрытьИПолучитьДвоичныеДанные());
			РасширениеФайла = ".xlsx";
			ContentType = "application/vnd.openxmlformats-officedocument.spreadsheetml.sheet";
		КонецПопытки;
		
		ВыборкаДетальныеЗаписи = Выборка.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();

		Попытка
			// отправка на СБИС Диск
			ИмяФайла = НазваниеПФ + РасширениеФайла;
			context_params = МодульCore().ПроверитьНаличиеПараметровПодключения(); 
			ОбъектОбработки = ПолучитьОбъектОбработки();
			СсылкаНаPDF = Неопределено;
			СсылкаНаPDF = ОбъектОбработки.local_helper_convert_to_pdfa_to_disk_x(context_params, ФайлBase64, ИмяФайла);
			СсылкаНаСБИСДиск = МодульCore().get_prop(СсылкаНаPDF, "FileId");
			
			// Прикреплённый файл
			Вложение[ФайлПРМ] = Новый Соответствие;
			Вложение[ФайлПРМ].Вставить("Имя", НазваниеПФ + РасширениеФайла);
			Вложение[ФайлПРМ].Вставить("Ссылка", СсылкаНаСБИСДиск);
			Вложение[ФайлПРМ].Вставить("ContentType", ContentType);
			МассивВложений = Новый Массив;
			МассивВложений.Добавить(Вложение);		
		Исключение
			// запись ошибки в журнал 1с
			ИнфоОбОшибке	= ИнформацияОбОшибке();
			СтруктураОшибки	= МодульCore().ExtExceptionAnalyse(ИнфоОбОшибке);
			СтруктураОшибки.Вставить("action", Строка(Выборка.ФизическоеЛицо));
			МодульCore().ExtExceptionToJournal(СтруктураОшибки);
			
			// запись информации в отчет
			ОтчетОВыполнении.ОшибкаЗагрузкиВложений = ОтчетОВыполнении.ОшибкаЗагрузкиВложений + 1;
			ОтчетОВыполнении.ОшибкаЗагрузкиВложенийСотрудники.Добавить(Строка(Выборка.ФизическоеЛицо));
			Возврат;
		КонецПопытки;
		ОтчетОВыполнении.Успешно = ОтчетОВыполнении.Успешно + 1;
		
		ПараметрыПКД = Новый Структура();
		ПараметрыПКД.Вставить("Регламент", МодульCore().get_prop(ПараметрыЗапроса, "Регламент"));
		ПараметрыПКД.Вставить("ЕстьФильтрПоОрганизации", ПараметрыЗапроса.ЕстьФильтрПоОрганизации);
		ПараметрыПКД.Вставить("ЕстьФильтрПоСотрудникам", ПараметрыЗапроса.ЕстьФильтрПоСотрудникам);
		ПараметрыПКД.Вставить("НачалоПериода", ПараметрыЗапроса.НачалоПериода);
		ПараметрыПКД.Вставить("КонецПериода", ПараметрыЗапроса.КонецПериода);
		ПараметрыПКД.Вставить("Организация", ВыборкаДетальныеЗаписи.Организация);
		ПараметрыПКД.Вставить("ФизическоеЛицо", ВыборкаДетальныеЗаписи.ФизическоеЛицо);
		ПараметрыПКД.Вставить("Подразделение", ВыборкаДетальныеЗаписи.Подразделение);
		ПараметрыПКД.Вставить("Сотрудник", ВыборкаДетальныеЗаписи.Сотрудник);
		ПараметрыПКД.Вставить("_print_forms", МассивВложений);
		
		ПараметрыВызова.Добавить(ПараметрыПКД);
	Иначе
		ОтчетОВыполнении.ПустойОтчет = ОтчетОВыполнении.ПустойОтчет + 1;
		ОтчетОВыполнении.ПустойОтчетСотрудники.Добавить(Строка(Выборка.ФизическоеЛицо));
	КонецЕсли; 
КонецПроцедуры

Функция ДанныеНачисленийПоСотрудникам(ПараметрыЗапроса)
	ЗапросНачисления = Новый Запрос;
	ЗапросНачисления.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ) КАК МесяцНачисления,
	|	НачисленияИУдержания.Период КАК Период,
	|	НачисленияИУдержания.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НачисленияИУдержания.Подразделение КАК Подразделение,
	|	НачисленияИУдержания.ГруппаНачисленияУдержанияВыплаты КАК Группа,
	|	НачисленияИУдержания.НачислениеУдержание КАК ВидРасчета,
	|	СУММА(НачисленияИУдержания.Сумма) КАК Сумма,
	|	НачисленияИУдержания.Организация.ГоловнаяОрганизация КАК Организация,
	|	НачисленияИУдержания.Сотрудник КАК Сотрудник,
	|	НачисленияИУдержания.ДатаНачала КАК ДатаНачала,
	|	НачисленияИУдержания.ДатаОкончания КАК ДатаОкончания,
	|	НачисленияИУдержания.ПериодДействия КАК ПериодДействия,
	|	НачисленияИУдержания.ДокументОснование КАК ДокументОснование,
	|	НачисленияИУдержания.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ИСТИНА КАК НачислениеТекущегоПериода
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияИУдержания
	|ГДЕ
	|	НачисленияИУдержания.Период МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ) И КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|	И ВЫБОР
	|			КОГДА &ОрганизацииЗаполнены
	|				ТОГДА ВЫБОР
	|					КОГДА &ОрганизацииВСписке = ИСТИНА
	|						ТОГДА НачисленияИУдержания.Организация В (&Организации)
	|					ИНАЧЕ НЕ НачисленияИУдержания.Организация В (&Организации)
	|				КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ФизическиеЛицаЗаполнены
	|				ТОГДА ВЫБОР
	|					КОГДА &ФизическиеЛицаВСписке = ИСТИНА
	|						ТОГДА НачисленияИУдержания.ФизическоеЛицо В (&ФизическиеЛица)
	|					ИНАЧЕ НЕ НачисленияИУдержания.ФизическоеЛицо В (&ФизическиеЛица)
	|				КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ПодразделенияЗаполнены
	|				ТОГДА ВЫБОР
	|					КОГДА &ПодразделенияВСписке = ИСТИНА И &ПодразделенияВИерархии = ЛОЖЬ
	|						ТОГДА НачисленияИУдержания.Подразделение В (&Подразделения)
	|					КОГДА &ПодразделенияВСписке = ЛОЖЬ И &ПодразделенияВИерархии = ЛОЖЬ
	|						ТОГДА НЕ НачисленияИУдержания.Подразделение В (&Подразделения)
	|					КОГДА &ПодразделенияВСписке = ИСТИНА И &ПодразделенияВИерархии = ИСТИНА
	|						ТОГДА НачисленияИУдержания.Подразделение В ИЕРАРХИИ (&Подразделения)
	|					ИНАЧЕ НЕ НачисленияИУдержания.Подразделение В ИЕРАРХИИ (&Подразделения)
	|				КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленияИУдержания.Период,
	|	НачисленияИУдержания.ФизическоеЛицо,
	|	НачисленияИУдержания.Подразделение,
	|	НачисленияИУдержания.ГруппаНачисленияУдержанияВыплаты,
	|	НачисленияИУдержания.НачислениеУдержание,
	|	НачисленияИУдержания.Организация.ГоловнаяОрганизация,
	|	НачисленияИУдержания.Сотрудник,
	|	НачисленияИУдержания.ДатаНачала,
	|	НачисленияИУдержания.ДатаОкончания,
	|	НачисленияИУдержания.ПериодДействия,
	|	НАЧАЛОПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ),
	|	НачисленияИУдержания.ДокументОснование,
	|	НачисленияИУдержания.ИдентификаторСтроки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(НачисленияИУдержания.ПериодДействия, МЕСЯЦ),
	|	НачисленияИУдержания.Период,
	|	НачисленияИУдержания.ФизическоеЛицо,
	|	НачисленияИУдержания.Подразделение,
	|	НачисленияИУдержания.ГруппаНачисленияУдержанияВыплаты,
	|	НачисленияИУдержания.НачислениеУдержание,
	|	0,
	|	НачисленияИУдержания.Организация.ГоловнаяОрганизация,
	|	НачисленияИУдержания.Сотрудник,
	|	НачисленияИУдержания.ДатаНачала,
	|	НачисленияИУдержания.ДатаОкончания,
	|	НачисленияИУдержания.ПериодДействия,
	|	НачисленияИУдержания.ДокументОснование,
	|	НачисленияИУдержания.ИдентификаторСтроки,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияИУдержания
	|ГДЕ
	|	НачисленияИУдержания.ПериодДействия МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ) И КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|	И НачисленияИУдержания.ПериодДействия <> НАЧАЛОПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ)
	|	И ВЫБОР
	|			КОГДА &ОрганизацииЗаполнены
	|				ТОГДА ВЫБОР
	|					КОГДА &ОрганизацииВСписке = ИСТИНА
	|						ТОГДА НачисленияИУдержания.Организация В (&Организации)
	|					ИНАЧЕ НЕ НачисленияИУдержания.Организация В (&Организации)
	|				КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ФизическиеЛицаЗаполнены
	|				ТОГДА ВЫБОР
	|					КОГДА &ФизическиеЛицаВСписке = ИСТИНА
	|						ТОГДА НачисленияИУдержания.ФизическоеЛицо В (&ФизическиеЛица)
	|					ИНАЧЕ НЕ НачисленияИУдержания.ФизическоеЛицо В (&ФизическиеЛица)
	|				КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ПодразделенияЗаполнены
	|				ТОГДА ВЫБОР
	|					КОГДА &ПодразделенияВСписке = ИСТИНА И &ПодразделенияВИерархии = ЛОЖЬ
	|						ТОГДА НачисленияИУдержания.Подразделение В (&Подразделения)
	|					КОГДА &ПодразделенияВСписке = ЛОЖЬ И &ПодразделенияВИерархии = ЛОЖЬ
	|						ТОГДА НЕ НачисленияИУдержания.Подразделение В (&Подразделения)
	|					КОГДА &ПодразделенияВСписке = ИСТИНА И &ПодразделенияВИерархии = ИСТИНА
	|						ТОГДА НачисленияИУдержания.Подразделение В ИЕРАРХИИ (&Подразделения)
	|					ИНАЧЕ НЕ НачисленияИУдержания.Подразделение В ИЕРАРХИИ (&Подразделения)
	|				КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамАвансом.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоСотрудникамАвансом.Период,
	|	НачисленияУдержанияПоСотрудникамАвансом.ФизическоеЛицо,
	|	НачисленияУдержанияПоСотрудникамАвансом.Подразделение,
	|	НачисленияУдержанияПоСотрудникамАвансом.ГруппаНачисленияУдержанияВыплаты,
	|	НачисленияУдержанияПоСотрудникамАвансом.НачислениеУдержание,
	|	СУММА(НачисленияУдержанияПоСотрудникамАвансом.Сумма),
	|	НачисленияУдержанияПоСотрудникамАвансом.Организация.ГоловнаяОрганизация,
	|	НачисленияУдержанияПоСотрудникамАвансом.Сотрудник,
	|	НачисленияУдержанияПоСотрудникамАвансом.ДатаНачала,
	|	НачисленияУдержанияПоСотрудникамАвансом.ДатаОкончания,
	|	НачисленияУдержанияПоСотрудникамАвансом.ПериодДействия,
	|	NULL,
	|	НачисленияУдержанияПоСотрудникамАвансом.ИдентификаторСтроки,
	|	ИСТИНА
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникамАвансом КАК НачисленияУдержанияПоСотрудникамАвансом
	|ГДЕ
	|	НачисленияУдержанияПоСотрудникамАвансом.Период МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ) И КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)
	|	И ВЫБОР
	|			КОГДА &ОрганизацииЗаполнены
	|				ТОГДА ВЫБОР
	|					КОГДА &ОрганизацииВСписке = ИСТИНА
	|						ТОГДА НачисленияУдержанияПоСотрудникамАвансом.Организация В (&Организации)
	|					ИНАЧЕ НЕ НачисленияУдержанияПоСотрудникамАвансом.Организация В (&Организации)
	|				КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ФизическиеЛицаЗаполнены
	|				ТОГДА ВЫБОР
	|					КОГДА &ФизическиеЛицаВСписке = ИСТИНА
	|						ТОГДА НачисленияУдержанияПоСотрудникамАвансом.ФизическоеЛицо В (&ФизическиеЛица)
	|					ИНАЧЕ НЕ НачисленияУдержанияПоСотрудникамАвансом.ФизическоеЛицо В (&ФизическиеЛица)
	|				КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ПодразделенияЗаполнены
	|				ТОГДА ВЫБОР
	|					КОГДА &ПодразделенияВСписке = ИСТИНА И &ПодразделенияВИерархии = ЛОЖЬ
	|						ТОГДА НачисленияУдержанияПоСотрудникамАвансом.Подразделение В (&Подразделения)
	|					КОГДА &ПодразделенияВСписке = ЛОЖЬ И &ПодразделенияВИерархии = ЛОЖЬ
	|						ТОГДА НЕ НачисленияУдержанияПоСотрудникамАвансом.Подразделение В (&Подразделения)
	|					КОГДА &ПодразделенияВСписке = ИСТИНА И &ПодразделенияВИерархии = ИСТИНА
	|						ТОГДА НачисленияУдержанияПоСотрудникамАвансом.Подразделение В ИЕРАРХИИ (&Подразделения)
	|					ИНАЧЕ НЕ НачисленияУдержанияПоСотрудникамАвансом.Подразделение В ИЕРАРХИИ (&Подразделения)
	|				КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленияУдержанияПоСотрудникамАвансом.Период,
	|	НачисленияУдержанияПоСотрудникамАвансом.ФизическоеЛицо,
	|	НачисленияУдержанияПоСотрудникамАвансом.Подразделение,
	|	НачисленияУдержанияПоСотрудникамАвансом.ГруппаНачисленияУдержанияВыплаты,
	|	НачисленияУдержанияПоСотрудникамАвансом.НачислениеУдержание,
	|	НачисленияУдержанияПоСотрудникамАвансом.Организация.ГоловнаяОрганизация,
	|	НачисленияУдержанияПоСотрудникамАвансом.Сотрудник,
	|	НачисленияУдержанияПоСотрудникамАвансом.ДатаНачала,
	|	НачисленияУдержанияПоСотрудникамАвансом.ДатаОкончания,
	|	НачисленияУдержанияПоСотрудникамАвансом.ПериодДействия,
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамАвансом.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоСотрудникамАвансом.ИдентификаторСтроки";   
	
	Для Каждого КлючЗнч Из ПараметрыЗапроса Цикл
		ЗапросНачисления.УстановитьПараметр(КлючЗнч.Ключ, КлючЗнч.Значение);
	КонецЦикла;
	// BSLLS:SetPrivilegedMode-off
	// Не работает этот код по другому, нужно эранировать через BSLLS:, инача сонар ругается
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапросаНачисления = ЗапросНачисления.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	// BSLLS:SetPrivilegedMode-on
	Возврат РезультатЗапросаНачисления;
КонецФункции

Функция ПустаяСсылка(ТипСсылки)
	Типы = Новый Массив;
	Типы.Добавить(ТипСсылки);
	ОписаниеТипов = Новый ОписаниеТипов(Типы);
	Возврат ОписаниеТипов.ПривестиЗначение(Неопределено);
КонецФункции

Функция ПараметрыФильтраПоПолю(ПараметрыЗапроса, ИмяПоля, ТипПоля, ЕстьФильтрПоПолю, ВидСравненияПоля)
	ЗначениеРеквизита	= Новый СписокЗначений;
	РеквизитЗаполнен	= Ложь;
	РеквизитВСписке		= Истина;
	РеквизитВИерархии = Ложь;
	
	Если ЕстьФильтрПоПолю Тогда
		
		Если ТипЗнч(ПараметрыЗапроса[ИмяПоля]) = ТипПоля Тогда
			Если НЕ ПараметрыЗапроса[ИмяПоля] = ПустаяСсылка(ТипПоля) Тогда
				ЗначениеРеквизита.Добавить(ПараметрыЗапроса[ИмяПоля]);
				РеквизитЗаполнен = Истина;	
			КонецЕсли;
		Иначе
			Если ТипЗнч(ПараметрыЗапроса[ИмяПоля]) = Тип("СписокЗначений") Тогда 
				ЗначениеРеквизита = ПараметрыЗапроса[ИмяПоля];
				РеквизитЗаполнен = ПараметрыЗапроса[ИмяПоля].Количество() > 0;
			КонецЕсли;
		КонецЕсли;
		
		РеквизитВСписке = НЕ (ВидСравненияПоля = ВидСравненияКомпоновкиДанных.НеРавно
			ИЛИ ВидСравненияПоля = ВидСравненияКомпоновкиДанных.НеВИерархии
			ИЛИ ВидСравненияПоля = ВидСравненияКомпоновкиДанных.НеВСписке
			ИЛИ ВидСравненияПоля = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии
			ИЛИ ВидСравненияПоля = ВидСравненияКомпоновкиДанных.НеЗаполнено);
				
		РеквизитВИерархии = (ВидСравненияПоля = ВидСравненияКомпоновкиДанных.ВИерархии
			ИЛИ ВидСравненияПоля = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии
			ИЛИ ВидСравненияПоля = ВидСравненияКомпоновкиДанных.НеВИерархии
			ИЛИ ВидСравненияПоля = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ЗначениеРеквизита", ЗначениеРеквизита);
	Результат.Вставить("РеквизитЗаполнен", РеквизитЗаполнен);
	Результат.Вставить("РеквизитВСписке", РеквизитВСписке);
	Результат.Вставить("РеквизитВИерархии", РеквизитВИерархии); 
		
	Возврат Результат;	
КонецФункции

Функция ВсеСотрудникиКЭДО(ТолькоСотрудникиКЭДО)
	Если НЕ ТолькоСотрудникиКЭДО Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДопСвойствоКЭДО = МодульCore().НайтиСвойствоПоИмени("КЭДО");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеСведения.Объект КАК Объект
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Свойство = &Свойство
		|	И ДополнительныеСведения.Значение = ИСТИНА";
	
	Запрос.УстановитьПараметр("Свойство", ДопСвойствоКЭДО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

Функция ПодготовитьДанныеПрочийКадровыйРасчетныйЛисток(ПараметрыЗапроса) Экспорт
	ПараметрыВызова = Новый Массив;	
	
	ФизическиеЛица 			= Новый СписокЗначений;
	ФизическиеЛицаЗаполнены = Ложь; 
	ФизическиеЛицаВСписке	= Истина;
	Организации 			= Новый СписокЗначений;
	ОрганизацииЗаполнены 	= Ложь;
	ОрганизацииВСписке		= Истина;
	Подразделения 			= Новый СписокЗначений;
	ПодразделенияЗаполнены 	= Ложь;
	ПодразделенияВСписке 	= Истина;
	
	РезультатЗнчФильтра = ПараметрыФильтраПоПолю(
		ПараметрыЗапроса,
		"ФизическиеЛица", 
		Тип("СправочникСсылка.ФизическиеЛица"),
		ПараметрыЗапроса.ЕстьФильтрПоФизическимЛицам,
		ПараметрыЗапроса.ВидСравненияФизическиеЛица);
	ФизическиеЛица = РезультатЗнчФильтра.ЗначениеРеквизита;
	ФизическиеЛицаЗаполнены = РезультатЗнчФильтра.РеквизитЗаполнен;
	ФизическиеЛицаВСписке = РезультатЗнчФильтра.РеквизитВСписке;

	РезультатЗнчФильтра = ПараметрыФильтраПоПолю(
		ПараметрыЗапроса,
		"Организация", 
		Тип("СправочникСсылка.Организации"),
		ПараметрыЗапроса.ЕстьФильтрПоОрганизации,
		ПараметрыЗапроса.ВидСравненияОрганизация);
	Организации = РезультатЗнчФильтра.ЗначениеРеквизита;
	ОрганизацииЗаполнены = РезультатЗнчФильтра.РеквизитЗаполнен;
	ОрганизацииВСписке = РезультатЗнчФильтра.РеквизитВСписке;
	
	РезультатЗнчФильтра = ПараметрыФильтраПоПолю(
		ПараметрыЗапроса,
		"Подразделения", 
		Тип("СправочникСсылка.ПодразделенияОрганизаций"),
		ПараметрыЗапроса.ЕстьФильтрПоПодразделениям,
		ПараметрыЗапроса.ВидСравненияПодразделения);
	Подразделения = РезультатЗнчФильтра.ЗначениеРеквизита;
	ПодразделенияЗаполнены = РезультатЗнчФильтра.РеквизитЗаполнен;
	ПодразделенияВСписке = РезультатЗнчФильтра.РеквизитВСписке;
	ПодразделениеВИерархии = РезультатЗнчФильтра.РеквизитВИерархии;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КадроваяИсторияСотрудниковИнтервальный.ФизическоеЛицо КАК ФизическоеЛицо,
	|	КадроваяИсторияСотрудниковИнтервальный.Организация КАК Организация,
	|	КадроваяИсторияСотрудниковИнтервальный.Подразделение КАК Подразделение,
	|	КадроваяИсторияСотрудниковИнтервальный.Сотрудник КАК Сотрудник,
	|	КадроваяИсторияСотрудниковИнтервальный.ГоловнаяОрганизация КАК ГоловнаяОрганизация
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудниковИнтервальный КАК КадроваяИсторияСотрудниковИнтервальный
	|ГДЕ
	|	КадроваяИсторияСотрудниковИнтервальный.ДатаОкончания >= &НачалоПериода
	|	И КадроваяИсторияСотрудниковИнтервальный.ДатаНачала <= &КонецПериода
	|	И ВЫБОР
	|			КОГДА &ФизическиеЛицаЗаполнены = ЛОЖЬ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВЫБОР
	|					КОГДА &ФизическиеЛицаВСписке = ИСТИНА
	|						ТОГДА КадроваяИсторияСотрудниковИнтервальный.ФизическоеЛицо В (&ФизическиеЛица)
	|					ИНАЧЕ НЕ КадроваяИсторияСотрудниковИнтервальный.ФизическоеЛицо В (&ФизическиеЛица)
	|				КОНЕЦ
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОрганизацииЗаполнены = ЛОЖЬ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВЫБОР
	|					КОГДА &ОрганизацииВСписке = ИСТИНА
	|						ТОГДА КадроваяИсторияСотрудниковИнтервальный.Организация В (&Организации)
	|					ИНАЧЕ НЕ КадроваяИсторияСотрудниковИнтервальный.Организация В (&Организации)
	|				КОНЕЦ
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ПодразделенияЗаполнены = ЛОЖЬ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВЫБОР
	|				КОГДА &ПодразделенияВСписке = ИСТИНА И &ПодразделенияВИерархии = ЛОЖЬ
	|					ТОГДА КадроваяИсторияСотрудниковИнтервальный.Подразделение В (&Подразделения)
	|				КОГДА &ПодразделенияВСписке = ЛОЖЬ И &ПодразделенияВИерархии = ЛОЖЬ
	|					ТОГДА НЕ КадроваяИсторияСотрудниковИнтервальный.Подразделение В (&Подразделения)
	|				КОГДА &ПодразделенияВСписке = ИСТИНА И &ПодразделенияВИерархии = ИСТИНА
	|					ТОГДА КадроваяИсторияСотрудниковИнтервальный.Подразделение В ИЕРАРХИИ (&Подразделения)
	|				ИНАЧЕ НЕ КадроваяИсторияСотрудниковИнтервальный.Подразделение В ИЕРАРХИИ (&Подразделения)
	|			КОНЕЦ
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ТолькоСотрудникиКЭДО = ИСТИНА
	|				ТОГДА КадроваяИсторияСотрудниковИнтервальный.Сотрудник В (&СотрудникиКЭДО)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НЕ КадроваяИсторияСотрудниковИнтервальный.Сотрудник.ПометкаУдаления
	|    И КадроваяИсторияСотрудниковИнтервальный.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
	|
	|УПОРЯДОЧИТЬ ПО
	|	КадроваяИсторияСотрудниковИнтервальный.ДатаОкончания УБЫВ
	|ИТОГИ
	|	МАКСИМУМ(ГоловнаяОрганизация)
	|ПО
	|	ФизическоеЛицо";
	
	СотрудникиКЭДО = ВсеСотрудникиКЭДО(ПараметрыЗапроса.ТолькоСотрудникиКЭДО);

	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("ФизическиеЛица", ФизическиеЛица);
	ДопПараметры.Вставить("ФизическиеЛицаЗаполнены", ФизическиеЛицаЗаполнены);
	ДопПараметры.Вставить("ФизическиеЛицаВСписке", ФизическиеЛицаВСписке);
	ДопПараметры.Вставить("Организации", Организации);
	ДопПараметры.Вставить("ОрганизацииЗаполнены", ОрганизацииЗаполнены);
	ДопПараметры.Вставить("ОрганизацииВСписке", ОрганизацииВСписке);
	ДопПараметры.Вставить("Подразделения", Подразделения);
	ДопПараметры.Вставить("ПодразделенияЗаполнены", ПодразделенияЗаполнены);
	ДопПараметры.Вставить("ПодразделенияВСписке", ПодразделенияВСписке);
	ДопПараметры.Вставить("ТолькоСотрудникиКЭДО", ПараметрыЗапроса.ТолькоСотрудникиКЭДО);
	ДопПараметры.Вставить("СотрудникиКЭДО", СотрудникиКЭДО);
	ДопПараметры.Вставить("ПодразделенияВИерархии", ПодразделениеВИерархии);
	
	Для Каждого ЗнчКлюч Из ДопПараметры Цикл
		Запрос.УстановитьПараметр(ЗнчКлюч.Ключ, ЗнчКлюч.Значение);
	КонецЦикла;
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыЗапроса.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ПараметрыЗапроса.КонецПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаСотрудники = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Попытка
		ПараметрыВызова = Новый Массив;	
		КлючВарианта = ПараметрыЗапроса.КлючВарианта;
		ВариантОтчета = ВариантыОтчетов.ВариантОтчета(
			ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Отчет." + ПараметрыЗапроса.Отчет),
			КлючВарианта);
		СтруктураПользовательскихНастроек = Новый Структура;	
		// Вариант
		Если КлючВарианта <> "РасчетныйЛисток" И КлючВарианта <> "РасчетныйЛистокПерваяПоловинаМесяца" Тогда		
			Если ПараметрыЗапроса.Отчет = "АнализНачисленийИУдержанийАвансом" Тогда
				ОтчетОбъектРЛ = Отчеты.АнализНачисленийИУдержанийАвансом.Создать();
				ОтчетОбъектРЛ.ИнициализироватьОтчет(КлючВарианта);           
				СхемаКомпоновкиДанных = Отчеты.АнализНачисленийИУдержанийАвансом.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
			ИначеЕсли ПараметрыЗапроса.Отчет = "АнализНачисленийИУдержаний" Тогда	
				ОтчетОбъектРЛ = Отчеты.АнализНачисленийИУдержаний.Создать();
				ОтчетОбъектРЛ.ИнициализироватьОтчет(КлючВарианта);           
				СхемаКомпоновкиДанных = Отчеты.АнализНачисленийИУдержаний.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
			Иначе
				ВызватьИсключение "В параметрах отсутствует наименование отчета";
			КонецЕсли;
			КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
			КомпоновщикНастроекКомпоновкиДанных.Инициализировать(
				Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
			КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
			КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьПользовательскиеНастройки(
				ОтчетОбъектРЛ.КомпоновщикНастроек.ПользовательскиеНастройки);
			КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(ВариантОтчета.Настройки.Получить());
			ОтчетОбъектРЛ.КомпоновщикНастроек.ЗагрузитьНастройки(ВариантОтчета.Настройки.Получить());
			СтруктураПользовательскихНастроек.Вставить("ОтчетОбъектРЛ", ОтчетОбъектРЛ);
			СтруктураПользовательскихНастроек.Вставить("СхемаКомпоновкиДанных", СхемаКомпоновкиДанных);
			СтруктураПользовательскихНастроек.Вставить("КомпоновщикНастроекКомпоновкиДанных", КомпоновщикНастроекКомпоновкиДанных);
		КонецЕсли;
		
		// Вариант
		ЗаписьЖурналаРегистрации(
			ЛокализацияНазваниеПродукта() + ".Подготовка к выгрузке расчетных листков",
			УровеньЖурналаРегистрации.Информация,
			, // ОбъектМетаданных - ссылка на элемент справичника или документ
			"Расчетных листков к подготовке: " + ВыборкаСотрудники.Количество());

		ОтчетОВыполнении = Новый Структура;  
		ОтчетОВыполнении.Вставить("Успешно", 0);
		ОтчетОВыполнении.Вставить("НетНачислений", 0);
		ОтчетОВыполнении.Вставить("ОшибкаЗагрузкиВложений", 0);
		ОтчетОВыполнении.Вставить("ПустойОтчет", 0);
		ОтчетОВыполнении.Вставить("НетНачисленийСотрудники", Новый Массив);
		ОтчетОВыполнении.Вставить("ПустойОтчетСотрудники", Новый Массив);
		ОтчетОВыполнении.Вставить("ОшибкаЗагрузкиВложенийСотрудники", Новый Массив);

		РезультатЗапросаНачисления = ДанныеНачисленийПоСотрудникам(Запрос.Параметры);
		ТЗ_Начисления = РезультатЗапросаНачисления.Выгрузить();
		Пока ВыборкаСотрудники.Следующий() Цикл
			
			ОтборСтрок = Новый Структура();
			ОтборСтрок.Вставить("ФизическоеЛицо", ВыборкаСотрудники.ФизическоеЛицо);
			ОтборСтрок.Вставить("Организация", ВыборкаСотрудники.ГоловнаяОрганизация);
			ДанныеПоНачислениям = ТЗ_Начисления.НайтиСтроки(ОтборСтрок);
			Если ДанныеПоНачислениям.Количество() > 0 Тогда
				ДопПараметры.Вставить("КлючВарианта", КлючВарианта);
				КадровыйРасчетныйЛистокОбработкаРезультатаЗапроса(
					ВыборкаСотрудники,
					ПараметрыЗапроса,
					ПараметрыВызова,
					ВариантОтчета,
					СтруктураПользовательскихНастроек,
					ДопПараметры,
					ОтчетОВыполнении);
			Иначе
				ОтчетОВыполнении.НетНачислений = ОтчетОВыполнении.НетНачислений + 1;
				ОтчетОВыполнении.НетНачисленийСотрудники.Добавить(Строка(ВыборкаСотрудники.ФизическоеЛицо));
			КонецЕсли;
			
		КонецЦикла;
	Исключение
		ИнфоОбОшибке	= ИнформацияОбОшибке();
		СтруктураОшибки	= МодульCore().ExtExceptionAnalyse(ИнфоОбОшибке);
		МодульCore().ExtExceptionToJournal(СтруктураОшибки);
	КонецПопытки;	
	
	ОтчетОВыполнении.НетНачисленийСотрудники = СтрСоединить(ОтчетОВыполнении.НетНачисленийСотрудники, " ,");
	ОтчетОВыполнении.ПустойОтчетСотрудники = СтрСоединить(ОтчетОВыполнении.ПустойОтчетСотрудники, " ,");
	ОтчетОВыполнении.ОшибкаЗагрузкиВложенийСотрудники = СтрСоединить(ОтчетОВыполнении.ОшибкаЗагрузкиВложенийСотрудники, " ,");
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, ОтчетОВыполнении, НазначениеТипаXML.Явное);
	Данные = ЗаписьXML.Закрыть();
	ЗаписьЖурналаРегистрации(
			ЛокализацияНазваниеПродукта() + ".Начало загрузки расчетных листков",
			УровеньЖурналаРегистрации.Информация,
			, // ОбъектМетаданных - ссылка на элемент справичника или документ
			Данные);
	
	ПараметрыВызоваИни = Новый Соответствие;
	ПараметрыВызоваИни.Вставить("list_doc_ref", ПараметрыВызова);
	Возврат ПараметрыВызоваИни;
КонецФункции
