&НаКлиенте
// BSLLS:ExportVariables-off
Перем ТранспортИнтеграции, BlocklyExecutor  Экспорт;
// BSLLS:ExportVariables-on

Функция ЭлементСобытияПоляHTML(ДанныеСобытия)
	Возврат ДанныеСобытия.Element;
КонецФункции

&НаКлиенте
Процедура ПолеHTMLдокументаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	Ссылка = get_prop(ДанныеСобытия, "Href");
	Если Ссылка <> Неопределено Тогда 
		СтандартнаяОбработка = Ложь;
		// BSLLS:UsingSynchronousCalls-off
		#Если ВебКлиент Тогда
			ПерейтиПоНавигационнойСсылке(Ссылка);
		#Иначе	
			ЗапуститьПриложение(Ссылка);
		#КонецЕсли	
		// BSLLS:UsingSynchronousCalls-on
	КонецЕсли;		
КонецПроцедуры

&НаСервере
Процедура ПриНачалеРаботыПриИзмененииНаСервере()
	ПользовательскиеПараметры = МодульОбъекта().НастройкиПодключенияПрочитать();
	ПользовательскиеПараметры.Вставить("ОтображатьИнформационноеОкно", ПриНачалеРаботы);
	МодульОбъекта().НастройкиПодключенияЗаписать(ПользовательскиеПараметры);

КонецПроцедуры

&НаКлиенте
Процедура ПриНачалеРаботыПриИзменении(Элемент)
	ПриНачалеРаботыПриИзмененииНаСервере();
КонецПроцедуры

Функция ТекстСообщенияНовоеРасширениеСЭДО(version_info, Отказ) 
	МодульОбъекта = МодульОбъекта();
	МодульОбновлениеИнформационнойБазы = МодульОбъекта.ОбщийМодульЗначение("ОбновлениеИнформационнойБазы"); 
	// BSLLS:SetPrivilegedMode-off Необходимо прочитать версии подсистем
	УстановитьПривилегированныйРежим(Истина);
	ВерсииПодсистем = МодульОбновлениеИнформационнойБазы.ВерсииПодсистем();
	УстановитьПривилегированныйРежим(Ложь);
	// BSLLS:SetPrivilegedMode-on
	СтрокаТЗ = ВерсииПодсистем.Найти("ЗарплатаКадрыБазовая", "ИмяПодсистемы");
	V_Sedo = "v2";
	Если СтрокаТЗ <> Неопределено Тогда
		ВерсияПодсистемы = СтрокаТЗ.Версия;
		ВерсияПодсистемыЧисло = Число(МодульОбъекта.ПреобразоватьВерсию(ВерсияПодсистемы));
		Версия28 = 3000100280012;
		Версия27 = 3000100270113;
		Версия27Последняя = 3000100279999;
		Если ВерсияПодсистемыЧисло >= Версия28 
			ИЛИ ВерсияПодсистемыЧисло >= Версия27 И ВерсияПодсистемыЧисло <= Версия27Последняя Тогда
			V_Sedo = "v2";
		Иначе 
			V_Sedo = "v1";
		КонецЕсли; 
	КонецЕсли;

	Если get_prop(version_info, "ЭтоFresh") = Истина Тогда
		V_Sedo = V_Sedo + "_FRESH";	
	КонецЕсли;	
	ОбработкаSABY = Обработки[ИмяОбработки()];
	Макет = ОбработкаSABY.ПолучитьМакет("НовоеРасширениеSEDO");
	ТекстМакета = Макет.ПолучитьТекст();
    ПолныйURL = get_prop(version_info, "current_version_link") + "/SABY_СЭДО" + V_Sedo + ".cfe";
	ТекстМакета = СтрЗаменить(ТекстМакета, "%SEDO_Version%", ПолныйURL);
	Возврат ТекстМакета;
КонецФункции 

&НаКлиенте
Процедура ДобавитьСообщениеОПереходеНаНовоеРасширениеСЭДОНаКлиенте(МассивСообщений)
	ПродуктSEDO = "ce_1c_sedo";
	Попытка
		version_info = ТранспортИнтеграции.local_helper_get_product_version_status(ЭтаФорма.context_params, ПродуктSEDO, "00.0000.000");
		#Если ВебКлиент Тогда 
			version_info.Вставить("ЭтоFresh", Истина);	
		#КонецЕсли	
		СообщениеОПереходеНаНовоеРасширениеСЭДО = СообщениеОПереходеНаНовоеРасширениеСЭДО(version_info);
		Если СообщениеОПереходеНаНовоеРасширениеСЭДО <> Неопределено Тогда
			МассивСообщений.Добавить(СообщениеОПереходеНаНовоеРасширениеСЭДО);
		КонецЕсли;	
	Исключение
    	Возврат;	
	КонецПопытки;	
КонецПроцедуры	

Функция СообщениеОПереходеНаНовоеРасширениеСЭДО(Знач version_info)
	Отображать = Истина;
	
	ИмяКонстантыИспользоватьЭЛН = ПрефиксПродукта() + "ИспользоватьЭЛН";
	ИспользоватьЭЛН = Ложь;
	Если Метаданные.Константы.Найти(ИмяКонстантыИспользоватьЭЛН) <> Неопределено Тогда
		ИспользоватьЭЛН = Константы[ИмяКонстантыИспользоватьЭЛН].Получить();
	КонецЕсли; 
	Отображать = ИспользоватьЭЛН;
	Если Отображать = Ложь Тогда
		Возврат Неопределено;
	КонецЕсли;   
	Отбор = Новый Структура;
	Отбор.Вставить("Имя", "SEDO");
	РасширенияSEDO = РасширенияКонфигурации.Получить(Отбор);
	Для Каждого ЗаписьРасширение Из РасширенияSEDO Цикл  
		Если ЗаписьРасширение.Активно = Истина Тогда 
			Возврат Неопределено;
		КонецЕсли;	
	КонецЦикла; 
	Отказ = Ложь;
	ИнформационноеСообщение = Новый Структура;
	ИнформационноеСообщение.Вставить("ОткрыватьВНовомОкне", Истина);
	ИнформационноеСообщение.Вставить("ЗаголовокОкна", "Важные изменения в расширении Saby");
	ИнформационноеСообщение.Вставить("ТекстСообщения", ТекстСообщенияНовоеРасширениеСЭДО(version_info, Отказ));
	Если Отказ Тогда   
		ИнформационноеСообщение = Неопределено;
	КонецЕсли;	
	Возврат ИнформационноеСообщение;
КонецФункции 
 
&НаКлиенте
Функция СписокИнформационныхСообщений()
	МассивСообщений = Новый Массив;
	ДобавитьСообщениеОПереходеНаНовоеРасширениеСЭДОНаКлиенте(МассивСообщений);	
	Возврат МассивСообщений;
КонецФункции 

&НаКлиенте
Процедура ОтобразитьСообщение(ИнформационноеСообщение)
	ЭтаФорма.Заголовок = get_prop(ИнформационноеСообщение, "ЗаголовокОкна", "");
	ЭтаФорма.ПолеHTML = get_prop(ИнформационноеСообщение, "ТекстСообщения", "");
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.ПриНачалеРаботы = Истина; 
	ТранспортИнтеграции = ПолучитьФормуТранспорта(ЭтаФорма.context_params);
	Если ЗначениеЗаполнено(ИнформационноеСообщение) Тогда
		ОтобразитьСообщение(ИнформационноеСообщение);
		Возврат;
	КонецЕсли;
	ИнформационныйСписок = СписокИнформационныхСообщений();
	Если ИнформационныйСписок.Количество() = 0 Тогда 
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	НетСообщений = Истина; 
	Для Каждого ЗаписьСообщение Из ИнформационныйСписок Цикл 
		ОткрыватьВНовомОкне = get_prop(ЗаписьСообщение, "ОткрыватьВНовомОкне", Ложь);
		Если ОткрыватьВНовомОкне Тогда   
			ПараметрыИнформационногоОкна = Новый Структура;
			ПараметрыИнформационногоОкна.Вставить("ИнформационноеСообщение", ЗаписьСообщение); 
			ОткрытьФормуОбработки("ИнформационноеОкно", ПараметрыИнформационногоОкна, ВладелецФормы, Новый УникальныйИдентификатор);
		КонецЕсли;	
	КонецЦикла;
	Если НетСообщений Тогда
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	context_params = МодульОбъекта().НастройкиПодключенияПрочитать();
    ОтображатьИнформационноеОкно = get_prop(context_params, "ОтображатьИнформационноеОкно", Истина);
	Если ОтображатьИнформационноеОкно = Ложь Тогда 
		Отказ = Истина; 
		Возврат;
	КонецЕсли;	
	ЭтаФорма.ИнформационноеСообщение = get_prop(Параметры, "ИнформационноеСообщение", Неопределено);		
КонецПроцедуры

#Область include_core_base_Helpers_ПрефиксПродукта
#КонецОбласти

#Область include_core_base_Helpers_FormGetters
#КонецОбласти

#Область include_base_ИмяОбработки
#КонецОбласти

#Область include_core_base_Helpers_РаботаСоСвойствамиСтруктуры //&НаКлиентеНаСервереБезКонтекста
#КонецОбласти
