
Функция _ТолькоКомпенсация(Объект)
	Возврат Объект.ПредоставитьКомпенсациюОсновногоОтпуска
		И Не Объект.ПредоставитьОсновнойОтпуск И Не Объект.ПредоставитьДополнительныйОтпуск
		Или (Не Объект.ПредоставитьОсновнойОтпуск И Объект.ПредоставитьДополнительныйОтпуск 
		И Объект.ДополнительныеОтпуска.Итог("КоличествоДней") = 0
		И Объект.ДополнительныеОтпуска.Итог("КоличествоДнейКомпенсации") > 0);
КонецФункции

Процедура Saby_ЗаписьДокументаСоСреднимЗаработкомПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	// Поцедура - заглушка
КонецПроцедуры
