
Функция _ТолькоКомпенсация(Объект)
	ОбъектМетаданные = Объект.Метаданные();
	// BSLLS:Typo-off
	// Сонар говорит - Опечатка
	Рекв1 = ОбщегоНазначения.ЕстьРеквизитОбъекта("ПредоставитьКомпенсациюОсновногоОтпуска", ОбъектМетаданные);
	Рекв2 = ОбщегоНазначения.ЕстьРеквизитОбъекта("ПредоставитьОсновнойОтпуск", ОбъектМетаданные);
	Рекв3 = ОбщегоНазначения.ЕстьРеквизитОбъекта("ПредоставитьДополнительныйОтпуск", ОбъектМетаданные);
	// BSLLS:Typo-on
	Если НЕ (Рекв1 И Рекв2 И Рекв3) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Объект.ПредоставитьКомпенсациюОсновногоОтпуска
		И Не Объект.ПредоставитьОсновнойОтпуск И Не Объект.ПредоставитьДополнительныйОтпуск
		Или (Не Объект.ПредоставитьОсновнойОтпуск И Объект.ПредоставитьДополнительныйОтпуск 
		И Объект.ДополнительныеОтпуска.Итог("КоличествоДней") = 0
		И Объект.ДополнительныеОтпуска.Итог("КоличествоДнейКомпенсации") > 0);
КонецФункции

Процедура Saby_ЗаписьДокументаСоСреднимЗаработкомПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	ДокументНеСоответствуетПараметрамРасчетаСрЗаработка = НЕ Источник.ДополнительныеСвойства.Свойство("ЗаписьОбновлениеДокумента") 
		ИЛИ Источник.ОбменДанными.Загрузка
		ИЛИ НЕ ОбщегоНазначения.ЕстьРеквизитОбъекта("СреднийЗаработок",  Источник.Метаданные())
		ИЛИ Источник.СреднийЗаработок <> 0;
	Если ДокументНеСоответствуетПараметрамРасчетаСрЗаработка Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ВидРасчета", Источник.Метаданные()) Тогда
			ВидРасчета = Источник.ВидРасчета;
		Иначе
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ВидРасчетаОсновногоОтпуска", Источник.Метаданные()) Тогда
				ВидРасчета = Источник.ВидРасчетаОсновногоОтпуска;
			КонецЕсли;
		КонецЕсли;
		Если _ТолькоКомпенсация(Источник) Тогда
			ВидРасчета = Источник.ВидРасчетаКомпенсацииОсновногоОтпуска;
		КонецЕсли;
		ПериодРасчетаСреднего = УчетСреднегоЗаработка.ПериодРасчетаОбщегоСреднегоЗаработкаСотрудника(
			Источник.ДатаНачалаСобытия,
			Источник.Сотрудник,
			ВидРасчета);
		Источник.ПериодРасчетаСреднегоЗаработкаНачало		= ПериодРасчетаСреднего.ДатаНачала;
		Источник.ПериодРасчетаСреднегоЗаработкаОкончание 	= ПериодРасчетаСреднего.ДатаОкончания;

		ДополнительныеПараметры = УчетСреднегоЗаработкаКлиентСервер.ДополнительныеПараметрыРасчетаСреднегоЗаработка();
		СотрудникиДляРасчета = Новый Массив;
		СотрудникиДляРасчета.Добавить(Источник.Сотрудник);
		СпособыРасчетаОтпусковСотрудников = ОстаткиОтпусков.СпособыРасчетаОтпусковСотрудников(
			СотрудникиДляРасчета,
			КонецМесяца(Источник.ДатаНачалаСобытия));
		ДополнительныеПараметры.СпособРасчетаОтпуска = СпособыРасчетаОтпусковСотрудников[Источник.Сотрудник];
		Источник.СреднийЗаработок = УчетСреднегоЗаработка.СреднийЗаработок(
			Источник.Сотрудник,
			Источник.ДатаНачалаСобытия,
			ДополнительныеПараметры);
	Исключение
		ИнфоОбОшибке	= ИнформацияОбОшибке();
		СтруктураОшибки	= Saby_Core.ExtExceptionAnalyse(ИнфоОбОшибке);
		Saby_Core.ExtExceptionToJournal(СтруктураОшибки);
	КонецПопытки;
КонецПроцедуры
