
Функция Saby_kedo_ПриСозданииНаСервере_КЭДО(Форма)
	Команды = Новый Массив;
	Если Форма.ИмяФормы = "Отчет.АнализНачисленийИУдержаний.Форма" Тогда
		// Это Форма отчёта "расчётный листок"
		Команда = Форма.Команды.Добавить("Saby_КЭДО_ОтправитьРасчетныйЛистокВСбис");
	    Команда.Действие  = "ОтправитьРасчетныйЛистокВСБИС";
	    Команда.Заголовок = НСтр("ru = 'Загрузить данные в "+ЛокализацияНазваниеПродукта()+"'");
		Команды.Добавить(Команда);
		
		Команда = Форма.Команды.Добавить("Saby_КЭДО_ОтправитьСокращенныйРасчетныйЛистокВСбис");
		Команда.Действие  = "ОтправитьСокращенныйРасчетныйЛистокВСБИС";
		Команда.Заголовок = НСтр("ru = 'Загрузить сокращенные данные в "+ЛокализацияНазваниеПродукта()+"'");
		Команды.Добавить(Команда);

		Команда = Форма.Команды.Добавить("Saby_КЭДО_ОтправитьПрочийКадровыйРасчетныйЛистокВСбис");
		Команда.Действие  = "ОтправитьПрочийКадровыйРасчетныйЛистокВСБИС";
		Команда.Заголовок = НСтр("ru = 'Загрузить вложения в "+ЛокализацияНазваниеПродукта()+"'");
		Команды.Добавить(Команда);
	ИначеЕсли Форма.ИмяФормы = "Отчет.ОстаткиОтпусков.Форма" Тогда 
		Команда = Форма.Команды.Добавить("Saby_КЭДО_ЗагрузитьДанныеВSABY");
	    Команда.Действие  = "ЗагрузитьДанныеВSABY";
	    Команда.Заголовок = НСтр("ru = 'Загрузить данные в "+ЛокализацияНазваниеПродукта()+"'");
		Команды.Добавить(Команда);
		
		// Команда = Форма.Команды.Добавить("Saby_КЭДО_ЗагрузитьВложенияВSABY");
		// Команда.Действие  = "ЗагрузитьВложенияВSABY";
		// Команда.Заголовок = НСтр("ru = 'Загрузить вложения в "+ЛокализацияНазваниеПродукта()+"'");
		// Команды.Добавить(Команда);
	Иначе
		// Заглушка для иначе
	КонецЕсли;
	
	Возврат Команды;
КонецФункции

