
Функция КомандаПользовательскогоИнтерфейса(КомандыФормы, ИмяКоманды, ДействиеКоманды, ЗаголовокКоманды)
	Команда = КомандыФормы.Добавить(ИмяКоманды);
    Команда.Действие  = ДействиеКоманды;
    Команда.Заголовок = ЗаголовокКоманды;
	Возврат Команда;
КонецФункции

Функция Saby_kedo_ПриСозданииНаСервере_КЭДО(Форма)
	Команды = Новый Массив;
	
	Если Форма.ИмяФормы = "Отчет.АнализНачисленийИУдержаний.Форма" Тогда
		// Это Форма отчёта "расчётный листок"                          
		Если НЕ Форма.КлючТекущегоВарианта = "Т51" Тогда
			// расчетная ведомость, отдельный отчет
			Команда = КомандаПользовательскогоИнтерфейса(
				Форма.Команды,
				"Saby_КЭДО_ОтправитьРасчетныйЛистокВСбис",
		    	"ОтправитьРасчетныйЛистокВСБИС",
		    	НСтр("ru = 'Загрузить данные в " + ЛокализацияНазваниеПродукта() + "'"));
			Команды.Добавить(Команда);
			
			Команда = КомандаПользовательскогоИнтерфейса(
				Форма.Команды,
				"Saby_КЭДО_ОтправитьСокращенныйРасчетныйЛистокВСбис",
				"ОтправитьСокращенныйРасчетныйЛистокВСБИС",
				НСтр("ru = 'Загрузить сокращенные данные в " + ЛокализацияНазваниеПродукта() + "'"));
			Команды.Добавить(Команда);

			Команда = КомандаПользовательскогоИнтерфейса(
				Форма.Команды,
				"Saby_КЭДО_ОтправитьПрочийКадровыйРасчетныйЛистокВСбис",
				"ОтправитьПрочийКадровыйРасчетныйЛистокВСБИС",
				НСтр("ru = 'Загрузить вложения в " + ЛокализацияНазваниеПродукта() + "'"));
			Команды.Добавить(Команда);
		КонецЕсли;
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Отчет.ОстаткиОтпусков.Форма" Тогда 
		Команда = КомандаПользовательскогоИнтерфейса(
			Форма.Команды,
			"Saby_КЭДО_ЗагрузитьДанныеВSABY",
	    	"ЗагрузитьДанныеВSABY",
	    	НСтр("ru = 'Загрузить данные в " + ЛокализацияНазваниеПродукта() + "'"));
		Команды.Добавить(Команда);
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Отчет.АнализНачисленийИУдержанийАвансом.Форма" Тогда
		Если НЕ Форма.КлючТекущегоВарианта = "Т51ПерваяПоловинаМесяца" Тогда // расчетная ведомость, отдельный отчет
			Команда = КомандаПользовательскогоИнтерфейса(
				Форма.Команды,
				"Saby_КЭДО_ОтправитьПрочийКадровыйРасчетныйЛистокВСбис",
				"ОтправитьПрочийКадровыйРасчетныйЛистокВСБИС",
				НСтр("ru = 'Загрузить вложения в " + ЛокализацияНазваниеПродукта() + "'"));
			Команды.Добавить(Команда);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Команды;
КонецФункции
