
Функция Saby_kedo_ПриСозданииНаСервере_КЭДО(Форма)
	Команды = Новый Массив;
	
	Если Форма.ИмяФормы = "Отчет.АнализНачисленийИУдержаний.Форма" Тогда
		// Это Форма отчёта "расчётный листок"                          
		Если НЕ Форма.КлючТекущегоВарианта = "Т51" Тогда // расчетная ведомость, отдельный отчет
			Команда = Форма.Команды.Добавить("Saby_КЭДО_ОтправитьРасчетныйЛистокВСбис");
		    Команда.Действие  = "ОтправитьРасчетныйЛистокВСБИС";
		    Команда.Заголовок = НСтр("ru = 'Загрузить данные в " + ЛокализацияНазваниеПродукта() + "'");
			Команды.Добавить(Команда);
			
			Команда = Форма.Команды.Добавить("Saby_КЭДО_ОтправитьСокращенныйРасчетныйЛистокВСбис");
			Команда.Действие  = "ОтправитьСокращенныйРасчетныйЛистокВСБИС";
			Команда.Заголовок = НСтр("ru = 'Загрузить сокращенные данные в " + ЛокализацияНазваниеПродукта() + "'");
			Команды.Добавить(Команда);

			Команда = Форма.Команды.Добавить("Saby_КЭДО_ОтправитьПрочийКадровыйРасчетныйЛистокВСбис");
			Команда.Действие  = "ОтправитьПрочийКадровыйРасчетныйЛистокВСБИС";
			Команда.Заголовок = НСтр("ru = 'Загрузить вложения в " + ЛокализацияНазваниеПродукта() + "'");
			Команды.Добавить(Команда);
		КонецЕсли;
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Отчет.ОстаткиОтпусков.Форма" Тогда 
		Команда = Форма.Команды.Добавить("Saby_КЭДО_ЗагрузитьДанныеВSABY");
	    Команда.Действие  = "ЗагрузитьДанныеВSABY";
	    Команда.Заголовок = НСтр("ru = 'Загрузить данные в " + ЛокализацияНазваниеПродукта() + "'");
		Команды.Добавить(Команда);
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Отчет.АнализНачисленийИУдержанийАвансом.Форма" Тогда
		Если НЕ Форма.КлючТекущегоВарианта = "Т51ПерваяПоловинаМесяца" Тогда // расчетная ведомость, отдельный отчет
			Команда = Форма.Команды.Добавить("Saby_КЭДО_ОтправитьПрочийКадровыйРасчетныйЛистокВСбис");
			Команда.Действие  = "ОтправитьПрочийКадровыйРасчетныйЛистокВСБИС";
			Команда.Заголовок = НСтр("ru = 'Загрузить вложения в " + ЛокализацияНазваниеПродукта() + "'");
			Команды.Добавить(Команда);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Команды;
КонецФункции
