Процедура ЗаполнитьЗначенияПериода(КомпоновщикНастроек, ПараметрыВызова)
	Для Каждого ПараметрДанных Из КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		Если ПараметрДанных.Параметр = 
			Новый ПараметрКомпоновкиДанных("ДатаОтчета") И ПараметрДанных.Использование Тогда
			ПользовательскийПараметр = 
				КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
					ПараметрДанных.ИдентификаторПользовательскойНастройки);
			ПараметрыВызова.Вставить("НачалоПериода", ПользовательскийПараметр.Значение.Дата);
			ПараметрыВызова.Вставить("КонецПериода", ПользовательскийПараметр.Значение.Дата);
		КонецЕсли;
		Если ПараметрДанных.Параметр =
			Новый ПараметрКомпоновкиДанных("Период") И ПараметрДанных.Использование Тогда
			ПользовательскийПараметр = 
				КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
					ПараметрДанных.ИдентификаторПользовательскойНастройки);
			ПараметрыВызова.Вставить("НачалоПериода", ПользовательскийПараметр.Значение.ДатаНачала);
			ПараметрыВызова.Вставить("КонецПериода", ПользовательскийПараметр.Значение.ДатаОкончания);
			ПараметрыВызова.Вставить("ИдентификаторПериод", ПользовательскийПараметр.ИдентификаторПользовательскойНастройки);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура Saby_ЗаполнитьЗначениеПараметраОтбора(ПараметрыВызова, Реквизит, Значение, Идентификатор)
	
КонецПроцедуры

// ЗаполнитьЗначенияПараметровОтбора
//
// Параметры:
// КомпоновщикНастроек - КомпоновщикНастроек - Компоновщик Настроек
// ПараметрыВызова - Структура - Параметры Вызова
//
Процедура Saby_ЗаполнитьЗначенияПараметровОтбора(КомпоновщикНастроек, ПараметрыВызова)
	Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) <> Тип("ЭлементОтбораКомпоновкиДанных")
			ИЛИ ПустаяСтрока(ЭлементОтбора.ИдентификаторПользовательскойНастройки) Тогда
			Продолжить;
		КонецЕсли;
		
		ПользовательскийОтбор = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
		ЭлементОтбора.ИдентификаторПользовательскойНастройки);
		
		КомпоновкаПараметровВызова(ПараметрыВызова, ЭлементОтбора, ПользовательскийОтбор);
		
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сотрудник.КЭДО") Тогда
			Если ПользовательскийОтбор.Использование 
				И ПользовательскийОтбор.ПравоеЗначение = Истина 
				И ПользовательскийОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				Тогда
				ПараметрыВызова.Вставить("ТолькоСотрудникиКЭДО", Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьЗначенияПериода(КомпоновщикНастроек, ПараметрыВызова);
КонецПроцедуры  

Процедура КомпоновкаПараметровВызова(ПараметрыВызова, ЭлементОтбора, ПользовательскийОтбор)
	Сравниваем = Ложь;
	
	ИмяПоляКомпоновки = "Организация";
	Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоляКомпоновки)
		ИЛИ ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТекущаяОрганизация") Тогда
		Сравниваем = Истина;
		ВидСравненияРЛ = "ВидСравненияОрганизация";
		ОбъектСравнения = ИмяПоляКомпоновки;
		ЕстьФильтрОбъекта = "ЕстьФильтрПоОрганизации";
		ИдентификаторОбъекта = "ИдентификаторОрганизация";
	КонецЕсли;
	
	Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФизическоеЛицо") Тогда   
		Сравниваем = Истина;
		ВидСравненияРЛ = "ВидСравненияФизическиеЛица";
		ОбъектСравнения = "ФизическиеЛица";
		ЕстьФильтрОбъекта = "ЕстьФильтрПоФизическимЛицам";
		ИдентификаторОбъекта = "ИдентификаторФизическоеЛицо";
	КонецЕсли;
	
	Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПодразделениеГоловногоСотрудникаНаКонецПериода")
		ИЛИ ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подразделение") Тогда
		Сравниваем = Истина;
		ВидСравненияРЛ = "ВидСравненияПодразделения";
		ОбъектСравнения = "Подразделения";
		ЕстьФильтрОбъекта = "ЕстьФильтрПоПодразделениям";
		ИдентификаторОбъекта = "ИдентификаторПодразделение";
	КонецЕсли;
	
	Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сотрудник") Тогда 
		Сравниваем = Истина;
		ВидСравненияРЛ = "ВидСравненияСотрудники";
		ОбъектСравнения = "Сотрудники";
		ЕстьФильтрОбъекта = "ЕстьФильтрПоСотрудникам";
		ИдентификаторОбъекта = Неопределено;
	КонецЕсли;
	
	Если Сравниваем Тогда
		ПараметрыВызова.Вставить(ВидСравненияРЛ, ПользовательскийОтбор.ВидСравнения);
		ПараметрыВызова.Вставить(ОбъектСравнения, ПользовательскийОтбор.ПравоеЗначение);
		ПараметрыВызова.Вставить(ЕстьФильтрОбъекта, ПользовательскийОтбор.Использование);
		Если ЗначениеЗаполнено(ИдентификаторОбъекта) Тогда 
			ПараметрыВызова.Вставить(ИдентификаторОбъекта, ПользовательскийОтбор.ИдентификаторПользовательскойНастройки);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
// BSLLS:CognitiveComplexity-on

Процедура ОбработатьКомандыРасчетногоЛистка(ФормаОтчета, Команда, Результат, context_params, ПараметрыВызова)
	Saby_ЗаполнитьЗначенияПараметровОтбора(ФормаОтчета.Отчет.КомпоновщикНастроек, ПараметрыВызова);
	ПараметрыВызова.Вставить("КлючВарианта", ФормаОтчета.ВариантыПанелиКлючТекущегоВарианта); 
	Если Команда.Имя = ПрефиксПродукта() + "КЭДО_ОтправитьРасчетныйЛистокВСбис" Тогда	
		ПараметрыВызоваИни = Новый Соответствие;
		ПараметрыВызоваИни.Вставить("list_doc_ref", ПараметрыВызова);
		МодульКомандыОбменаДляФормыКлиент().ОтправитьРасчетныйЛистокВСБИС(ПараметрыВызоваИни, context_params);
	ИначеЕсли Команда.Имя = ПрефиксПродукта() + "КЭДО_ОтправитьСокращенныйРасчетныйЛистокВСбис" Тогда	
		МодульКомандыОбменаДляФормыКлиент().ОтправитьСокращенныйРасчетныйЛистокВСБИС(ПараметрыВызова, context_params);
	ИначеЕсли Команда.Имя = ПрефиксПродукта() + "КЭДО_ОтправитьПрочийКадровыйРасчетныйЛистокВСбис" Тогда
		СписокРегламента = ПолучитьСписокРегламентов("CadresOther");
		ВыборРегламент = Новый СписокЗначений();
		ВыборРегламент.Добавить(Неопределено, "По умолчанию");
		Для каждого СтрРегл Из СписокРегламента Цикл
			ВыборРегламент.Добавить(СтрРегл["Name"], СтрРегл["Name"]);	
		КонецЦикла;	
		ПараметрыОповещения = Новый Структура();
		ПараметрыОповещения.Вставить("context_params", context_params);
		ПараметрыОповещения.Вставить("ПараметрыВызова", ПараметрыВызова);
		Оповещение = Новый ОписаниеОповещения("ОтправитьПрочийКадровыйРасчетныйЛистокВСБИС", ЭтотОбъект, ПараметрыОповещения );
		ВыборРегламент.ПоказатьВыборЭлемента(Оповещение, "Выберите регламент");
	Иначе
		// А иначе тут будут обрабоатываться все команды 1С
		// Поэтому просто еще раз установка результата
		Результат = Истина;
	КонецЕсли;	
	
	Результат = Истина;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьФормуТранспорта(context_param, ФормаВладелец = Неопределено)
	ФормаТранспорта = ПолучитьРеквизитВладельцаФорм("ТранспортИнтеграции"); 
	Если ФормаТранспорта <> Неопределено Тогда
		Возврат ФормаТранспорта;
	КонецЕсли;	
	ФормаТранспорт = ФормаОсновнойОбработки("Transport", ПутьКФормамОбработки(), Неопределено, ФормаВладелец);
	Если ФормаТранспорт <> Неопределено Тогда 
		ФормаТранспорт.ИнициироватьТранспорт();	
	КонецЕсли;
	Возврат ФормаТранспорт; 	
КонецФункции

Функция ПутьКФормамОбработки()
	ИмяОбработки = ИмяОбработки();
 	ПутьКФормам = "Обработка."+ИмяОбработки+".Форма.";
	Возврат ПутьКФормам;
КонецФункции

#Область include_base_ИмяОбработки
#КонецОбласти

#Область include_core_base_Helpers_ПолучитьФормуОбработки
#КонецОбласти 

#Область include_core_base_Helpers_ПолучитьРеквизитГлавнойФормыОбщийМодуль
#КонецОбласти

Функция ПолучитьСписокРегламентов(ВидОбъекта) Экспорт 
	ТипыДокументов = Новый Массив;
	ТипыДокументов.Добавить(ВидОбъекта);	

	context_params	= МодульCoreКлиент().ПроверитьНаличиеПараметровПодключения();
	ТранспортИнтеграции = ПолучитьФормуТранспорта(context_params);
	Возврат ТранспортИнтеграции.local_helper_regl_get_by_types(context_params, ТипыДокументов);
КонецФункции

Процедура Saby_ОбработчикКоманды_КЭДО(ФормаОтчета, Команда, Результат, context_params = Неопределено)
	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("НачалоПериода", 				Дата(1, 1, 1));
	ПараметрыВызова.Вставить("КонецПериода", 				Дата(1, 1, 1));
	ПараметрыВызова.Вставить("ФизическиеЛица", 				Неопределено);
	ПараметрыВызова.Вставить("Организация", 				Неопределено);
	ПараметрыВызова.Вставить("Подразделения", 				Неопределено);
	ПараметрыВызова.Вставить("Сотрудники", 					Неопределено);
	ПараметрыВызова.Вставить("ЕстьФильтрПоСотрудникам", 	Ложь);
	ПараметрыВызова.Вставить("ЕстьФильтрПоОрганизации", 	Ложь);
	ПараметрыВызова.Вставить("ЕстьФильтрПоПодразделениям", 	Ложь);
	ПараметрыВызова.Вставить("ЕстьФильтрПоФизическимЛицам",	Ложь);
	ПараметрыВызова.Вставить("ИдентификаторПериод",			"");
	ПараметрыВызова.Вставить("ИдентификаторФизическоеЛицо",	"");
	ПараметрыВызова.Вставить("ИдентификаторОрганизация",	"");
	ПараметрыВызова.Вставить("ИдентификаторПодразделение",	"");
	ПараметрыВызова.Вставить("ИдентификаторСотрудник",		"");
	ПараметрыВызова.Вставить("ВидСравненияПодразделения", 	Неопределено);
	ПараметрыВызова.Вставить("ВидСравненияОрганизация",	 	Неопределено);
	ПараметрыВызова.Вставить("ВидСравненияФизическиеЛица", 	Неопределено);
	ПараметрыВызова.Вставить("ТолькоСотрудникиКЭДО", 		Ложь);
	
	Если 	ФормаОтчета.ИмяФормы = "Отчет.АнализНачисленийИУдержаний.Форма" Тогда
		ПараметрыВызова.Вставить("Отчет", "АнализНачисленийИУдержаний");
		ОбработатьКомандыРасчетногоЛистка(ФормаОтчета, Команда, Результат, context_params, ПараметрыВызова);
	КонецЕсли;
	
	Если ФормаОтчета.ИмяФормы = "Отчет.АнализНачисленийИУдержанийАвансом.Форма" Тогда
		ПараметрыВызова.Вставить("Отчет", "АнализНачисленийИУдержанийАвансом");
		ОбработатьКомандыРасчетногоЛистка(ФормаОтчета, Команда, Результат, context_params, ПараметрыВызова);
	КонецЕсли;
	
	Если ФормаОтчета.ИмяФормы = "Отчет.ОстаткиОтпусков.Форма" Тогда
		Saby_ЗаполнитьЗначенияПараметровОтбора(ФормаОтчета.Отчет.КомпоновщикНастроек, ПараметрыВызова);
		ПараметрыОповещения = Новый Структура();
		ПараметрыОповещения.Вставить("context_params", context_params);
		ПараметрыОповещения.Вставить("ПараметрыВызова", ПараметрыВызова);
		Если Команда.Имя = ПрефиксПродукта() + "КЭДО_ЗагрузитьДанныеВSABY" Тогда	
			МодульКомандыОбменаДляФормыКлиент().ВыполнитьПроизвольныйИНИ("ОстаткиОтпусков_send", ПараметрыОповещения);
		КонецЕсли;	
		Если Команда.Имя = ПрефиксПродукта() + "КЭДО_ЗагрузитьВложенияВSABY" Тогда
			МодульКомандыОбменаДляФормыКлиент().ВыполнитьПроизвольныйИНИ("ПрочийКадровыйОстаткиОтпусков_send", ПараметрыОповещения);
		КонецЕсли;	
		Результат = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ОтправитьПрочийКадровыйРасчетныйЛистокВСБИС(ВыбранныйРегламент, ПараметрыОповещения) Экспорт
	Если ВыбранныйРегламент = Неопределено Тогда
		Возврат;
	Иначе		
		ПараметрыВызова = get_prop(ПараметрыОповещения, "ПараметрыВызова");
		ПараметрыВызова.Вставить("Регламент", ВыбранныйРегламент.Значение);
		ПараметрыОповещения.Вставить("ПараметрыВызова", ПараметрыВызова);
	КонецЕсли;	
	МодульКомандыОбменаДляФормыКлиент().ОтправитьПрочийКадровыйРасчетныйЛистокВСБИС(ПараметрыОповещения);	
КонецПроцедуры	
