
#Область include_base_CommonModule_ИменаМодулейСервер
#КонецОбласти

#Если Не ТолстыйКлиентОбычноеПриложение Тогда

#Область include_base_CommonModule_ИменаМодулейКлиент
#КонецОбласти

#КонецЕсли

&Перед("ПриНачалеРаботыСистемы")
Процедура Integration_ПриНачалеРаботыСистемы(Знач ОповещениеЗавершения, НепрерывноеВыполнение)
	#Если Не ТолстыйКлиентОбычноеПриложение Тогда
		Если Не МодульCore().ТекущемуПользователюМожноРаботатьСРасширением() Тогда
			Возврат;
		КонецЕсли;
	
		МодульCore().ПриНачалеРаботыСистемыНаСервере();
		МодульКомандыОбменаДляФормыКлиент().ПоказатьИнформационноеОкно();
		МодульКомандыОбменаДляФормыКлиент().ЗапускПроверкиНаличияПлагина();
	#Иначе   
		Возврат;	
	#КонецЕсли	
КонецПроцедуры
