
#Область include_base_CommonModule_ИменаМодулейСервер
#КонецОбласти

#Область include_base_CommonModule_ИменаМодулейКлиент
#КонецОбласти

&Перед("ПриНачалеРаботыСистемы")
Процедура Integration_ПриНачалеРаботыСистемы(Знач ОповещениеЗавершения, НепрерывноеВыполнение)
	МодульCore().ПриНачалеРаботыСистемыНаСервере();
	Если МодульCore().НеобходимПереносСтатусов() Тогда
		МодульФоновыеЗаданияКлиент().ПереносСтатусовSABY();
	КонецЕсли; 
	МодульКомандыОбменаДляФормыКлиент().ПоказатьИнформационноеОкно();
	МодульКомандыОбменаДляФормыКлиент().ЗапускПроверкиНаличияПлагина();
КонецПроцедуры
