
&После("ПриСозданииНаСервере")
Процедура Saby_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МодульВстраиваниеВСтандартныеФормы = МодульВстраиваниеВСтандартныеФормы(); 
	МодульВстраиваниеВСтандартныеФормы.ИзменитьЗапросДинамическогоСписка(
		ЭтотОбъект,
		Неопределено,
		Неопределено,
		"Список");

	// СтандартныеПодсистемы.Печать
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ФормаКоманднаяПанель;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.Печать
КонецПроцедуры

#Область include_base_CommonModule_ИменаМодулейСервер
#КонецОбласти
