//Процедура будет разной для каждой из конфигураций

Функция ОбъектыФормыИзПодсистемыКадры(Контекст)
	Результат = Ложь;
	Для Каждого ТипОбъекта Из Контекст.ТипыИсточников Цикл
		Результат = Результат Или ПринадлежитОбъектМетаданныхПодсистеме(ТипОбъекта, Метаданные.Подсистемы.Кадры);
		Результат = Результат Или ПринадлежитОбъектМетаданныхПодсистеме(ТипОбъекта, Метаданные.Подсистемы.Кадры.Подсистемы.ШтатноеРасписание);
		Результат = Результат Или ПринадлежитОбъектМетаданныхПодсистеме(ТипОбъекта, Метаданные.Подсистемы.Кадры.Подсистемы.ВоинскийУчет);
		//Завершим если хоть 1 объект принадлежит подсистеме "Кадры"
		Если Результат Тогда Прервать; КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

