	ДемоПродукт = Новый Структура();
	ДемоПродукт.Вставить("Name", "staff");
	ДемоПродукт.Вставить("App", "personal-edo");
	ДемоПродукт.Вставить("Caption", "Зарплата и кадры");
	ДемоПродукт.Вставить("Description", "От приема до увольнения без бумаги. В офисе и на удаленке");
	ДемоПродукты.Добавить(ДемоПродукт);

	ДемоПродукт = Новый Структура();
	ДемоПродукт.Вставить("Name", "hrm");
	ДемоПродукт.Вставить("App", "staff");
	ДемоПродукт.Вставить("Caption", "Управление персоналом");
	ДемоПродукт.Вставить("Description", "Подбор персонала, KPI, мотивация, HR-аналитика и управление корп. порталом");
	ДемоПродукты.Добавить(ДемоПродукт);
