//Процедура будет разной для каждой из конфигураций

Функция ОбъектыФормыИзПодсистемыКадры(Контекст)
	Результат = Ложь;
	МДЗарплатаКадры = Метаданные.Подсистемы.ЗарплатаКадрыПриложения.Подсистемы.ЗарплатаКадрыДляНебольшихОрганизаций;
	Для Каждого ТипОбъекта Из Контекст.ТипыИсточников Цикл
		//БольничныйЛист, Отпуск, ОтпускБезСохраненияОплаты	
		Результат = Результат Или ПринадлежитОбъектМетаданныхПодсистеме(ТипОбъекта, МДЗарплатаКадры.Подсистемы.РасчетЗарплаты);
		//Прием, Увольнение, КадровыйПеревод
		Результат = Результат Или ПринадлежитОбъектМетаданныхПодсистеме(ТипОбъекта, МДЗарплатаКадры.Подсистемы.КадровыйУчет);
		//ДоговорыГПХ
		Результат = Результат Или ПринадлежитОбъектМетаданныхПодсистеме(ТипОбъекта, МДЗарплатаКадры.Подсистемы.ДоговорыГПХ);
		//Сотрудник
		Результат = Результат Или ПринадлежитОбъектМетаданныхПодсистеме(ТипОбъекта, Метаданные.Подсистемы.БухгалтерияПредприятияПодсистемы.Подсистемы.ПростойИнтерфейс);
		//Завершим если хоть 1 объект принадлежит подсистеме "Кадры"
		Если Результат Тогда Прервать; КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

